{
  "sessions": [
    {
      "key": "_e_os__mon_smartphone_android_sans_google",
      "openfeedbackId": "eosmonsmartphoneandroidsansgoogle",
      "title": "/e/OS, mon smartphone Android sans Google",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "mobile"
      ],
      "complexity": "Beginner",
      "speakers": [
        "benoit_masson"
      ],
      "slot": "day-2-quickie-1",
      "room": "Tour Bretagne",
      "abstract": "Vous avez sans doute déjà entendu (ou prononcé) les phrases suivantes :\n\n> « Je peux partager mes données, je n'ai rien à cacher »  \n> « Android c'est open-source, mes données sont protégées »\n\nSauf qu'en fait, non… votre smartphone sait beaucoup de choses sur vous, et en partage énormément avec Google (Android) ou Apple (iOS). Et même si vous n'avez rien à cacher, vous n'avez pas intérêt à tout dévoiler (vie privée, sécurité, dépendance, profilage, …).\n\nJe vais vous présenter [/e/OS](https://e.foundation/), une distribution Android créée pour respecter votre vie privée :\n- suppression des services Google intégrés\n- applications open-source respectueuses de vos données\n- cloud respectueux ou auto-hébergé\n\nLe tout est facile d'accès, compatible avec un grand nombre de terminaux, et conserve une compatibilité maximale avec tous vos services.\n\nEt si vous n'avez pas envie de changer de téléphone ou de tout réinstaller du jour au lendemain, on évoquera des pistes pour reprendre progressivement la main sur vos données."
    },
    {
      "key": "_openfeature____la_normalisation_du_feature_flags__",
      "openfeedbackId": "openfeaturelanormalisationdufeatureflags",
      "title": " OpenFeature :  La normalisation du feature flags ?",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "languages"
      ],
      "complexity": "Beginner",
      "speakers": [
        "morgan_blanloeil"
      ],
      "slot": "day-1-quickie-1",
      "room": "Titan",
      "abstract": "Les feature flags révolutionnent la gestion des fonctionnalités logicielles en permettant une activation ou une désactivation dynamique. Promu par la CNCF, OpenFeature s’impose comme la nouvelle norme du feature flags. Découvrons ensemble l'intégration de cette solution sur un projet front et back office. Avec l’aide des différents providers et de la nouvelle norme OFREP (OpenFeature Remote Evaluation Protocol ), nous verrons en quoi OpenFeature se veut no vendor lock-in !"
    },
    {
      "key": "alors__quoi_de_neuf_dans_es2026__",
      "openfeedbackId": "alorsquoideneufdanses2026",
      "title": "Alors, quoi de neuf dans ES2026 ?",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "languages"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "christophe_porteneuve"
      ],
      "slot": "day-2-conference-3",
      "room": "Jules Verne",
      "abstract": "Oui, oui, ES2015 déchire et ES2016–2024 nous ont apporté plein de choses cool (async / await, l'itération asynchrone, l'optional chaining, les membres privés…), mais y'a un tas d'autres pépites qui vont bientôt débarquer… et on peut déjà jouer avec nombre d'entre elles !\n\nChristophe vous fait un tour d'horizon des nouveautés à venir qui l'intéressent le plus, qu’elles soient sur le point d'être officialisées… ou un peu plus expérimentales !"
    },
    {
      "key": "amazing_css_in_2024",
      "openfeedbackId": "amazingcssin2024",
      "title": "Amazing CSS in 2024",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "adam_argyle"
      ],
      "slot": "day-1-conference-5",
      "room": "Jules Verne",
      "abstract": "A fast paced tour of incredible features added to CSS (and some HTML and JS) over the past few years. This talk will give you a healthy overview of new tools for your UI tool belt. From animation to interaction, there's so much to talk about, you're bound to walk away with exciting and meaningful ways to improve your web applications."
    },
    {
      "key": "analogjs_le_meta_framework_pour_angular",
      "openfeedbackId": "analogjslemetaframeworkpourangular",
      "title": "AnalogJS, le meta-framework pour Angular que l'on attendait plus ( ou pas )",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "benjamin_legrand"
      ],
      "slot": "day-1-conference-4",
      "room": "Titan",
      "abstract": "AnalogJS est un nouveau venu dans le monde des meta-frameworks.\n\nQu'est ce qu'un meta-framework déjà ? Chaque framework SPA en a un, React a Next.js ou Remix, Vue.JS a Nuxt, Svelte a sveltekit, Qwik a Qwik city\n\nEt maintenant Angular a AnalogJS. Qu'est ce qu'on peut faire avec ce genre de solutions ?\n\nDu routage basé sur l'arborescence de répertoire et de fichiers, du rendu serveur dès la sortie de la boite, et plein d'autres fonctionnalités...\n\nVoyons ensemble comment tout ça fonctionne et pourquoi c'est super-ultra-méga-cool."
    },
    {
      "key": "anatomie_d_une_faille",
      "openfeedbackId": "anatomiedunefaille",
      "title": "Anatomie d'une faille",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "security"
      ],
      "complexity": "Beginner",
      "speakers": [
        "olivier_poncet"
      ],
      "slot": "day-2-conference-5",
      "room": "Jules Verne",
      "abstract": "Coup de tonnerre ! Le vendredi 29 mars 2024 fut révélée une tentative d'attaque qui aurait pu avoir des conséquences désastreuses ; le projet xz-utils, fournissant des outils et bibliothèques de compression de données, était alors compromis par une ingénieuse attaque qui aurait pu donner accès à n'importe quel serveur exposé dans le monde ... attaque qui n'a pu aboutir grâce à un heureux concours de circonstances.\n\nSortez les scalpels ! Je vous propose de mettre cette attaque sur la table d'autopsie afin d'en étudier son anatomie : de son déroulement,s'écoulant sur plus de deux longues années, aux techniques d'ingénierie sociale et d'ingénierie logicielle utilisées. Nous reviendrons enfin sur les risques et conséquences liés aux attaques visant la supply-chain du monde du logiciel libre et open-source."
    },
    {
      "key": "angular_renaissance__on_restaure_la_chapelle_sixtine_",
      "openfeedbackId": "angularrenaissanceonrestaurelachapellesixtine",
      "title": "Angular Renaissance: on restaure la Chapelle Sixtine!",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "camille_pillot",
        "gerome_grignon"
      ],
      "slot": "day-2-codelab-2",
      "room": "L'Atelier",
      "abstract": "Officialisé par la sortie d'Angular 17, ce terme 'Angular Renaissance' incarne les différents changements majeurs opérés par la core team et les contributeurs afin d'améliorer le framework et le préparer aux dix ans d'évolutions à venir.\n\nAfin de vous accompagner dans l'adoption de ces changements, nous vous invitons dans cet atelier à les expérimenter sous la forme d'un exercice de migration d'une application Angular 14 vers Angular 18.\n\nVous apprendrez entre-autres à ne plus dépendre de ngModules, à utiliser le nouveau Control Flow et à intégrer les Signals et comprendre leurs cas d'usage.\n\nMettez vos connaissances à jour et rejoignez-nous!\n\n@let it be!"
    },
    {
      "key": "ariga_atlas__pour_aller_au_bout_du_gitops",
      "openfeedbackId": "arigaatlaspourallerauboutdugitops",
      "title": "Ariga Atlas, pour aller au bout du GitOps",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "guillaume_moirod"
      ],
      "slot": "day-1-quickie-2",
      "room": "Titan",
      "abstract": "Vous pronez le GitOps : votre infrastructure est déclarée en IaC, Kubernetes fait tourner vos applications, FluxCD ou ArgoCD est votre allié au déploiement, même vos pipelines CI sont déclaratifs. Vous êtes au top !\nEt pourtant, en y regardant de plus près.... Vous gérez toujours vos bases de données relationnelles en impératif, même en employant des frameworks comme Liquibase ou Flyway...\n\nDécouvrons ensemble Ariga Atlas, surnommé \"Terraform pour les migrations de schema BDD\", qui propose une alternative déclarative pour vos schémas BDD et enfin aller au bout de votre démarche GitOps !\n(Talk avec 0% d'IA)\n"
    },
    {
      "key": "atelier_ia_sprint__prototypez_et_testez_vos_idees_en_quelques_heures",
      "openfeedbackId": "atelieriasprintprototypezettestezvosideesenquelquesheures",
      "title": "Atelier IA Sprint: prototypez et testez vos idées en quelques heures",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "philippe_antoine"
      ],
      "slot": "day-1-codelab-3",
      "room": "Hangar",
      "abstract": "Et si au lieu de passer 6+ mois sur vos projets vous testiez vos idées et vos projets en quelques heures ?\n\nJe vous propose des retours d’expérience sur les AI Sprint: inspiré des design sprint et du design thinking, il s’agit d’un atelier en 5 étapes qui vous fait passer d’une idée à un prototype fonctionnel en quelques heures.\n\nLe déroulé:\n1. Créer les profils de vos utilisateurs / utilisatrices \n2. Se projeter dans leurs défis / challenges\n3. Imaginer des dizaines de solutions et sélectionner la meilleure\n4. Prototyper grâce à l’IA\n5. Valider avec des vrais utilisateurs (avec un twist IA)\n\nPour chaque étape je vous propose mes tips and tricks, les résultats obtenus et surtout les feedbacks des utilisateurs et des participants. Je vous présenterai aussi comment j’utilise les outils d’IA pour accélérer et augmenter la qualité de chaque étape … jusqu’à une petite surprise pour la dernière avec les tests des prototypes avec les utilisateurs."
    },
    {
      "key": "boostez_vos_sites_et_applications_web_avec_le_code_http__103_early_hints_",
      "openfeedbackId": "boostezvossitesetapplicationswebaveclecodehttp103earlyhints",
      "title": "Boostez vos sites et applications web avec le code HTTP \"103 Early Hints\"",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "kevin_dunglas"
      ],
      "slot": "day-2-quickie-2",
      "room": "Tour Bretagne",
      "abstract": "Depuis peu les navigateurs les plus populaires ont implémenté un nouveau code d'état HTTP : 103 Early Hints.\n\nCe nouveau type de réponse, plutôt inhabituel, a un seul objectif : accélérer le temps de chargement de vos sites web et applications en permettant au navigateur de précharger les ressources dont il aura besoin pour rendre la page.\n\nDans cette présentation, nous verrons en quoi la réponse 103 diffère des autres techniques de préchargement telles que HTTP/2+ Server Push ou les balises \\<link ref=\"preload\">, et comment en tirer parti pour améliorer la performance de vos sites et apps."
    },
    {
      "key": "bug_bounty___revolutionner_la_detection_des_vulnerabilites_dans_votre_si_et_passer_a_l_echelle",
      "openfeedbackId": "bugbountyrevolutionnerladetectiondesvulnerabilitesdansvotresietp",
      "title": "Bug Bounty : Révolutionner la détection des vulnérabilités dans votre SI et passer à l'échelle",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "security"
      ],
      "complexity": "Beginner",
      "speakers": [
        "florent_le_borgne",
        "florian_girard"
      ],
      "slot": "day-2-conference-3",
      "room": "Belem",
      "abstract": "Rejoignez nous lors d'une conférence où l'univers du Bug Bounty sera démystifié et contextualisé au sein d'un groupe de 5000 collaborateurs. Forts d’une expertise de cinq ans dans la pratique du Bug Bounty, nous vous invitons à explorer l’intégration et l'impact de ces programmes au sein de différentes DSI, dans une structure aux multiples facettes.\n\nQu'il s'agisse de sites web, d'applications mobiles, d'API ou de progiciels, découvrez comment le Bug Bounty se déploie sur diverses applications pour renforcer la sécurité informatique. Nous partagerons avec vous les clés du succès, les leçons apprises et les défis surmontés, grâce à des témoignages vécus et des retours d'expérience concrets.\n\nVous êtes curieux des techniques employées? Nous aborderons aussi les différents modes opératoires du Bug Bounty, y compris les approches boîte blanche, grise et noire, et leur pertinence selon les contextes et les objectifs de sécurité.\n\nCette session promet de vous fournir des perspectives enrichissantes et des stratégies éprouvées pour capitaliser sur le Bug Bounty et transformer la sécurité de votre organisation"
    },
    {
      "key": "code_case___les_methodes_de_la_crim_adaptees_au_code_",
      "openfeedbackId": "codecaselesmethodesdelacrimadapteesaucode",
      "title": "Code Case : les méthodes de la crim adaptées au code!",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "sylvain_coudert"
      ],
      "slot": "day-1-conference-3",
      "room": "Belem",
      "abstract": "Et si nous nous mettions à tracker nos pain-points comme on track des criminels?  \nEt si notre historique git recelait plus d'informations sur notre architecture que nous ne le pensions?  \nEt si toutes les traces qui y sont laissées étaient autant d'indices exploitables au même titre qu'une empreinte digitale ou une trace ADN?\n\n\"Your code as a crime scene\" est un livre de Adam Tornhill qui propose de transposer des techniques d'investigations criminelles reconnues dans le but de débusquer les problématiques de notre code.  \nL'auteur fournit en parallèle un ensemble d'outils qui prennent tout leur sens à la lecture des méthodes évoquées.\n\nRetour d'expérience sur l'utilisation de quelques unes de ces techniques sur un projet réel, ce qu'elles ont permis d'identifier, de prendre comme action et les premiers bénéfices qui ont pu en ressortir."
    },
    {
      "key": "comment_on_a_pimpe_la_4l_de_papy_pour_explorer_mars__ou_presque_",
      "openfeedbackId": "commentonapimpela4ldepapypourexplorermarsoupresque",
      "title": "Comment on a pimpé la 4L de Papy pour explorer Mars (ou presque)",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "iot_hardware"
      ],
      "complexity": "Beginner",
      "speakers": [
        "ilona_marie_lemaire_lefebvre",
        "melissa_cruz"
      ],
      "slot": "day-1-conference-1",
      "room": "Belem",
      "abstract": "Résumé :\n\nNous exposons nos travaux d’intégration de composants edge dans un véhicule prototype envoyé dans le désert à travers la présentation de l’étude R&D ESC4L - Embedded Sensors for Connected 4L qui traite des sujets d’aide à la navigation et au pilotage au travers d’une architecture système et logicielle green, multi-capteurs, embarquée, offline et expérimentée sur le terrain lors de raids automobiles pour Renault 4L, pour adresser les domaines de la robotique spatiale, du transport et de la défense. \n\nMots clés : Edge Computing, IA, Embarqué, IoT, Green Computing\n\n1.\tIntroduction\n\nLes environnements déstructurés représentent tout type de terrain non structuré pas l’Homme pour accueillir des véhicules terrestres. Sur des terrains désertiques, les théâtres d’opérations militaires ou bien Mars, les véhicules et Rovers sont difficiles à manœuvrer et induisent une charge cognitive importante au pilote pour se repérer et naviguer dans des zones à risques : \no\tTerrain sableux et rocheux, \no\tTempératures variables et parfois élevées \no\tMétéo contraignante type tempête de sable qui induit une visibilité réduite\no\tCommunication limitée, brouillage, hors zone\n\nLibérer la charge mentale du pilote ou de l’opérateur est donc critique pour assurer la réussite de la mission. Pour apporter une aide au pilotage et à la décision plusieurs options sont possibles :\no\tSe libérer d’actions manuelles\no\tConnaître l’état de son système pour en anticiper les pannes et la maintenance\no\tFaciliter la communication entre équipage et/ou systèmes et la restitution de la mission\n\nLes méthodes actuelles de géolocalisation se basent principalement sur la technologie GNSS, qui peut ne pas être disponible ou utilisable dans cet environnement. La détection de relief et d’obstacles est aujourd’hui possible grâce à des techniques de stéréoscopie basées sur des méthodes scientifiques classiques. \nLa reconnaissance vocale est aujourd’hui largement mise en œuvre grâce à l’utilisation d’une connexion internet et d’un accès Cloud pour effectuer les requêtes de l’utilisateur. Elle permet de se décharger d’actions manuelle par l’utilisation de la parole à la place. Dans un environnement bruyant comme le nôtre, des techniques de réduction de bruit et de filtrage du son sont aujourd’hui à l’état de l’art afin d’améliorer la qualité d’une communication. \n\nPour connaître l’état d’un système tel qu’un véhicule, il est nécessaire d’étudier les différentes remontées capteurs qui le composent, dans un but de détection de pattern de comportement, anormal ou non, de détection d’anomalies, et d’alerte, et ce, dans le temps.\n\nL’ensemble des techniques citées ci-dessus nécessitent des sources de données massives et hétérogènes, qu’il faut pouvoir fusionner afin d’en corréler les résultats et assurer la fiabilité des informations restituées. L’apport de l’IA est, dans certains cas, nécessaire pour ces analyses, et peut également améliorer les résultats fournis par les techniques scientifiques classiques. De plus, ces différentes méthodes sont gourmandes en ressources, ce qui, jusque-là, limitait leur portage en embarqué. Or, il est capital dans notre environnement de porter tous ces traitements en embarqué, sans connexion externe au système, tout en respectant des contraintes temps réel liées à l’environnement hostile et en garantissant une robustesse du système dans cet environnement extrême. \n\nL’étude ESC4L- ESC4L - Embedded Sensors for Connected 4L, vise à développer un prototype physique multi-capteurs permettant la valorisation et le traitement massif de ces données, dès l'acquisition, en temps réel dans un environnement embarqué, contraint et hostile.\n\n2.\tMéthodologie\n\nNous présentons les différents chantiers d’aide à la navigation et d’aide au pilotage réalisés dans l’étude : \n-\tNavigation sans signal GPS (GNSS-Denied) avec algorithmes de localisation et maintien de cap basés sur de la navigation multi centrales inertielles\n-\tMonitoring temps réel de remontées capteurs mécaniques, ici de moteur, pour effectuer des diagnostics des équipements\n-\tEtude de navigabilité terrain par stéréoscopie Deep Learning\n-\tAssistance vocale embarquée offline avec algorithmes de traitement de la parole et réduction de bruit\n\nCes différentes capacités nécessitent de traiter les concepts suivants : \n-\tFusion multi-capteurs et traitement de données hétérogènes\n-\tEmbarquabilité des algorithmes\n-\tRestitution ergonomiques de l’ensemble des informations élaborées\n-\tConception green et autonomie du système \n\n3.\tOriginalité / Perspectives\n\nNous menons depuis plus de quatre ans des travaux sur l’IA embarquée et avons pu réaliser divers petits prototypes d’applications de l’IA en embarqué, dans notre laboratoire à Mérignac. Nous avons souhaité cette fois-ci monter en maturité et atteindre des TRL de plus en plus élevés, autrement dit, passer d’un environnement labo à une expérimentation sur le terrain en conditions significatives, voire très représentatives d’un environnement désertique.\n\nPour cela nous avons choisi de prototyper sur véhicule Renault 4L et d’expérimenter notre système à travers deux raid automobiles réservés aux 4L : \n\n-\tRaid SDO Terres d’Aventures Aveyron, qui s’est déroulé en septembre 2023\n-\tRaid 4L Trophy, du 15 au 25 février 2024. Nous pourrons alors présenter nos tous derniers résultats suite à ce raid final de l’étude.\n\nUne attention particulière a été portée sur le choix du matériel, la conception des logiciels et l’architecture physique du système afin qu’il soit le plus frugal possible en ressources, et qu’il soit autonome en énergie grâce à une alimentation par panneaux solaires. Egalement, il a été indispensable que ces nouvelles capacités soient compatibles avec des véhicules ancienne génération pour éviter de devoir produire une nouvelle flotte entière de véhicules. "
    },
    {
      "key": "comprendre_l_ia__construisez_votre_propre_chatgpt_securise_avec_node_js_et_langchain",
      "openfeedbackId": "comprendreliaconstruisezvotreproprechatgptsecuriseavecnodejsetla",
      "title": "Comprendre l'IA: construisez votre propre ChatGPT sécurisé avec Node.js et LangChain",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Beginner",
      "speakers": [
        "thomas_rannou",
        "yohan_lasorsa"
      ],
      "slot": "day-2-codelab-1",
      "room": "Les Machines",
      "abstract": "Les technologies d'IA, et particulièrement les grand modèles de langages (LLM) poussent un peu partout comme des champignons ces derniers temps. Comment ces modèles fonctionnent-ils, et comment s'en servir dans vos applications?\n\nDans ce workshop, nous allons construire de zéro un chatbot basé sur GPT-4 et implémentant le pattern **Retrieval Augmented Generation** (RAG). En utilisant une base de documents de référence, le modèle sera capable de répondre à des questions en langage naturel, et de générer des réponses complètes et sourcées dans vos documents. Pour cela, nous allons créer un service Node.js qui s'appuiera sur le framework open-source LangChain, ainsi qu'un site web pour tester notre chatbot.\n\n**Au programme**:\n- Introduction aux modèles de langage: fonctionnement et limites\n- Création d'une base de connaissances: embeddings, BDD vectorielle et recherche par similarité\n- Utilisation de [LangChain](https://js.langchain.com/) pour implémenter le pattern RAG (Retrieval Augmented Generation)\n- Introduction au *prompt engineering* pour améliorer les performances\n- Création d'une API Node.js pour interagir avec le modèle\n- Création d'un site web pour tester le chatbot\n\nEt pour ceux qui voudront aller plus loin, nous fourniront également les instructions pour déployer le tout sur Azure avec un pipeline CI/CD.\n\nA l'issue du workshop, vous aurez une compréhension plus claire des grands modèles de langage et de leur fonctionnement, ainsi que des idées pour les utiliser dans vos applications. Vous saurez également comment créer une base de connaissances et un chatbot fonctionnels ainsi que des astuces pratiques pour leur implémentation."
    },
    {
      "key": "creer_un_operateur_kubernetes_avec_quarkus_et_l_operator_sdk",
      "openfeedbackId": "creerunoperateurkubernetesavecquarkusetloperatorsdk",
      "title": "Créer un opérateur Kubernetes avec Quarkus et l'operator SDK",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "loic_mathieu"
      ],
      "slot": "day-2-quickie-1",
      "room": "Titan",
      "abstract": "Kubernetes est un outil très répandu qui permet d’orchestrer des déploiements d'application, c'est un outil d'infrastructure as code.\n\nKubernetes est extensible grâce aux Custom Resource Definitions (CRD), une CRD permet de définir une ressource personnalisée qui permettra de tirer parti des capacités d'automatisation de Kubernetes via un opérateur qui prendre en charge ce nouveau type de ressource.\n\nDans ce talk, après avoir expliqué ce qu'est une CRD et un opérateur Kubernetes, je vous montrerais comment créer en quelques lignes de code un opérateur permettant lors de la création ou de la modification d'une CRD d'appeler une API distante pour créer ou mettre à jour un objet correspondant. Tout ça grâce à Quarkus et l'operator SDK."
    },
    {
      "key": "cutting_through_the_layers__anatomy_of_a_linux_system",
      "openfeedbackId": "cuttingthroughthelayersanatomyofalinuxsystem",
      "title": "Cutting through the layers: anatomy of a Linux system",
      "language": "English",
      "talkType": "quickie",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "simon_chopin"
      ],
      "slot": "day-1-quickie-1",
      "room": "Belem",
      "abstract": "Ever had to patch a critical CVE on your production systems, only to wonder\nwhat the affected component even does? Even the barest Linux system is actually\ncomposed of a plethora of independant projects, of which most users have little\nto no awareness... until something breaks. In this talk, I'll guide you through\na quick tour of a typical Ubuntu system, before diving into concrete examples\nof how these various codebases interact with each other."
    },
    {
      "key": "cyber_resilience_act___21_mois_pour_y_preparer_vos_chaines_devsecops",
      "openfeedbackId": "cyberresilienceact21moispourypreparervoschainesdevsecops",
      "title": "Cyber Resilience Act : 21 mois pour y preparer vos chaînes DevSecOps",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "security"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "david_robin"
      ],
      "slot": "day-2-conference-1",
      "room": "Tour Bretagne",
      "abstract": "Le Cyber Resilience Act est une initiative clé pour bâtir un avenir numérique plus sûr en Europe, en exigeant des fabricants et des détaillants qu’ils donnent la priorité à la cybersécurité et en habilitant les clients et les entreprises à faire des choix plus éclairés concernant la sécurité des produits numériques.\nMais c'est aussi un nouveau cahier des charges, avec de nouvelles contraintes légales à respecter, sous peines de lourdes pénalités financières  et de retrait des produits du marché.\nDécouvrons ensemble cette nouvelle loi, qui vient compléter le NIS2 en terme de cyber sécurité européenne, et  comment nous y préparer ! "
    },
    {
      "key": "data_et_sport___la_revolution",
      "openfeedbackId": "dataetsportlarevolution",
      "title": "Data et sport : la révolution",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Advanced",
      "speakers": [
        "eric_alard"
      ],
      "slot": "day-2-quickie-2",
      "room": "Jules Verne",
      "abstract": "Ancien sportif et coach olympique en bobsleigh, j’ai pu voir l’influence grandissante de la technologie et des data dans le sport de haut niveau.\nQue ce soit du côté sportif comme spectateur. \nJ’ai récemment fait un TEDx sur ce thème à Orléans.\nUne conférence sur ce thème me semble intéressante lors du DevFest."
    },
    {
      "key": "dbt__ou_comment_facilement_construire_vos_donnees",
      "openfeedbackId": "dbtoucommentfacilementconstruirevosdonnees",
      "title": "Dbt, ou comment facilement construire vos données",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Beginner",
      "speakers": [
        "guillaume_le_floch"
      ],
      "slot": "day-1-quickie-2",
      "room": "Tour Bretagne",
      "abstract": "La gestion efficace des données est essentielle pour toute organisation moderne, mais la construction de pipelines de données robustes et évolutifs peut souvent être un défi. \n\nDans cette présentation, nous explorerons DBT (Data Build Tool), une solution révolutionnaire pour la transformation des données.\n\nDBT simplifie le processus de création de pipelines de données en utilisant des techniques de modélisation relationnelle et en s'intégrant parfaitement à vos entrepôts de données existants. \nNous discuterons des principes fondamentaux de DBT, de son architecture flexible et de son utilisation pratique pour accélérer le développement de vos flux de données tout en respectant les bonnes pratiques de développement. \n\nQue vous soyez un analyste de données, un ingénieur ou un responsable technique, cette présentation vous fournira les connaissances et les outils nécessaires pour libérer le potentiel de vos données et optimiser votre workflow d'analyse.\n\n\n\n\n\n\n"
    },
    {
      "key": "de_monolithe_a_modulith___l_histoire_d_un_exorcisme",
      "openfeedbackId": "demonolitheamodulithlhistoiredunexorcisme",
      "title": "De Monolithe à Modulith : L'histoire d'un Exorcisme",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "languages"
      ],
      "complexity": "Beginner",
      "speakers": [
        "melanie_bats",
        "stephane_begaudeau"
      ],
      "slot": "day-1-conference-4",
      "room": "Belem",
      "abstract": "Plongez dans une aventure terrifiante où nous avons exorcisé les démons de notre projet open source Sirius Web pour transformer son architecture monolithique cauchemardesque en un modulith élégant et structuré.\nA cette époque, notre projet était un peu comme une maison hantée, remplie de dépendances maudites et de code labyrinthique. Pour échapper à cette architecture monolithique effrayante, nous avons adopté une architecture hexagonale et les principes du Domain Driven Design. Cette transformation a permis de purifier notre code et d'améliorer la clarté et les performances de notre système.\nNous partagerons avec vous les monstres architecturaux que nous avons affrontés : des dépendances infernales aux intégrations démoniaques, et comment nous avons vaincu ces entités avec des solutions simples. Nous révélerons nos astuces pour faire évoluer vos applications monolithiques vers une architecture plus modulaire et évolutive, tout en évitant les pièges et les horreurs que nous avons rencontrés.\nRejoignez-nous pour explorer les recoins sombres des défis architecturaux rencontrés et apprenez comment chasser les fantômes de votre code pour transformer vos projets en systèmes robustes et flexibles."
    },
    {
      "key": "dev_des_12_ans___les_petits_hackers_vous_expliquent_comment",
      "openfeedbackId": "devdes12anslespetitshackersvousexpliquentcomment",
      "title": "Dev dès 12 ans : Les Petits Hackers vous expliquent comment",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "iot_hardware"
      ],
      "complexity": "Beginner",
      "speakers": [
        "adrien",
        "benjamin_bernard"
      ],
      "slot": "day-2-quickie-1",
      "room": "Belem",
      "abstract": "Depuis plus de 11 ans, l'association Maison du Libre à Brest anime les ateliers des Petits Hackers, où des développeurs et ingénieurs passionnés guident des jeunes de 12 à 17 ans dans la réalisation de leur propre projets. Dans un esprit \"maker\" et \"Do It Together\", ces jeunes partent de zéro pour créer et collaborer entre eux.\n\nRym (15 ans) et Adrien (14 ans) viendront vous présenter eux-mêmes les projets qu'ils ont développés, l'approche collaborative adoptée, les liens qu'ils ont forgés et les compétences qu'ils ont acquises. Découvrez comment ces ateliers ont stimulé leur passion pour le dev.\n\nProjets présentés :\n  * Utilisation de la carte Micro:bit, pour initier d'autres jeunes à la programmation lors des salons\n  * Parcours web interactif sur le chiffrement et la stéganographie : stegano.lph.bzh\n  * Jacobot, un robot éducatif construit avec Arduino, inspiré du Cubetto, pour apprendre la programmation\n  * DonkeyCar : projet ayant initié près de 5 000 personnes à l'IA à l'aide de voiture RC et Raspberry Pi\n  * ROSA : petit robot capable de se déplacer et détecter des obstacle ayant donné lieu à la création d'un parcours pédagogique : \n\nNe manquez pas cette occasion unique de découvrir comment ces jeunes dev transforment leurs idées en réalité et pourquoi pas vous aussi lancer ce type d'ateliers ailleurs en France :)"
    },
    {
      "key": "developpe_sur_un_toaster_grace_a_coder",
      "openfeedbackId": "developpesuruntoastergraceacoder",
      "title": "Développe sur un toaster 🍞 grâce à Coder",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "melissa_pinon",
        "paul_vulliemin"
      ],
      "slot": "day-2-conference-3",
      "room": "Tour Bretagne",
      "abstract": "Vos développeurs se plaignent continuellement que leurs **PCs** sont des **toasters** ?\n\nQue les **environnements de développements** ne sont pas **homogènes** ?\n\nVos **managers** râlent sur les temps d'**installation de postes** ?\n\nVenez donc découvrir les **Cloud Development Environments** : des environnements de développement distants tout en un, disposant de tous les outils nécessaire à vos développeurs.\n\nNous utiliserons **Coder** pour **orchestrer nos environnements**.\nIl fonctionne avec les IDE **Jetbrains** et **VSCode** et pourrait vous aider à atténuer ces points de douleurs. Et par dessus tout ... c'est **Open Source** et **gratuit** !\n\nNous verrons comment créer un environnement dans **Kubernetes**, en s'appuyant sur **Terraform**, et comment l'utiliser, en se mettant dans la peau d'un développeur."
    },
    {
      "key": "dis_papa__c_est_quoi_la_generation_procedurale_",
      "openfeedbackId": "dispapacestquoilagenerationprocedurale",
      "title": "Dis papa, c'est quoi la génération procédurale?",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "flavien_normand"
      ],
      "slot": "day-2-quickie-2",
      "room": "Titan",
      "abstract": "Vous vous êtes sûrement déjà demandé comment les jeux vidéos pouvaient transformer des valeurs aléatoires en divers monstres, donjons et autres mondes infinis (même si parfois, les résultats sont... étranges)?\n\nDans ce talk, nous allons démystifier et vulgariser la génération procédurale au sein des jeux vidéos, diverses approches et leurs combinaisons, pour montrer qu'après tout, ce n'est qu'une combinaison de maths de base et de logique très simple, pour donner des résultats impressionnants."
    },
    {
      "key": "du_cauchemar_au_conte_de_fee___demystifions_une_architecture_conteneurisee_avec_kubernetes",
      "openfeedbackId": "ducauchemaraucontedefeedemystifionsunearchitectureconteneuriseea",
      "title": "Du cauchemar au conte de fée : Démystifions une architecture conteneurisée avec Kubernetes",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "ambre_person",
        "gwenael_bec"
      ],
      "slot": "day-1-codelab-2",
      "room": "L'Atelier",
      "abstract": "La gestion de vos environnements legacy terrorise vos journées et hante vos nuits ? \nVous aimeriez passer au Cloud mais les schémas d'architecture conteneurisée vous donnent des sueurs froides ?\n\nVenez démystifier avec nous les composants de base d'une architecture conteneurisée sur Kubernetes. (Namespaces, Pods, Deployments, Services, Configmaps, Ingress, Statefulset, Volumes, Secrets…) \n\nNous expliciterons et mettrons en pratique ces composants pas à pas sur le cas du déploiement d'une application web n-tiers (front-end, back-end, base de données)."
    },
    {
      "key": "dynamisez_vos_backends_avec_htmx",
      "openfeedbackId": "dynamisezvosbackendsavechtmx",
      "title": "Dynamisez vos backends avec HTMX",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "alexis_lozano"
      ],
      "slot": "day-2-quickie-1",
      "room": "Jules Verne",
      "abstract": "Les sites et applications web sont souvent architecturées de la même manière. Au choix:\n\n- on développe un backend qui renvoie du HTML directement et qui recharge la page à chaque action\n- on développe un backend et un frontend qui communiquent par des requêtes AJAX pour mettre à jour uniquement une partie de la page\n\nEt si on pouvait garder la codebase unique du premier avec les pages dynamiques du second ? C'est ce dont on va parler avec en fil rouge le site [salaires.dev](https://salaires.dev) que j'ai développé et que j'ai récemment fait évoluer grâce à HTMX."
    },
    {
      "key": "enter_the_daggerverse__",
      "openfeedbackId": "enterthedaggerverse",
      "title": "Enter the Daggerverse !",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "emeric_martineau",
        "julien_haumont"
      ],
      "slot": "day-2-codelab-1",
      "room": "L'Atelier",
      "abstract": "Si je vous dis **Dagger** ? Cela ne vous parle peut être pas. Si je vous dis... **Docker** ? Là, ça vous parle !\nDagger, c'est le moteur de CI/CD développé par *Solomon Hykes*, le papa de Docker. Un OVNI dans l'univers des moteurs de CI/CD, à la fois une alternative et un complément à Jenkins, Circle, GitHub Actions. Mais quid du ***Daggerverse*** ? \n\nLaissez nous vous embarquer dans ce nouvel univers, laissez nous vous faire tomber dans... le **Daggerverse of madness** !!\n\nDans ce codelab, vous :\n* prendrez en main Dagger avec le langage de votre choix : Typescript, Go ou Python (et qui sait, Java ?)\n* découvrirez comment publiez votre propre module Dagger dans... le Daggerverse !\n\nEt vous serez à tout jamais séduit par Dagger et son univers à part entière."
    },
    {
      "key": "et_si_on_implementait_une_machine_a_etats_pour_aider_la_petite_souris__",
      "openfeedbackId": "etsionimplementaitunemachineaetatspouraiderlapetitesouris",
      "title": "Et si on implémentait une Machine à Etats pour aider la petite souris ?",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "languages"
      ],
      "complexity": "Beginner",
      "speakers": [
        "laurine_le_net"
      ],
      "slot": "day-2-conference-2",
      "room": "Tour Bretagne",
      "abstract": "Vous êtes-vous déjà perdu dans le code d’un workflow complexe avec beaucoup de règles métier ? Entre les if-else un peu partout, les appels à des micro-services internes, les sollicitations de services externes, les callbacks, les sauvegardes en base, les retours au front, on peut facilement se retrouver avec un code spaghetti !\n\nLe pattern machine à états nous permet de créer un processus défini clairement à partir de multiples étapes. Ces étapes sont effectuées une à une en fonction de l’état dans lequel se trouve l'objet qui parcourt le process.\n\nRejoignez-moi pendant 45 min pour construire une Machine à Etat from scratch.\n\nLe use-case ? Aider la petite souris à gérer un workflow à s’en arracher les poils : collecte des dents, vérification des caries, commande et réception de pièces à la banque de France et l’expédition sous l’oreiller.\n\nAucun fromage, que du Java."
    },
    {
      "key": "evaluer_une_rag___j_ai_teste__je_vous_raconte__",
      "openfeedbackId": "evalueruneragjaitestejevousraconte",
      "title": "Évaluer une RAG : j'ai testé, je vous raconte !",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "hugo_vassard"
      ],
      "slot": "day-2-conference-3",
      "room": "Titan",
      "abstract": "Depuis le boum des LLMs (Large Language Model), les **chatbots** ont regagné en popularité et fleurissent de nouveau à foison. À cette occasion, les **RAGs** (Retrieval Augmented Generation) ont le vent en poupe et sont ainsi rapidement devenues les stars du moment.\n\nDans la réalisation de ce genre de projet, le développement démarre bien souvent sur les chapeaux de roues afin d’obtenir rapidement un premier chatbot fonctionnel. On laisse alors généralement de côté une dimension importante : **l'évaluation** de notre solution. Le manque d’évaluation ne tarde cependant pas à se faire ressentir, notamment lorsque l'on tente **d’améliorer notre chatbot** quand le fameux effet \"wahou\" s’est dissipé. \n\nNe faisant pas figure d'exception, j'ai moi aussi fait face à cette situation, et me suis trouvé contraint de lever mon nez du guidon pour me pencher sur cette problématique. Je suis alors parti à la découverte des différentes façons d'évaluer une application basée sur une RAG, et ça m’a pris un peu plus de temps que je ne l’imaginais…\n\n\nJe vous propose donc, à travers ce talk, de **vous transmettre ce que j’ai appris** de mes différentes recherches et essais sur le sujet. Au programme :\n- Construction d’un **jeu de test**\n- Évaluation des **performances** (à quel point mon chatbot fonctionne bien)\n- Évaluation des **risques** (est-ce que mon chatbot tient des propos déplacés, est-il robuste, …)\n- Les **librairies** d’évaluation, comme RAGAS et Giskard\n\n\n\n—\n\nAttention : Si le fonctionnement d’une RAG vous est inconnu, ce talk risque d’être un peu difficile à suivre. Je vous conseille donc de vous renseigner sur le sujet en amont. J’ai justement donné un talk qui explique tout cela, ça se passe [juste ici](https://www.youtube.com/watch?v=k6GYsuWSxiQ).\n"
    },
    {
      "key": "event_driven_et_serverless___le_combo_parfait_dans_gcp",
      "openfeedbackId": "eventdrivenetserverlesslecomboparfaitdansgcp",
      "title": "Event driven et Serverless : le combo parfait dans GCP",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "mazlum_tosun"
      ],
      "slot": "day-2-conference-2",
      "room": "Titan",
      "abstract": "Les architectures **Event Driven** présentent l'avantage de réduire fortement la latence lorsque nous traitons et intégrons des données dans notre système. Si nous utilisons, en plus, des composants **Serverless**, nous obtenons des coûts réduits.\n\nDans des contextes **On-Premises**, la mise en place peut être fastidieuse par rapport à l'infrastructure qu'elle nécessite.\n\nLa majorité des fournisseurs Cloud fournissent des services pour mettre en place cette architecture plus simplement. Mais comment s'y retrouver dans cette multitude d'offres ?\n\nDurant ce talk, nous vous montrerons comment **Google Cloud** facilite l'implémentation d'une architecture entièrement **Event Driven** et **Serverless**.\n\nAvec les données de la dernière coupe du monde de football, j'illustrerai la mise en place de ce type d'architecture pour calculer les stats de joueurs par équipe.\\\nOn verra que Kylian Mbappé s'est bien débrouillé !"
    },
    {
      "key": "faconnez_votre_cloud_avec_karpenter___les_secrets_du_maitre_charpentier_du_numerique",
      "openfeedbackId": "faconnezvotrecloudaveckarpenterlessecretsdumaitrecharpentierdunu",
      "title": "Façonnez Votre Cloud avec Karpenter : Les Secrets du Maître Charpentier du Numérique",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "olivier_leplus",
        "safae_dinia"
      ],
      "slot": "day-2-conference-1",
      "room": "Titan",
      "abstract": "Découvrez les secrets de Karpenter pour optimiser votre infrastructure cloud Kubernetes sur AWS. Explorez son approche innovante qui adapte automatiquement la taille des clusters en fonction de la demande, offrant des économies de coûts significatives et une meilleur efficacité opérationnelle. Rejoignez-nous pour une démonstration pratique et maîtrisez l'art de la gestion des ressources cloud."
    },
    {
      "key": "femmes_et_numeriques___reperer_les_mesures_incitatives_efficaces",
      "openfeedbackId": "femmesetnumeriquesrepererlesmesuresincitativesefficaces",
      "title": "Femmes et numériques : repérer les mesures incitatives efficaces",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "isabelle_collet"
      ],
      "slot": "day-2-conference-5",
      "room": "Titan",
      "abstract": "Depuis 20 ans, avec plus ou moins d'énergie, de motivation et de compétences, on appelle à plus de mixité dans la tech. Il est évident qu'on ne peut continuer à s'accommoder d'un monde numérique  utilisé par toutes et tous mais pensé, conçu, installé et maintenu par une population composée à 85% d'hommes .\nDe nombreuses mesures ont été mises en place, surtout depuis 10 ans, mais à l'arrivée, on constate bien peu de progrès. On dépense de l'argent, de l'énergie et à la fin, on se console en se disant : \"bah, c'est mieux que rien\".\nLe but de cette conférence est de sortir du \"mieux que rien\" qui amène à la résignation. \"On a fait tout ce qu'on pouvait\" entend-on également. Tout ? Vraiment ?\nAugmenter la part des femmes dans le numérique est possible, mais ce n'est pas uniquement une question de bonne volonté et surtout, ça demande à sortir des incantations routinières. Si \"Lutter contre les stéréotypes\" et \"Trouver des role models\" étaient suffisants, on le saurait déjà... \nEt si on faisait le tri entre le gender washing, les mesures isolées à l'efficacité limitée et les pratiques qui ont fait leurs preuves ?"
    },
    {
      "key": "fresque_de_la_data",
      "openfeedbackId": "fresquedeladata",
      "title": "Fresque de la Data",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Beginner",
      "speakers": [
        "laurene_thenoz",
        "sandra_pietrowska"
      ],
      "slot": "day-2-codelab-1",
      "room": "Hangar",
      "abstract": "La Fresque de la Data est un atelier collaboratif conçu dans le but de familiariser les participants avec les concepts fondamentaux de la Data ainsi que d’identifier et d’évaluer les risques liés à l'utilisation de la donnée.\n\nTirant son inspiration de la Fresque du Climat, c’est une approche ludique, qui favorise les échanges et encourage la collaboration entre les participants, offrant ainsi une opportunité de s’aligner et renforcer l’esprit d’équipe.\n\nCe format innovant part du constat que la principale cause de difficultés en Data est le manque de compréhension, d'alignement et de collaboration entre les différents interlocuteurs. Pourtant, les approches classiques d'acculturation à la Data ont trop rarement l'effet escompté.\n\nLa Fresque de la Data permet ainsi de développer une image mentale des principaux concepts de la Data et de l’IA, et favorise un apprentissage par l’échange et la collaboration."
    },
    {
      "key": "graphql_at_scale",
      "openfeedbackId": "graphqlatscale",
      "title": "GraphQL at Scale",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "languages"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "anthony_giniers"
      ],
      "slot": "day-1-conference-5",
      "room": "Belem",
      "abstract": "GraphQL est devenu un standard pour exposer des APIs, adopté par des géants tels que Github, Netflix, Shopify, Airbnb, Paypal ou évidemment Facebook.\n\nMais quand on est une boîte de cette ampleur, quels sont les challenges techniques et organisationnels, spécifiques à cette technologie, auxquels on va irrémédiablement se retrouver confrontés ?\n\nQuells sont les bonnes pratiques, qui n'étaient pas si évidentes il y a seulement quelques années, qui ont maintenant émergé pour permettre de scaler ? Quels sont les outils disponibles pour les implémenter ?"
    },
    {
      "key": "hands_on_gemini_with_java_and_langchain4j_on_vertex_ai",
      "openfeedbackId": "handsongeminiwithjavaandlangchain4jonvertexai",
      "title": "Hands-on Gemini with Java and LangChain4j on Vertex AI",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "guillaume_laforge",
        "valentin_deleplace"
      ],
      "slot": "day-2-codelab-2",
      "room": "Hangar",
      "abstract": "In this hands-on workshop, you'll learn to use Large Language Models (LLMs) directly from Java. You will first start by familiarizing yourself with Gemini, Google's new multi-model LLM. Then, you will use Gemini running on Google Cloud’s Vertex AI, in different use cases such as extracting data from unstructured text, document classification, searching in your own documents, and how to supplement the model by integrating calls to external APIs. The lab will use Java with LangChain4j. Come with your laptop."
    },
    {
      "key": "how_to_build_and_deploy_custom_assistants_to_work_for_you_using_ai_agents",
      "openfeedbackId": "howtobuildanddeploycustomassistantstoworkforyouusingaiagents",
      "title": "How to Build and Deploy Custom Assistants to Work for You Using AI Agents",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "viktoria_semaan",
        "tiffany_souterre"
      ],
      "slot": "day-1-conference-3",
      "room": "Jules Verne",
      "abstract": "In this session, you will learn how to build and deploy custom assistants using AI agents. These AI assistants, tailored to specific tasks and industries, from coding to solution architecting, are designed to automate various tasks. You will learn, step by step, how to create multimodal AI agents capable of querying documentation, generating code, creating and explaining diagrams, and more. The session includes demonstrations where our generative AI agent manages a variety of tasks, significantly reducing manual effort and the potential for errors."
    },
    {
      "key": "ia_404_explication_not_found",
      "openfeedbackId": "ia404explicationnotfound",
      "title": "IA-404 : Explication not found",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "cecile_hannote"
      ],
      "slot": "day-1-conference-2",
      "room": "Titan",
      "abstract": "Quand on demande à une IA :\"Dessine moi un chat\", elle fera potentiellement bien le job.\nSi maintenant on lui demande :\"Pourquoi l'animal que tu as dessiné est un chat ?\", on risque au contraire d'avoir une réponse tout droit sortie d'un dictionnaire plutôt que d'une justification sur l'image générée.\n\nPourquoi ?\n\nCette question, qui fait trembler les IA d'aujourd'hui, permet d'obtenir une explication à un résultat donné par une IA. Enfin en théorie.\n\nEn pratique, la course aux IA a amené des IA plus rapides, avec des réseaux de neurones plus complexes, des boîtes noires qui ne donnent aucune justification et qui donnent des résultats que même les experts en IA ne comprennent pas encore entièrement.\n\nMais alors, est-il possible d'expliquer l'IA ou est-elle déjà hors de notre contrôle ?"
    },
    {
      "key": "introduction_pratique_a_opentelemetry_pour_les_developpeurs",
      "openfeedbackId": "introductionpratiqueaopentelemetrypourlesdeveloppeurs",
      "title": "Introduction pratique à OpenTelemetry pour les développeurs",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "nicolas_frankel"
      ],
      "slot": "day-1-conference-4",
      "room": "Jules Verne",
      "abstract": "Il est essentiel de suivre le parcours d'une requête à travers les différents composants d'un système distribué. Avec l'essor des microservices, cette fonctionnalité a atteint un niveau de criticité comme jamais auparant. Certains outils propriétaires de suivi vous sont peut-être connus : Jaeger et Zipkin viennent naturellement à l'esprit.\n\nL'observabilité repose sur trois piliers : la journalisation, les métriques et le traçage. OpenTelemetry est un effort conjoint visant à mettre en place un standard ouvert pour ces trois piliers. Jaeger et Zipkin se sont joints à cet effort et sont maintenant compatibles avec OpenTelemetry.\n\nDans cet exposé, je décrirai plus en détail ce qui précède et je présenterai un cas d'utilisation (simple) pour démontrer comment vous pourriez bénéficier des traces OpenTelemetry dans votre architecture distribuée."
    },
    {
      "key": "j_ai_une_idee_pour_reduire_l_empreinte_environnementale_du_numerique_par_4",
      "openfeedbackId": "jaiuneideepourreduirelempreinteenvironnementaledunumeriquepar4",
      "title": "J'ai une idée pour réduire l'empreinte environnementale du numérique par 4",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "tristan_nitot"
      ],
      "slot": "day-2-conference-2",
      "room": "Jules Verne",
      "abstract": "### Supprimer la loi de Moore pour arrêter l'obsolescence programmée\n\nImaginons l'inimaginable : et si on arrêtait la loi de Moore ? Cette \"loi\" a structuré les industries du logiciel et du matériel informatique depuis presque 60 ans. Cette course effrénée vers la puissance fait que nous jetons collectivement chaque année plus de 50 millions de tonnes de déchets électroniques, qui ne sont quasiment pas recyclés. Dans 80% des cas, un smartphone est jeté alors qu'il fonctionne encore. Juste parce qu'il est considéré comme obsolète.  \n  \nMais la loi de Moore n'est pas une fatalité, elle s'essouffle même de plus en plus. \n\nIl faut savoir que c'est la fabrication du matériel qui compose les trois quarts de l'empreinte environnementale du numérique. Si on se mettait à optimiser nos logiciels plutôt que d'empiler les *features* pas toujours utiles, on pourrait faire tourner nos logiciels beaucoup beaucoup plus rapidement. Il y a en effet des gisements insoupçonnés de performance qui ont été négligés. J'ai trouvé [par exemple un script Python](https://www.youtube.com/watch?v=c33AZBnRHks) qui a pu être optimisé d'un facteur 408 000 000 (oui, 408 millions de fois). Les exemples sont légion, j'en ai plein. \n\nOn pourrait libérer toute cette puissance gâchée.\n\nC'est ce que j'appelle le **principe d'erooM**, pour *\"Effort Radicalement Organisé d’Optimisation en Masse\"* (oui, je suis désolé). \n\nEn optimisant le logiciel d'un facteur 2 tous les deux ans, on libère des ressources comme l'a fait la loi de Moore en son temps, et cela nous permettent d'innover, mais sans changer le matériel ! Et donc de s'attaquer à ce qui fait les trois quarts de l'empreinte environnementale du numérique ! Et avec les ressources numériques (temps de CPU, mémoire) économisées, nous pourrions continuer à innover, à inventer de nouveaux usages tout en réduisant  drastiquement la pollution numérique. \n\nÇa tombe bien, la planète en a bigrement besoin."
    },
    {
      "key": "opening_keynote",
      "openfeedbackId": "keynote",
      "title": "Keynote d'ouverture",
      "language": "French",
      "talkType": "conference",
      "speakers": [
        "anonymous"
      ],
      "tags": [
        "discovery"
      ],
      "slot": "day-1-keynote-open",
      "room": "Jules Verne"
    },
    {
      "key": "closing_keynote",
      "title": "Keynote de fermeture",
      "language": "French",
      "talkType": "conference",
      "speakers": [
        "anonymous"
      ],
      "tags": [
        "discovery"
      ],
      "slot": "day-2-keynote-close",
      "room": "Jules Verne"
    },
    {
      "key": "kueue___kubernetes_native_job_queueing",
      "openfeedbackId": "kueuekubernetesnativejobqueueing",
      "title": "Kueue : Kubernetes-native Job Queueing",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "laurent_grangeau"
      ],
      "slot": "day-1-conference-3",
      "room": "Tour Bretagne",
      "abstract": "Dans le paysage dynamique cloud-native d'aujourd'hui, une file d'attente et une gestion efficaces des workloads sont cruciales pour orchestrer des charges de travail complexes dans Kubernetes. L'exploitation de la puissance des GPU pour le Deep learning nécessite aussi une gestion efficace des files d'attente et des ressources dans Kubernetes. Sans file d'attente, il peut être compliqué d'orchestrer efficacement des workloads ou des entrainement de modèle de Machine Learning.\n\nKueue est un système de file d'attente  open-source et natif Kubernetes conçu pour relever ce défi. Kueue change la donne en permettant une orchestration transparente des tâches et une utilisation optimisée des ressources pour les entrainement nécessitant des GPU/TPU.\nKueue est un système de mise en file d'attente des travaux natif du cloud pour les applications batch, HPC, AI/ML et autres applications similaires dans un cluster Kubernetes.\n\nDans ce talk, nous montrerons les avantages de Kueue et lancerons l'entraînement simultané de plusieurs modèles de Machine Learning sur un cluster de GPU partagé. Kueue facilitera la mise en file d'attente et l'ordonnancement, garantissant que chaque tâche reçoit les ressources nécessaires tout en évitant les goulots d'étranglement."
    },
    {
      "key": "l_invasion_du_html_mutant__atelier_",
      "openfeedbackId": "linvasionduhtmlmutantatelier",
      "title": "L’invasion du HTML mutant",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "gael_poupard"
      ],
      "slot": "day-1-codelab-2",
      "room": "Hangar",
      "abstract": "Une vague de mutants envahit votre document HTML ! \n\nChoisissez-votre personnage, et utilisez l’éditeur de code intégré pour armer un `mutationObserver` : dès qu’il repérera des mutants, sa fonction de rappel les supprimera et vous permettra d’avancer dans l’aventure ! \n\nGare au boss final : impossible de le vaincre sans écrire sa propre fonction de rappel…"
    },
    {
      "key": "la_meteorite_gpt_annonce_t_elle_la_disparition_des_dinosaures__moteur_de_recherche___",
      "openfeedbackId": "lameteoritegptannoncetelleladisparitiondesdinosauresmoteurderech",
      "title": "La météorite GPT annonce t'elle la disparition des dinosaures \"moteur de recherche\" ?",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Beginner",
      "speakers": [
        "david_pilato"
      ],
      "slot": "day-2-conference-4",
      "room": "Jules Verne",
      "abstract": "L'arrivée des LLMs (Large Language Models) tels que ChatGPT ont fait couler beaucoup d'encre en annonçant l'extinction à venir des moteurs de recherche.\n\nAu cours de cette session, je vous démontrerai que c'est bien l'inverse qui se joue. La grosse conséquence de la \"révolution\" GPT est, selon moi, le retour en grâce de cette question fondamentale : \n\n> Comment  je peux rechercher dans mes données ?\n\nEt donc, le retour au devant de la scène des moteurs de recherche.\n\nJe vous expliquerai au cours de cette session, comment fonctionne la recherche lexicale (mot à mot), comment la recherche vectorielle permet d'implémenter la recherche sémantique ou encore la recherche de contenu binaire, comment nous pouvons combiner tout cela et enfin comment ces fonctionnalités permettent de construire un prompt de qualité avec vos vraies données métier à destination de votre LLM favori...\n\nNon. Le monde des moteurs de recherche n'est pas prêt de s'éteindre !\n"
    },
    {
      "key": "la_performance_web___le_cas_de_l_afrique",
      "openfeedbackId": "laperformanceweblecasdelafrique",
      "title": "La Performance Web : Le cas de l'Afrique",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "ayoub_alouane"
      ],
      "slot": "day-2-conference-5",
      "room": "Tour Bretagne",
      "abstract": "Nous partons souvent du principe que tout le monde dispose d'une bonne connexion Internet et d'un matériel informatique de haute spécification. Bien que cela puisse être vrai dans certaines régions, ce n'est pas le cas dans le monde entier. Je souhaite attirer l'attention sur l'Afrique, où de nombreux pays luttent contre de faibles connexions 3G coûteuses, en fonction de la quantité de données consommées. Ceci est dû à l'infrastructure limitée du continent, conduisant à une dépendance aux connexions mobiles.\n\nCompte tenu de ces circonstances, une utilisation efficace des données avec une bonne performance web devient une priorité. Ainsi, notre session se concentrera sur les défis rencontrés par les utilisateurs et les développeurs africains, et comment le téléchargement et l'exécution de grandes quantités de JavaScript exacerbe les problèmes de consommation de données et de performance. Nous explorerons comment les frameworks js existants ont tenté de résoudre le problème et comment Qwik, avec son approche innovante de la Resumability, présente une solution transformatrice à ces défis. Contrairement aux SPAs traditionnels, la Resumability de Qwik réduit considérablement la charge initiale de JavaScript, permettant aux applications de devenir interactives plus rapidement, même sur des connexions lentes."
    },
    {
      "key": "la_securite__par_ou_commencer___install_party___",
      "openfeedbackId": "lasecuriteparoucommencerinstallparty",
      "title": "La sécurité, par où commencer ? Install party 🎉",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "security"
      ],
      "complexity": "Beginner",
      "speakers": [
        "christopher",
        "david_aparicio"
      ],
      "slot": "day-1-codelab-3",
      "room": "L'Atelier",
      "abstract": "Venez avec votre PC/Linux/MAC, vous connaissez probablement les Linux [Install Parties](https://fr.wikipedia.org/wiki/Install_party) ? Alors, faisons de même avec la Sécurité, nous allons suivre l'approche [DevSecOps](https://davidaparicio.gitlab.io/website/files/devsecops_software_lifecycle.jpg) du [ministère américain de la défense](https://public.cyber.mil/devsecops/). Pour cela, rien de plus simple, venez avec votre ordinateur, votre projet opensource et vos outils (IDE, CI/CD). Après quelques slides de présentation, nous évolurons étape par étape dans la sécurisation de votre application. Si votre application est dockerisée, nous évonquerons les [bonnes pratiques de l'ANSSI](https://www.ssi.gouv.fr/guide/recommandations-de-securite-relatives-au-deploiement-de-conteneurs-docker/) sur ce sujet. Nous verrons ainsi, à travers cet atelier, comment le GitOps/CI/CD permettent à nous et aux organisations d'améliorer notre posture face à la sécurité.\n\nOn présentera les actions effectuées ce [code en Go](https://github.com/davidaparicio/namecheck) et si un participant n'a pas de projet phare, ni de code opensource, on pourra partir de ce projet (sans les workflows)\n\nPré-requis : connaissances élementaires sur l'OS, le code, les pipelines de CI/CD"
    },
    {
      "key": "le_petit_chaperon_rouge_pratique_enfin_le__zero_trust___en_mode_labs__",
      "openfeedbackId": "lepetitchaperonrougepratiqueenfinlezerotrustenmodelabs",
      "title": "Le petit chaperon rouge pratique enfin le \"Zero Trust\" (en mode labs) ",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "security"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "david_drugeon_hamon",
        "jean_pascal_thiery",
        "jerome_masson"
      ],
      "slot": "day-2-codelab-2",
      "room": "Les Machines",
      "abstract": "Pourquoi ne pas utiliser un conte de notre enfance pour apprendre de manière ludique. Révisitons le petit chaperon rouge: notre petite goldie rouge va voir sa mère-grand dans le village de captain Kube!!!\n\nEt si notre petite application se décidait enfin à pratiquer le **Zero Trust** quand elle va voir sa mère-grand et que le village de captain Kube était aussi sécurisé !!!\n\nNous aborderons les risques encourues et leur solution lors d'un déploiement d'une application Kubernetes ainsi que la mise en œuvre les outils minimaux de sécurité pour nous aider dans notre quotidien de Dev, DevOps ou SRE. \n\n\n\nLors de ce lab, nous mettrons en place:\n- Accès au cluster avec Boundary\n  - authentification\n  - droits & rôles\n- Déploiement de la sécurité dans le cluster\n  - Mise en place d'un service Mesh (surprise) \n- Déploiement de l'application\n  - vérification déploiement avec Kyverno\n  - vérification de l'image in-cluster avec Trivy-Operator \n  - Gestion des secrets avec Vault (injector) \n"
    },
    {
      "key": "les_aventuriers_de_la_motivation_perdue_",
      "openfeedbackId": "lesaventuriersdelamotivationperdue",
      "title": "Les aventuriers de la motivation perdue ",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "noemie_d_"
      ],
      "slot": "day-2-conference-4",
      "room": "Belem",
      "abstract": "Vous aussi ça vous arrive d’avoir la flemme de vous lever le matin pour aller au boulot ? Et pourtant le boulot n’est potentiellement pas si loin. Parfois même à quelques mètres de votre lit…\n\nDepuis près de 3000 ans, l’homme cherche la motivation. Ce trésor convoité de tous… Existe-t-il une carte à suivre ? Une arche pouvant conférer ce pouvoir à celui qui la trouvera ? \n\nJ’ai cherché, cherché et cherché encore, et figurez-vous que ce que j’ai découvert mériterait bien d’être partagé, plutôt que d’être exposé dans un musée. Je vais tout vous dire, tout.\n\nEmbarquez, avec moi, dans cette aventure pour entrevoir les secrets d’une motivation durable. Êtes-vous prêt à vous laisser guider ?"
    },
    {
      "key": "les_meta_lois__vous_ne_leur_echapperez_pas__",
      "openfeedbackId": "lesmetaloisvousneleurechapperezpas",
      "title": "Les Méta-Lois, vous ne leur échapperez pas !",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "stephane_trebel"
      ],
      "slot": "day-1-conference-5",
      "room": "Tour Bretagne",
      "abstract": "Elles sont tapies dans la toile de fond de nos entreprises, de nos sociétés, de notre façon de penser, même !\nOn a beau essayer de lutter contre, de les fuir ou de les contourner, elles finissent toujours par nous retomber dessus.\n\nCe sont… Les Méta-lois ! 😱\n\nPlan:\n- Ce qu'on appelle une Méta-loi: la plus connue est la loi de Conway, mais il y en a bien d'autres ! Qu'est-ce qui les caractérise ? Où est la limite à « penser en Meta-Loi » ?\n- Inventaire à la Prévert des différentes Méta-Lois (Le \"Chesterton Fence\" et le raisonnement de second ordre, La Loi de Hyrum qui rappelle que tout comportement d'une API finit par avoir un client qui en dépend, ou encore la Loi de Tesler qui explique qu'on ne fait jamais vraiment disparaître de la complexité, et bien d'autres !), et pour chacune une explication/illustration de pourquoi on n'y échappe pas, en général\n- Remédiation, Déni, Changement de paradigme: Comment s'en sortir et pourquoi ça ne sera pas simple.\n\nVous pensez que votre projet se passe bien ? Regardez bien sous votre IDE en vous couchant ce soir, fermez vos fenêtres et vos dossiers à double tour, car sinon les Méta-loi ne feront qu'une bouchée de vous ! 🎃\n\nUne conférence sous le signe de la bienveillance, de l'humilité, et de l'humour ;)"
    },
    {
      "key": "liberer_la_magie_avec_dapr___creer_les_solutions_portables_de_demain",
      "openfeedbackId": "libererlamagieavecdaprcreerlessolutionsportablesdedemain",
      "title": "Libérer la magie avec Dapr : Créer les solutions portables de demain",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "john_dennison",
        "tony_jarriault"
      ],
      "slot": "day-2-quickie-2",
      "room": "Belem",
      "abstract": "Alors que les entreprises adoptent de plus en plus une architecture de microservices indépendante du cloud pour ses avantages en termes d'évolutivité, de flexibilité et de maintenabilité, la nécessité de migrer vers des solutions basées sur le cloud devient impérative. Jusqu'à présent, de nombreuses migrations vers le cloud se sont concentrées sur des applications facilement refactorisables ou retravaillées pour des scénarios basés sur le cloud. Aujourd'hui, l'accent est mis sur les applications héritées qui sont plus compliquées ou nécessitent une refonte plus importante pour s'adapter à cette architecture.\nDans cette présentation, nous avons l'intention d'explorer l'utilisation de Dapr, une technologie de développement d'applications distribuées et portables, pour faciliter la transition vers une architecture basée sur des microservices distribués. \nEn adoptant Dapr en tant que sidecar, les applications peuvent devenir cloud-agnostiques, ce qui les rend plus portables et moins dépendantes d'un fournisseur spécifique.\n\nLa démonstration proposée se penchera sur le processus étape par étape consistant à tirer parti des fonctionnalités et des capacités de Dapr pour refactoriser et moderniser les applications, en mettant en évidence les aspects pratiques, les défis rencontrés et les solutions architecturales utilisées au cours du parcours de transformation. \nLa démonstration sera basée sur un projet de modernisation d'applications que nous avons entrepris pour un client. L'application d'origine a évolué au fil du temps avec une réflexion minimale sur les principes architecturaux, ce qui a entraîné une réduction de la qualité, une charge mentale accrue pour les développeurs et une augmentation des déploiements difficiles.\n\nVoici comment la démonstration pourrait se dérouler :\n<H2>1.\tContexte et introduction </H2>\na. Présentation des conférenciers  \nb. Présentation des architectures existantes & To Be  \nc. Objectifs et résultats clés\n<H2>2.\tRefactorisation vers une architecture basée sur des microservices :  </H2>\na. Analyse de l'architecture existante de l'application.   \nb. Identification des composants clés pour la décomposition en microservices.   \nc. Mappage de fonctionnalités à des microservices à l'aide de Dapr.\n<H2>3.\tBlocs de construction Dapr :  </H2>\n       a. Explorer les éléments constitutifs de Dapr tels que la gestion de l'état, pub/sub et l'appel de service et comment ceux-ci peuvent être intégrés de manière transparente dans une application existante avec peu ou pas de modifications.  \nb. Intégration de composants Dapr pour améliorer la communication entre les microservices.   \nc. Relever les défis rencontrés lors du processus de refactorisation.   \nd. Stratégies de gestion de la cohérence des données, de la gestion des transactions et des préoccupations transversales.   \ne. Présentation d'une étude de cas réelle d'une application modernisée avec succès à l'aide de Dapr.\n<H2>4.\tIndustrialisation de Dapr :  </H2>\na. Considérations relatives au déploiement des microservices orchestrés par Dapr.  \nb. Démonstration de la façon dont Dapr prend en charge l'évolutivité et la résilience.  \nc. Mettez en évidence les améliorations mesurables en termes de performances, de maintenabilité et d'évolutivité.     \nd. Vue d'ensemble des outils et frameworks compatibles avec Dapr pour la surveillance et le débogage.  \ne. Utilisation des fonctionnalités d'observabilité de Dapr pour assurer une gestion efficace des microservices.\n<H2>5.\tConclusion </H2>\na. Principaux résultats pour nos clients  \nb. Principales leçons apprises.\n\nLa démonstration vise à fournir un déroulé des actions pour rendre portable les applications entre cloud privée et/ou publique. En adoptant Dapr en tant que technologie sidecar, les entreprises peuvent non seulement migrer vers une architecture basée sur des microservices distribués, mais également rendre leurs applications cloud-agnostiques, améliorant ainsi leur portabilité et leur flexibilité.\n\n"
    },
    {
      "key": "mettre_le_monde_en_vecteur_",
      "openfeedbackId": "mettrelemondeenvecteur",
      "title": "Mettre le monde en vecteur ",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "florent_legras"
      ],
      "slot": "day-1-quickie-2",
      "room": "Jules Verne",
      "abstract": "Tel Néo vous vous sentez perdu dans la matrice ? \nNous sommes immergés dans un océan croissant de données. Même si l'idée de la matrice peut sembler illusoire (ou peut-être pas), la question cruciale est : comment pouvons-nous naviguer et organiser efficacement ce déluge d'informations qui nous entoure ? Comment pouvons-nous comparer des images ou rechercher des correspondances entre des textes ? Bien que les bases vectorielles soient aujourd'hui à la mode grâce à l'émergence des LLMs, il est important de noter que ces bases existent depuis un certain temps.\n\nPrenez la pilule rouge et plongez avec nous dans l'univers fascinant des bases vectorielles. Nous explorerons la théorie sous-jacente ainsi que différentes implémentations possibles, pour enfin illustrer nos propos avec plusieurs exemples d'utilisations concrets.\n"
    },
    {
      "key": "micro_frontend___liberer_le_potentiel_de_l_importmap",
      "openfeedbackId": "microfrontendlibererlepotentieldelimportmap",
      "title": "Micro Frontend - Libérer le potentiel de l'Importmap",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "jonathan_gelin"
      ],
      "slot": "day-1-conference-2",
      "room": "Belem",
      "abstract": "Explorez la fonctionnalité intégrée qui permet à votre navigateur Web de gérer les modules JavaScript ! Avec importmap, un outil JSON, vous pouvez charger des modules JS à la volée sans être lié à une configuration spécifique.\n\nDécouvrez comment les importmaps peuvent améliorer votre experience de développement local. Pas besoin de configurer un environnement complet : branchez simplement votre module sur une configuration existante et commencez à travailler en quelques secondes.\n\nÀ la fin de cette séance, vous vous demanderez peut-être pourquoi vous prenez des pauses-café chaque matin en attendant que votre environnement démarre !"
    },
    {
      "key": "mission_jetpack_compose___revolutionnez_le_developpement_mobile____",
      "openfeedbackId": "missionjetpackcomposerevolutionnezledeveloppementmobile",
      "title": "Mission Jetpack Compose : révolutionnez le développement mobile 🕵️",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "mobile"
      ],
      "complexity": "Beginner",
      "speakers": [
        "audrey_gentili",
        "olivier_perez"
      ],
      "slot": "day-1-codelab-1",
      "room": "L'Atelier",
      "abstract": "Félicitations, vous démarrez votre tout nouveau job en tant qu’espion·ne à la CIA, la Compose Intelligence Agency 🕵️\n\nVotre mission, si toutefois vous l’acceptez, consistera à intégrer notre équipe pour retrouver un dangereux fugitif 🥷\n\nDurant cette mission, votre objectif sera de créer une application “composée” de plusieurs écrans. Pour la mener à bien, vous aurez à disposition des gadgets fournis par Jetpack Compose, tels que les images, les animations et les previews 🧑‍💻\n\nVous aurez 2 heures, et pas une minute de plus, pour manier l’art de créer des applications mobiles ⏱️\nPas d'inquiétude, vous aurez à vos côtés nos deux meilleurs agents spécialisés dans le Renseignement Jetpack Compose. \n\nVenez apprendre la maîtrise de ces outils qui révolutionnent le développement Android, et bien plus.\n\nCe message s'autodétruira dans 5 secondes… 💣 Bonne chance."
    },
    {
      "key": "mongoDB_en_scaleup_comment_sortir_dun_enfer_monolithique",
      "openfeedbackId": "mongoDBenscaleupcommentsortirdunenfermonolithique",
      "title": "MongoDB en scale-up : comment sortir d’un enfer monolithique",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "laurentiu_capatina",
        "alexis_chotard"
      ],
      "slot": "day-2-conference-5",
      "room": "Belem",
      "abstract": "15 mars 2023, 6h59 : un cluster MongoDB s'écroule. Pas de bol, celui-ci contient 95% des données utilisateur, et est absolument vital à un fonctionnement même minimal de notre application. Facteur aggravant : celui-ci a 7 ans de retard de versions, n'est pas scalable, et à peine observable. Enfin, même le modèle de données ferait rapidement lever les sourcils : des applications qui communiquent entre elles via lecture/écriture dans les mêmes documents MongoDB, des documents qui atteignent la limitation maximum de 16MiB avec des centaines de niveaux d'imbrication, etc. L'incident durera plusieurs jours et résultera en la perte de nombreux utilisateurs. On a vu meilleur portrait.\n\nVoyons comment PayFit s'est retrouvé dans cette situation infernale, et surtout comment nous nous y sommes pris pour en sortir !\n\nAu programme : stabilisation technique, détricotage de modèle de données, éclatement d'un SPOF en plusieurs éléments au blast radius plus restreint, transition vers des services managés, amélioration des accès internes, reprise de maîtrise sur les opérations risquées, et finalement, approche d'une migration technique quand celle-ci impacte l'intégralité des équipes de développement."
    },
    {
      "key": "multi_kubernetes__multi_regions__au_secours__",
      "openfeedbackId": "multikubernetesmultiregionsausecours",
      "title": "Multi Kubernetes, Multi Régions, Au-secours !",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "aurelien_moreau",
        "nicolas_lavacry"
      ],
      "slot": "day-1-conference-2",
      "room": "Jules Verne",
      "abstract": "On s’intéressera ici à un cas d’architecture qui terrifie (à raison), n'importe quel SRE qui se respecte : celui d'une implémentation multi-datacentres, multi-régions, d’une infrastructure Kubernetes.\n\nCette question, c’est celle qui nous a occupé cette dernière année, à la Casden, et qui a été une source particulièrement riche d’apprentissages.\n\nQuelle architecture choisir pour les clusters multi-régions ? Comment les fédérer ?\n\nComment communiquer entre clusters ?\n\nComment gérer le load-balancing inter-cluster ?\n\nComment déployer sur nos clusters ?\n\nMais aussi et surtout : comment gérer mes données persistantes ?\n\nDans cette conférence, nous adresserons l’ensemble de ces questions en dressant un état des lieux des différentes possibilités d’implémentation, des contraintes, ainsi que des différents niveaux de maturité sur cette gestion d'une architecture Multi Kubernetes. Avec bien sûr de nombreuses démos à l'appui !"
    },
    {
      "key": "our_future_without_passwords",
      "openfeedbackId": "ourfuturewithoutpasswords",
      "title": "Our future without passwords",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "security"
      ],
      "complexity": "Beginner",
      "speakers": [
        "milica_mihajlija"
      ],
      "slot": "day-1-conference-3",
      "room": "Titan",
      "abstract": "Picture the future. What do you see? Flying cars? Vacations in space? How about…not having to use passwords anymore? Well, welcome to that future. The no passwords one, not flying cars.\n\nI’ll take you on a journey through our future where you can log in to a site or app by unlocking your phone and show you how to build your own authentication system using passkeys.\n\nPasskeys are a significantly safer replacement for passwords: they cannot be reused, don't leak in server breaches, and protect users from phishing attacks. They are built on open standards and work across most popular platforms and browsers such as Chrome, Android, Windows, Edge, MacOS, iOS and Safari.\n\nThe session will cover platform support in depth, UX, implementation and using passkeys as progressive enhancement on top of current password based systems. It's relevant to both web and mobile developers and anyone working on a project with any sort of login functionality."
    },
    {
      "key": "parlons_d_entretiens_techniques",
      "openfeedbackId": "parlonsdentretienstechniques",
      "title": "Parlons d'entretiens techniques",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "ane_diaz_de_tuesta"
      ],
      "slot": "day-1-quickie-1",
      "room": "Tour Bretagne",
      "abstract": "Les entretiens techniques sont devenus une étape cruciale dans le process de recrutement des ingénieurs logiciel.\nPratique popularisée par les géants de la tech et généralisée aujourd'hui dans la plupart des entreprises tech, elle permet d'évaluer: les compétences techniques, les capacités de résolution de problèmes et de testing et la communication des candidats.\n\nDepuis un peu plus de 2 ans je fais passer des entretiens techniques dans mon entreprise actuelle, Datadog, mais j'en ai fait passer dans mes précédentes entreprises aussi. Je voudrais partager mon expérience et apprentissages avec le public.\n\nCe talk aborde le sujet des entretiens techniques, comment on est évalués et comment s'y préparer en amont.\nDes exemples des problèmes d'algorithme montrés à la suite, des questions que l'on pourrait avoir dans notre prochain entretien, aideront à expliquer comment s'y prendre pour leur résolution. En plus, des conseils des choses à respecter et éviter seront présentés.\n\nPour compléter, je donnerai ma conclusion sur le sujet."
    },
    {
      "key": "pl_ntnet___defis_et_succes_de_l_internationalisation_dans_45_langues_d_une_application_de_sciences_citoyennes",
      "openfeedbackId": "plntnetdefisetsuccesdelinternationalisationdans45languesduneappl",
      "title": "Pl@ntNet : Défis et succès de l'internationalisation dans 45 langues d'une application de sciences citoyennes",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "hugo_gresse",
        "thomas_paillot"
      ],
      "slot": "day-1-quickie-1",
      "room": "Jules Verne",
      "abstract": "Dans un monde où la biodiversité est menacée, PlantNet émerge des ténèbres tel un phare guidant les amoureux de la nature. Cette application, fruit d'une alliance entre la technologie et les sciences citoyennes, a bravé les défis de l'internationalisation pour être disponible dans plus de 45 langues.\n\nPlongez avec nous dans les méandres obscurs de l'internationalisation de PlantNet. Nous vous dévoilerons les secrets techniques qui ont permis de mettre à jour les clients, l'API et les bases de données, tout en domptant l'affichage des langues avec les dernières technologies.\n\nMais l'internationalisation n'est pas qu'une affaire de code. Nous explorerons la face cachée de ce processus, où la contribution des utilisateurs aux traductions devient un acte de résistance, et où PlantNet devient un symbole d'espoir pour les communautés locales. Laissez-vous envoûter par les histoires de ces passionnés qui ont donné une voix à PlantNet dans leur région.\n\nNous vous entraînerons également dans les méandres de la gestion des noms de plantes, qui se transforment selon les régions, et nous affronterons les défis des moyens de paiement pour les dons, tels des énigmes à résoudre dans chaque pays.\n\nEnfin, nous lèverons le voile sur nos pistes d'amélioration pour optimiser l'internationalisation, afin que PlantNet puisse continuer à tisser sa toile et à connecter les amoureux de la nature du monde entier.\n\nRejoignez-nous pour une expérience envoûtante au cœur de l'internationalisation de PlantNet, où la technologie, la science citoyenne et la passion pour la nature s'entremêlent pour créer une application qui repousse les limites de l'obscurité."
    },
    {
      "key": "platform_engineering_day_2__unifying_your_tools_with_backstage",
      "openfeedbackId": "platformengineeringday2unifyingyourtoolswithbackstage",
      "title": "Platform Engineering Day-2: Unifier vos outils avec Backstage",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "julien_hery"
      ],
      "slot": "day-2-conference-4",
      "room": "Titan",
      "abstract": "Lors du \"Day-2\" de votre parcours de Platform Engineering, le défi est de rassembler tous les outils et services dans un environnement centralisé et cohérent.\n\nVoici Backstage, la plateforme open-source développée par Spotify, conçue pour unifier vos outils d’ingénierie et offrir une expérience fluide aux développeurs, aux équipes DevOps, aux POs et aux autres parties prenantes.\n\nDans cette présentation, nous explorerons comment Backstage peut servir de colonne vertébrale à votre Internal Developer Platform, simplifiant les flux de travail, augmentant la productivité et favorisant la collaboration."
    },
    {
      "key": "plongeons_au_coeur_des_frameworks_frontend_modernes_pour_comprendre_leur_reactivite____",
      "openfeedbackId": "plongeonsaucoeurdesframeworksfrontendmodernespourcomprendreleurr",
      "title": "Plongeons au coeur des frameworks frontend modernes pour comprendre leur réactivité🔬⚛️",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "dedieu_sylvain"
      ],
      "slot": "day-2-conference-2",
      "room": "Belem",
      "abstract": "Le mot \"réactivité\" est omniprésent dès lors que l'on lise un article ou que l'on écoute un podcast sur un framework frontend.\n\nMais qu'est-ce que ce terme signifie ? Plus concrètement encore, comment cette réactivité est traduite en code au sein de nos frameworks préférés ?\n\nJe vous propose de pratiquer une opération à coeur ouvert de Vue, React, Svelte et Angular afin de comprendre leurs mécanismes internes de \"rafraîchissement\" du DOM. \n\nNous nous attarderons d'avantage sur ce dernier qui est en train de complètement changer sa logique réactive. \nLe but de ce focus est de vous présenter les challenges auxquels la core team fait actuellement face et surtout le futur proche d'Angular.\n\nAlors si vous voulez être réactif, suivez le guide ! ;-) "
    },
    {
      "key": "pull_request_professionnelle_comment_promouvoir_son_travail_en_interne",
      "openfeedbackId": "pullrequestprofessionnellecommentpromouvoirsontravaileninterne",
      "title": "Pull Request Professionnelle : Comment Promouvoir son travail en interne",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "vanessa_perillat"
      ],
      "slot": "day-1-conference-4",
      "room": "Tour Bretagne",
      "abstract": "Cette présentation met en lumière les stratégies clés pour augmenter votre visibilité interne et vous positionner comme un élément central de votre organisation, en insistant sur l'importance de la communication efficace, de la prise d'initiative et de la construction d'un réseau professionnel solide.\nDéveloppeurs et développeuses y découvriront des conseils pratiques pour transcender le syndrome de l'imposture, naviguer dans la hiérarchie d'entreprise avec assurance, et surtout, valoriser leurs contributions uniques.\n"
    },
    {
      "key": "quoi___vous_n_utilisez_pas_figma____",
      "openfeedbackId": "quoivousnutilisezpasfigma",
      "title": "Quoi ? Vous n’utilisez pas Figma ?!?",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "ux_ui"
      ],
      "complexity": "Beginner",
      "speakers": [
        "antoine_candy",
        "simon_mercier"
      ],
      "slot": "day-1-codelab-3",
      "room": "Les Machines",
      "abstract": "C’est le leader des outils de design collaboratif ! C’est sur ce logiciel que se rencontrent designers, développeurs, chef de projets, product owner, clients ... toutes les parties prenantes d’un projet tech !\n\nEn quoi Figma est fait pour vous ? On en parle et on pratique dans cet atelier ! ;)\n\nInterface graphique, maquettes, tests utilisateurs, démo client et même prototypes animés ??! C’est possible avec ce logiciel !\n\nOn découvre ensemble et de manière ludique Figma, son interface, ses concepts.\n\n/!\\ Un ordinateur est nécessaire pour participer à cet atelier ! Nous vous conseillons également d’apporter une souris ;)"
    },
    {
      "key": "rag_against_the_machine_______creez_votre_propre_bot_iagen_sans_internet",
      "openfeedbackId": "ragagainstthemachinecreezvotreproprebotiagensansinternet",
      "title": "RAG against the Machine 😎🤖: créez votre propre bot IAGen sans Internet",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "benjamin_bernard",
        "julien_buret",
        "pierre_therrode"
      ],
      "slot": "day-1-codelab-1",
      "room": "Les Machines",
      "abstract": "2030. L'Humanité lutte pour la survie de ses développeurs. Impossible de sortir un site ou une app sans IA Générative. Les mega-corporations fournissent des services d'IA ultra-performants en SaaS à travers le cyberespace Internet. Seule une poignée résiste et construit encore ses propres chatbots, fait du RAG avec ses propres données, sur ses propres machines.\n\nDans ce codelab, vous utiliserez des frameworks open source comme LangChain et Tock pour créer votre chatbot en local et \"from scratch\" :\n- Vous construirez un RAG pour dialoguer sur vos propres bases de données.\n- Vous affinerez une expérience conversationnelle hybride, avec de l'IA Générative mais aussi des réponses déterministes quand c'est plus pertinent.\n- Vous intègrerez votre création sur une page Web ou votre propre site.\n- Vous apprendrez à observer et vérifier sa stabilité au fur et à mesure de ses évolutions.\n- Enfin, vous installerez des coupe-circuits et autres protections pour garder le contrôle et vous préparer à tous les scenarios une fois en production !\n\nUn autre avenir est possible. Développeurs, data scientists, rejoignez-nous !\n\n(Vous pourrez installer les logiciels en amont du lab. Instructions à venir : https://doc.tock.ai/codelab.html )"
    },
    {
      "key": "react_compiler___easier__better__faster__stronger___",
      "openfeedbackId": "reactcompilereasierbetterfasterstronger",
      "title": "React Compiler : Easier, Better, Faster, Stronger 🤖",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "lucas_audart",
        "mickael_alves"
      ],
      "slot": "day-1-conference-5",
      "room": "Titan",
      "abstract": "Imaginez une nouvelle version de React encore plus attendue qu’un album des Daft Punk 💽 Avec les nouveaux hooks, les actions, les React Server Components et bien plus, la version 19 de React s’annonce révolutionnaire ! 🤯 Et c’est sans compter le hit de la version : **Le React Compiler** !\n\nAu travers d’exemples concrets et de démonstrations, parcourons ensemble cette feature inédite pour en comprendre le besoin initial et son fonctionnement ⚙️ En quelques notes de code, découvrons comment React vous promet désormais performance et optimisation en toute facilité !\n\nLe React Compiler, véritable chef-d'œuvre de cette mise à jour, s'annonce comme un remix parfait pour vos applications passées et futures ! Venez vibrer avec nous et laissez-vous emporter par le rythme du React Compiler ! 🚀"
    },
    {
      "key": "redecouvrir_la_cooperation___atelier_de_mob_programming",
      "openfeedbackId": "redecouvrirlacooperationatelierdemobprogramming",
      "title": "Redécouvrir la coopération : Atelier de Mob Programming",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "manon_carbonnel",
        "marjorie_aubert"
      ],
      "slot": "day-1-codelab-2",
      "room": "Les Machines",
      "abstract": "Vous est-il déjà arrivé de rester bloqué·e, dans le doute devant un problème complexe, surtout lorsqu'un·e de vos collègues est absent·e ? De constater que votre équipe gère trop de tickets en parallèle et prend trop de temps pour délivrer de la valeur ? De vous impatienter pendant que votre code est relu et validé ?\n\nImaginez une équipe de développement où l'onboarding se fait à une vitesse fulgurante, et où la sécurité psychologique est le socle permettant à chaque membre d'apporter de la valeur et des idées, d'apprendre des autres et d'être écouté·e. Une équipe éliminant les silos d'information et améliorant la qualité du code produit. Ce n'est pas une utopie, c'est le mob programming !\n\nVous vous demandez comment une équipe entière peut coder ensemble sur un seul ordinateur ? Le mob peut être redoutablement efficace, joyeux et épanouissant, avec les bonnes pratiques. Et le mieux est de venir l’expérimenter par vous-même.\n\nRejoignez-nous pour un atelier immersif autour d'un exercice (kata) de code simple, où vous découvrirez comment cette approche coopérative peut transformer votre manière de travailler. L'objectif principal de cet atelier n'est pas le code en lui-même, mais de vous faire vivre l'importance de la coopération et de la communication.\n\nQue vous soyez dev ou non, débutant·e ou confirmé·e, PC ou non, vous êtes toustes les bienvenu·e·s, même pour observer."
    },
    {
      "key": "renovate_dependabot__ou_comment_reprendre_le_controle_sur_la_mise_a_jour_de_ses_dependances",
      "openfeedbackId": "renovatedependabotoucommentreprendrelecontrolesurlamiseajourdese",
      "title": "Renovate/Dependabot, ou comment reprendre le contrôle sur la mise à jour de ses dépendances",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "languages"
      ],
      "complexity": "Beginner",
      "speakers": [
        "jean_phi_baconnais",
        "lise_quesnel"
      ],
      "slot": "day-1-conference-1",
      "room": "Tour Bretagne",
      "abstract": "Lorsqu’on développe un projet, on se laisse parfois facilement déborder par les mises à jour de dépendances : c’est rébarbatif, répétitif, bref, pas très fun, et personne n’a envie de le faire. Et si une **solution automatique** le faisait pour nous ou nous aidait à le faire ? \n\nC’est la promesse d’outils comme Dependabot ou Renovate qui vont nous proposer des Pull/Merge-requests avec les montées de versions des dépendances de nos projets. Magique non ? \n\nDans ce talk, après vous avoir (re)présenter ces deux outils, nous vous donnerons des conseils sur la mise en place de Renovate. Notre retour est basé sur nos expériences open source ou lors de notre mission (spoiler, bien sur que tout n’a pas fonctionné du premier coup 😅). Ce sera l’occasion de vous faire une démo pour vous permettre de vous rendre compte de l'intérêt (mais pas que) de ces outils et pourquoi pas de vous décider à en installer un sur vos projets !"
    },
    {
      "key": "retourner_le_cerveau_de_sa_gameboy_et_les_attraper__vraiment__tous___",
      "openfeedbackId": "retournerlecerveaudesagameboyetlesattrapervraimenttous",
      "title": "Retourner le cerveau de sa Gameboy et les attraper (vraiment) tous 💪",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "iot_hardware"
      ],
      "complexity": "Beginner",
      "speakers": [
        "audren_burlot"
      ],
      "slot": "day-2-conference-4",
      "room": "Tour Bretagne",
      "abstract": "Vous avez 10 ans. Vous êtes assis sous un arbre dans votre jardin, et vous jouez à la Gameboy. La vie est douce.\nSoudain, votre meilleur ami débarque de nulle part, sa cartouche de Pokémon Bleu dans la main, et vous crie quelque chose !\nIl le jure sur la tête de son chien : il a réussi à attraper Mew.\nSelon vous, il y a deux explications possibles : votre ami s'est acheté un Action Replay et a triché comme un malpropre, ou il vous joue du pipeau.\nEt si je vous disais qu'il existait une 3ème explication : votre ami est un génie de l'assembleur.\nC'est ce que je vous propose de découvrir dans ce talk qui sent bon les années 90 et le reverse engineering."
    },
    {
      "key": "server_side_wasm__le_prochain_game_changer__",
      "openfeedbackId": "serversidewasmleprochaingamechanger",
      "title": "Server side WASM, le prochain game changer ?",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "languages"
      ],
      "complexity": "Advanced",
      "speakers": [
        "etienne_anne",
        "mathieu_ancelin"
      ],
      "slot": "day-2-conference-1",
      "room": "Jules Verne",
      "abstract": "\nWebAssembly (WASM) s'est rapidement imposé comme un outil révolutionnaire dans le monde du développement web, permettant l'exécution de code à haute performance directement dans le navigateur. Cependant, son potentiel s'étend bien au-delà du client, offrant de nouvelles possibilités passionnantes pour le développement côté serveur. Cette conférence plongera dans le monde émergent de WASM côté serveur, avec un accent particulier sur WebAssembly System interface (WASI). Nous explorerons comment WASI étend les capacités de WASM en permettant aux applications d'interagir de manière sécurisée avec le système d'exploitation, ouvrant la voie à une nouvelle ère d'applications serveur.\n\nNotre présentation débutera par une introduction à WASM et WASI, définissant leur place dans l'écosystème de développement actuel et expliquant pourquoi ils sont particulièrement pertinents pour les développeurs modernes. Nous discuterons ensuite des avantages spécifiques de l'utilisation de WASM côté serveur, notamment en termes de performance, de sécurité et de portabilité, soulignant comment ces caractéristiques peuvent transformer la façon dont nous développons et déployons des applications. La partie centrale de notre conférence se concentrera sur des études de cas concrets et des démonstrations pratiques. Nous montrerons comment l'intégration de WASM et WASI dans des environnements serveur peut résoudre des problèmes courants de manière innovante, améliorant à la fois l'efficacité et la robustesse des applications. Des exemples de code et des scénarios d'application seront utilisés pour illustrer ces concepts en action, offrant aux participants une compréhension profonde et pratique de la technologie. Enfin, nous discuterons des défis et des considérations pour l'adoption de WASM et WASI côté serveur, y compris les meilleures pratiques pour l'intégration dans vos projets existants. \n\nQue vous soyez un développeur expérimenté cherchant à tirer parti des dernières innovations technologiques ou simplement curieux de découvrir comment WASM et WASI peuvent révolutionner le développement côté serveur, cette conférence vous fournira les connaissances et les outils nécessaires pour commencer à intégrer ces technologies puissantes dans vos applications."
    },
    {
      "key": "survie_dans_les_tenebres_du_rendu_frontend__une_exploration_terrifiante______",
      "openfeedbackId": "surviedanslestenebresdurendufrontenduneexplorationterrifiante",
      "title": "Survie dans les ténèbres du rendu frontend: une exploration terrifiante 🫣 😱",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "alan_duchene",
        "jimmy_kasprzak"
      ],
      "slot": "day-1-quickie-2",
      "room": "Belem",
      "abstract": "Dans les sombres méandres du développement frontend, la survie dépend de la maîtrise des stratégies de rendu.\nChoisir la bonne approche peut non seulement influencer les performances et l'expérience utilisateur, mais aussi déterminer l'avenir de votre projet.\n\nDans cette terrifiante exploration des diverses stratégies de rendu (SSR, CSR, ISR, ...), nous dévoilerons les secrets les plus sombres de chaque approche, vous armant ainsi de votre arme la plus redoutable dans cette lutte épique contre l'obscurité technologique : la connaissance 🧠\n\nPréparez-vous à affronter l'horreur technologique et à prendre des décisions cruciales pour assurer la survie de vos projets frontend 🔪🩸"
    },
    {
      "key": "the_land_that_time_to_interactive_forgot",
      "openfeedbackId": "thelandthattimetointeractiveforgot",
      "title": "The land that Time To Interactive forgot",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "leonie_watson"
      ],
      "slot": "day-1-conference-1",
      "room": "Jules Verne",
      "abstract": "We tend to think of performance in terms of latency, code optimization, and things like the critical rendering path, but what happens when the browser creates an accessibility tree as well as the DOM?\n\nThe answer is of course \"it depends...\".\n\nDifferent browsers take different approaches, but they all have an impact on performance and the Time To Interactive in particular. In this talk we'll consider the purpose of the accessibility tree, the ways its constructed in diferent browsers, and the ultimate impact that has on both performance and experience for people who use assistive technologies like screen readers."
    },
    {
      "key": "tinygo__petit_mais_costaud_____",
      "openfeedbackId": "tinygopetitmaiscostaud",
      "title": "TinyGo, petit mais costaud ! 💪",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "iot_hardware"
      ],
      "complexity": "Beginner",
      "speakers": [
        "aurelie_vache",
        "thierry_chantier"
      ],
      "slot": "day-1-conference-2",
      "room": "Tour Bretagne",
      "abstract": "Go est un langage facile à prendre en main, typé et compilé. Avec ce langage vous pouvez créer des CLI (outils en ligne de commande), des microservices, des applications REST, gRPC, des Bots pour Discord…\nMais savez-vous que vous pouvez également créer des applications en Go pour des microcontrôleurs, des consoles de jeux vidéo et même générer du code en WebAssembly ?\n\nC’est possible grâce à TinyGo !\n\nTinyGo est un compilateur Go pour les systèmes embarqués et pour le Web moderne. Vous pouvez compiler et exécuter des programmes TinyGo sur de nombreuses cartes à microcontrôleur telles que le BBC micro:bit, l'Arduino Uno, la Nintendo Switch et la Game Boy Advance ;-).\n\nDans ce talk vous pourrez découvrir TinyGo ainsi que ses possibilités et usages concrets à travers des démos, en live, qui vous ferons découvrir plusieurs expérimentations de TinyGo.\n\nSpoiler alert : il se peut que des Nintendo Game Boy Advance et Gopher Badge soient utilisées durant ce talk 😜"
    },
    {
      "key": "tous_ensemble___atelier_de_l_inclusion",
      "openfeedbackId": "tousensembleatelierdelinclusion",
      "title": "Tous ensemble : Atelier de l'inclusion",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "ux_ui"
      ],
      "complexity": "Beginner",
      "speakers": [
        "luz_delgado",
        "stephanie_vachon"
      ],
      "slot": "day-1-codelab-1",
      "room": "Hangar",
      "abstract": "La conception des produits crée de l’exclusion dont les développeurs ou designers sont souvent peu conscients. En améliorant le caractère inclusif d’un produit, on peut à la fois améliorer la qualité et le confort d’usage pour tous, mais aussi trouver de nouvelles fonctionnalités.\n\nDans cet atelier, nous travaillerons sur des situations de vulnérabilité ou sociales qui peuvent amener des besoins particuliers dans les expériences de produits ou services (handicap, situations de précarité, neurodiversité, maladie psychique, orientation sexuelles…) avec des cas concrets pour plonger dans la façon dont ces différences peuvent impacter nos produits et services. Nous allons pouvoir imaginer des solutions inclusives en travaillant sur un parcours et un jeu de cartes qui pourrait être utilisé pour sensibiliser les équipes à ces situations parfois invisibles ou ignorées.\n"
    },
    {
      "key": "trucs_et_astuces_data_pour_devenir_le_prochain_sherlock_holmes__",
      "openfeedbackId": "trucsetastucesdatapourdevenirleprochainsherlockholmes",
      "title": "Trucs et astuces data pour devenir le prochain Sherlock Holmes !",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "antoine_bonneau",
        "guillaume_renaudin"
      ],
      "slot": "day-1-conference-1",
      "room": "Titan",
      "abstract": "Suite de notre panorama des usages de la data dans notre société : après le journalisme dont celui d’investigation, c’est assez naturellement que nous nous intéressons désormais aux enquêtes judiciaires. Découvrez comment, du crime dans le monde réel à la cybercriminalité, les enquêteurs sont augmentés par les technologies exploitant de la data. Après une présentation des outils de géolocalisation, simulation, profiling, IA, posons-nous la question des enjeux sociaux ! Car si leur utilisation dans le cadre de la lutte contre la criminalité paraît fournir, un réel bénéfice, leur mise en place se heurte bien évidemment aux droits et aux libertés des citoyens.\nEt nous vous montrerons que, que vous soyez Chinois, Américain ou Européen, les outils se ressemblent !"
    },
    {
      "key": "tu_te_mets_combien_en_responsive_css___edition_2024",
      "openfeedbackId": "tutemetscombienenresponsivecssedition2024",
      "title": "Tu te mets combien en responsive CSS ? Edition 2024",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "julien_sulpis",
        "theo_gianella"
      ],
      "slot": "day-2-conference-1",
      "room": "Belem",
      "abstract": "Le responsive en CSS, c’est la base non ? Depuis l’arrivée des smartphones, nos interfaces doivent s’adapter à toutes les tailles d’écrans possibles, du moniteur 4K au plus petit téléphone portable.\n\nVous faites ça comment, vous ? Au début on n’avait que les breakpoints et une armée de media queries. Puis de nouveaux outils sont arrivés : flexbox, grid, unités relatives… Aujourd’hui avec les container queries et toujours plus d’unités (dvmin, cqh…), nous disposons d’une jungle d’outils et de techniques et rares sont celleux qui peuvent prétendre tous les maîtriser. Alors, vous vous mettez combien en responsive CSS ?\n\nQue ce soit 1 ou 10, venez (re)découvrir avec nous les mille et une manières de faire du responsive en 2024 : on vous a préparé quelques maquettes, de la plus simple à la plus complexe, que nous allons implémenter en live-coding pour illustrer toutes ces techniques.\nOn verra ensemble que pour une fois, c’était pas mieux avant !"
    }
  ],
  "speakers": [
    {
      "key": "adam_argyle",
      "name": "Adam Argyle",
      "company": "Google",
      "city": "Seattle, WA",
      "photoUrl": "/images/speakers/adam_argyle.jpg",
      "socials": {
        "github": "argyleink",
        "twitter": "argyleink"
      }
    },
    {
      "key": "adrien",
      "name": "Adrien",
      "photoUrl": "/images/speakers/adrien.jpg",
      "socials": {}
    },
    {
      "key": "alan_duchene",
      "name": "Alan Duchene",
      "company": "Freelance",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/alan_duchene.jpg",
      "socials": {
        "github": "aland404"
      }
    },
    {
      "key": "alexis_chotard",
      "name": "Alexis \"Horgix\" Chotard",
      "company": "PayFit",
      "companyLogo": "/images/partners/payfit.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/alexis_chotard.jpg",
      "socials": {
        "twitter": "Horgix",
        "github": "Horgix"
      },
      "bio": "Alexis \"Horgix\" Chotard est un ingénieur système et développeur travaillant à PayFit (https://payfit.fr).\n\nDéveloppeur de formation avec une expérience davantage tournée système et infrastructure, se retrouvant naturellement dans tous les sujets \"DevOps\" au sens large.\n\nPassionné d'automatisation pour construire des systèmes autonomes, résilients et facilement maintenables. Engagé dans l'écosystème \"Cloud Native\", amoureux de Rust, partisan de l'opensource."
    },
    {
      "key": "alexis_lozano",
      "name": "Alexis Lozano",
      "company": "360Learning",
      "companyLogo": "/images/speakers/alexis_lozano.jpg",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/adam_argyle.jpg",
      "socials": {
        "twitter": "alexislozano__",
        "github": "alexislozano"
      }
    },
    {
      "key": "ambre_person",
      "name": "Ambre Person",
      "company": "Sopra Steria",
      "companyLogo": "/images/partners/sopra_steria.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/ambre_person.jpg",
      "socials": {},
      "bio": "Passionné d'ingénierie logicielle de bout en bout, du recrutement des équipes au déploiement en production en passant par le développement, l'architecture, l'intégration continue, la conception technique, l'infrastructure, le management, l'accompagnement RH... J'ai à cœur l'amélioration continue de nos pratiques à travers les principes du Craftsmanship, du DevOps et de l'Agilité, et le partage de connaissances pour monter collectivement en compétences."
    },
    {
      "key": "ane_diaz_de_tuesta",
      "name": "Ane Diaz De Tuesta",
      "company": "Datadog",
      "companyLogo": "/images/partners/datadog.png",
      "city": "Bordeaux, France",
      "photoUrl": "/images/speakers/ane_diaz_de_tuesta.png",
      "socials": {
        "twitter": "ane_naiz",
        "github": "anediaz"
      },
      "bio": "Ane est Software Engineer chez Datadog. Elle est aussi oratrice de conférences et facilitatrice graphique. \n\nDepuis + de 12 ans dans le monde du développement web, principalement du Frontend, elle est passionnée par son travail, où elle est en constant apprentissage.\n\nElle est très impliquée dans les conférences techniques,  que ce soit en tant que participante ou oratrice. \nEnthousiaste de la Facilitation Graphique et du Sketchnoting, qu'elle essaie de mettre en place dans son quotidien (professionnel et personnel), elle est une vraie convaincue des bénéfices que ces techniques apportent.\n\nAne est une personne ouverte, dynamique et qui aime bien les interactions sociales.\n"
    },
    {
      "key": "anonymous",
      "name": "Secret 🤫",
      "photoUrl": "/images/speakers/anonymous.png",
      "socials": {}
    },
    {
      "key": "anthony_giniers",
      "name": "Anthony Giniers",
      "company": "Swan (swan.io)",
      "companyLogo": "/images/partners/swan__swan_io_.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/anthony_giniers.jpg",
      "socials": {
        "twitter": "aginiers",
        "github": "github.com/antogyn"
      },
      "bio": "Anthony est un ingénieur curieux avec plus de 10 ans d'expérience dans les technologies web, à la fois Frontend, Backend ou Ops.\n\nStaff Engineer @ Swan"
    },
    {
      "key": "antoine_bonneau",
      "name": "Antoine Bonneau",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/antoine_bonneau.jpg",
      "socials": {
        "twitter": "callmegoodwater",
        "github": "callmegoodwater"
      },
      "bio": "Directeur de Zenika Nantes depuis 2015, Antoine est un ancien développeur web. \n\nIl s'intéresse de près à l'innovation et aux nouvelles tendances dans l’IT mais également aux usages de la data au sein de la société actuelle.\n\nLes nouvelles méthodes et organisations du travail et du management font également partie de ses centres d’intérêts."
    },
    {
      "key": "antoine_candy",
      "name": "Antoine CANDY",
      "company": "Worldline",
      "companyLogo": "/images/partners/worldline.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/antoine_candy.jpg",
      "socials": {},
      "bio": "Ingénieur informaticien 🤓 spécialisé dans le développement WEB (plus frontend que backend 😁). UX/UI designer 📱💻 et graphiste en herbe 🎨."
    },
    {
      "key": "audren_burlot",
      "name": "Audren Burlot",
      "company": "Max Digital Services",
      "companyLogo": "/images/partners/max_digital_services.png",
      "city": "Rennes, France",
      "photoUrl": "/images/speakers/audren_burlot.png",
      "socials": {
        "github": "github.com/Firnael"
      }
    },
    {
      "key": "audrey_gentili",
      "name": "Audrey Gentili",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/audrey_gentili.png",
      "socials": {
        "twitter": "audreygentili",
        "github": "audrey-gentili"
      },
      "bio": "Développeuse mobile Flutter et Android, fraichement arrivée dans le monde de la tech. Enthousiaste d'évoluer dans ce monde fascinant et de partager découvertes et expériences avec des personnes passionnées et passionnantes.\n"
    },
    {
      "key": "aurelie_vache",
      "name": "Aurélie Vache",
      "company": "OVHcloud",
      "companyLogo": "/images/partners/ovhcloud.png",
      "city": "Toulouse, France",
      "photoUrl": "/images/speakers/aurelie_vache.jpg",
      "socials": {
        "twitter": "aurelievache",
        "github": "scraly"
      },
      "bio": "Aurélie est Developer Advocate chez OVHcloud. Elle est Docker Captain, CNCF Ambassador, Google Cloud developer Expert, GitPod Hero & Women Techmakers Ambassador. Dans le milieu du Dev et de l'Ops depuis + de 18 ans, elle est une passionnée de Cloud et prône les bonnes pratiques DevOps/Cloud/Golang.\n\nOrganisatrice de conférences depuis 2016, elle est également rédactrice technique, sketchnoter, auteure de livres illustrés et speaker.\n\nElle adore faire du mentoring et aider les autres.\n\nElle a créé une nouvelle façon visuelle pour les gens d'apprendre et de comprendre les technologies Cloud : \"Understanding Kubernetes/Istio/Docker in a visual way\" dans des sketchnotes, livres et des vidéos illustrés."
    },
    {
      "key": "aurelien_moreau",
      "name": "Aurélien Moreau",
      "company": "Takima",
      "companyLogo": "/images/partners/takima.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/aurelien_moreau.jpg",
      "socials": {
        "twitter": "AurelOps",
        "github": "aurelien-moreau"
      },
      "bio": "Aurélien n’est pas juste un adepte de la marinière. Ops érudit, ayant fait ses armes dans les équipes infra chez EDF, il a vu passer 10 ans d’innovations et a vécu les changements de paradigmes engendrés par l’avènement des outils DevOps. Docker, Kubernetes, il est devenu Cloud Ops Architect et saura vous donner une lecture de ce que le DevOps a changé dans sa manière de fonctionner au quotidien. Spoiler alert : maintenant, il code !"
    },
    {
      "key": "ayoub_alouane",
      "name": "Ayoub Alouane",
      "company": "Adservio Group",
      "companyLogo": "/images/partners/adservio_group.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/ayoub_alouane.jpg",
      "socials": {
        "twitter": "alouane_med"
      },
      "bio": "I am Ayoub Alouane, 29 years old, working as a DevRel and TechLead in Adservio, Moroccan coming from Africa, starting a new journey in France, I had my first experience as a speaker in Devoxx France, I'm trying to build a consciousness about performance in our community of devs, I'm interested in Qwik Framework because I think that is the best Framework in term of performance using the concept of Resumability. I'm one of the leaders of the community of Qwik in the world and I'm trying to do what I can to convince people that performance matters.\n\nhttps://dev.to/ayoub_alouane"
    },
    {
      "key": "benjamin_bernard",
      "name": "Benjamin Bernard",
      "company": "Crédit Mutuel Arkéa",
      "companyLogo": "/images/partners/credit_mutuel_arkea.png",
      "city": "Brest, France",
      "photoUrl": "/images/speakers/benjamin_bernard.jpg",
      "socials": {
        "twitter": "benvii",
        "github": "benvii"
      }
    },
    {
      "key": "benjamin_legrand",
      "name": "Benjamin Legrand",
      "company": "Onepoint",
      "companyLogo": "/images/partners/onepoint.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/benjamin_legrand.png",
      "socials": {
        "twitter": "benjilegnard",
        "github": "benjilegnard"
      },
      "bio": "Tombé dans la marmite du web étant petit en regardant la source des pages html, c'est tout naturellement que Benjamin fit depuis 2008 du développement web son métier.\n\nD'abord full-stack, puis en fait full fronteux, parfois défricheur de frameworks javascript bizarres, amoureux du Typescript, fanboy d'Angular. touche à tout musicien.\n\nIntervenu sur plein de projets variés, de l'e-commerce à l'industrie, en passant par les telecoms.\n\nAujourd'hui Tech Lead front / Architecte Logiciel chez Onepoint"
    },
    {
      "key": "benoit_masson",
      "name": "Benoît Masson",
      "company": "OVHcloud",
      "companyLogo": "/images/partners/ovhcloud.png",
      "city": "Rennes, France",
      "photoUrl": "/images/speakers/benoit_masson.jpg",
      "socials": {
        "github": "benoitmasson"
      },
      "bio": "Tombé dans la potion quand j'étais petit, je m'intéresse depuis toujours à l'informatique : d'abord joueur, bidouilleur et développeur sur calculatrice, puis professionnellement en tant que chercheur et formateur, et finalement de retour au développement web full-stack depuis quelques années.\n\nPassionné par les langages modernes, de bas niveau (Go, Rust) ou fonctionnels (Caml, Elm) permettant par leur conception de limiter les risques d'erreur humaine, je m'implique dans les communautés locales pour partager mes expériences et améliorer mes pratiques.\n\nActuellement Team Leader dans l'équipe Noms de Domaines chez [OVHcloud](https://www.ovhcloud.com/fr/)."
    },
    {
      "key": "camille_pillot",
      "name": "Camille Pillot",
      "company": "Takima",
      "companyLogo": "/images/partners/takima.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/camille_pillot.jpg",
      "socials": {
        "twitter": "camiPillotDev"
      },
      "bio": "Rien ne présageait que Camille ferait du web. Plutôt destinée à une carrière dans les systèmes embarqués, c’est finalement le dev, qui l’a embarquée il y 3 ans.\nSur le chemin, elle découvre son talent de leadership et se dit qu’au final, elle pourrait aussi emmener du monde avec elle dans sa quête de connaissance et de veille !\nAdepte de meetups comme certains, fan de TypeScript comme beaucoup, elle connaît le framework Angular jusqu’au bout des ongles et prend parfois son clavier pour partager ce qui l’anime au quotidien !"
    },
    {
      "key": "cecile_hannote",
      "name": "Cécile Hannotte",
      "company": "Onepoint",
      "companyLogo": "/images/partners/onepoint.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/cecile_hannote.jpg",
      "socials": {
        "linkedin": "cecile-hannotte"
      },
      "bio": "Ingénieure en mathématiques et informatique, Cécile est une Data Scientist passionnée par les mathématiques, la data et l'IA. 📊🤖\n\n\nAvec quatre ans d’expérience chez Onepoint, elle a mené des projets variés alliant Machine Learning classique, Deep Learning (OCR, NER, NLP) et data engineering.\nActuellement en mission pour la maison de luxe française Jacquemus, Cécile explore chaque jour les limites et le potentiel de la data et de l’IA.\n\n\nConférencière engagée et Ambassadrice Women Techmaker, elle milite pour l'inclusion des femmes dans les métiers de l'IA et de la tech. 💪"
    },
    {
      "key": "christophe_porteneuve",
      "name": "Christophe Porteneuve",
      "company": "Doctolib",
      "companyLogo": "/images/partners/doctolib.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/christophe_porteneuve.png",
      "socials": {
        "twitter": "porteneuve",
        "github": "@tdd"
      },
      "bio": "Christophe est développeur web à titre pro depuis 1995, et fait de la R&D, de la formation pro et des talks en conférence depuis 1996. Ancien core team de Prototype.js et script.aculo.us, ancien contributeur à Ruby on Rails et à Node.js, traducteur FR des docs de React et contributeur occasionnel à JavaScript, il a fondé et dirigé Delicious Insights pendant 13 ans avant de prendre la tête du frontend chez Doctolib fin 2023.\n\nIl habite près de Paris avec sa femme et ses deux fils."
    },
    {
      "key": "christopher",
      "name": "Christopher Aparicio",
      "company": "42Crunch",
      "companyLogo": "/images/partners/42crunch.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/christopher.jpg",
      "socials": {
        "github": "ChristopherAparicio"
      },
      "bio": "Ingénieur en informatique passionné par la développement et le produit. \nActuellement en poste chez 42Crunch en tant qu'ingénieur responsable des produit d'Audit et de Scan tout en contribuant activement au développement de la plateforme.\nJ'investis une partie de mon temps personnel a me plonger dans l'apprentissage de nouvelles technologies et dans la réalisation de POCs.\nEn dehors des écrans, je passe mes journées à voyager en Van/Voilier, combinant ma passion pour le triathlon, la randonnée et la photographie pour explorer les plus belles regions de France. "
    },
    {
      "key": "david_aparicio",
      "name": "David Aparicio",
      "company": "OVHcloud",
      "companyLogo": "/images/partners/ovhcloud.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/david_aparicio.jpg",
      "socials": {
        "twitter": "dadideo",
        "github": "davidaparicio"
      },
      "bio": "Passionate engineer in Computer Science, graduated INSA Lyon 2014, after two years spent at UNICAMP in Brazil, actively participates in the community, through Meetups and conferences. His motto: “No developer is supposed to ignore security”.\n\nIngénieur passionné en Informatique, diplômé INSA Lyon 2014, après deux années passées à UNICAMP au Brésil, participe activement à la communauté, à travers des Meetups et des conférences. Sa devise: « Nul développeur n'est censé ignorer la sécurité »"
    },
    {
      "key": "david_drugeon_hamon",
      "name": "David Drugeon-Hamon",
      "company": "WeScale",
      "companyLogo": "/images/partners/wescale.png",
      "city": "Rennes, France",
      "photoUrl": "/images/speakers/david_drugeon_hamon.jpg",
      "socials": {
        "twitter": "zebeurton",
        "github": "ddrugeon"
      },
      "bio": "David Drugeon-Hamon est consultant pour la société WeScale en tant que Cloud Builder. Il apporte ainsi son expérience pour construire des infrastructures et applications dites Cloud Native.\n\nDéveloppement, Software Craftmanship, DevOps, Automatisation, Cloud Public sont des sujets qui l'intéressent particulièrement. Il joue aussi de l'accordéon diatonique et pratique l'escrime de spectacle à ses temps perdus."
    },
    {
      "key": "david_pilato",
      "name": "David Pilato",
      "company": "Elastic",
      "companyLogo": "/images/partners/elastic.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/david_pilato.jpg",
      "socials": {
        "twitter": "dadoonet",
        "github": "dadoonet"
      },
      "bio": "Depuis 2013, David Pilato est développeur et évangéliste chez elastic.co, après avoir passé les deux années précédentes à promouvoir le projet open-source Elasticsearch. Il en anime la communauté française et organise des [BBLs](https://david.pilato.fr/blog/2024-08-01-free-lunches-for-opensource-engineers/) au sein des entreprises."
    },
    {
      "key": "david_robin",
      "name": "David Robin",
      "company": "JFrog",
      "companyLogo": "/images/partners/jfrog.png",
      "city": "Toulouse, France",
      "photoUrl": "/images/speakers/david_robin.jpg",
      "socials": {
        "github": "muldos"
      }
    },
    {
      "key": "dedieu_sylvain",
      "name": "Dedieu Sylvain",
      "company": "Criteo",
      "companyLogo": "/images/partners/criteo.png",
      "city": "Claix, France",
      "photoUrl": "/images/speakers/dedieu_sylvain.jpg",
      "socials": {
        "twitter": "DedieuS",
        "github": "sdedieu"
      },
      "bio": "Hello 👋😊\n\nPassionné de développement et technologies front-end/mobile, je me suis spécialisé dans ce domaine.\n\nAu sein de l'équipe ui-foundation chez  [Criteo](https://www.criteo.com/fr/), j'ai la chance de pouvoir approfondir chaque jour un peu plus cette expertise.\n\nFormateur et conférencier, j'interviens à l'Université [UGA (Grenoble 1)](https://www.univ-grenoble-alpes.fr/)  pour dispenser des cours de développement Web & mobile cross-plateform. J'ai par ailleurs eu la chance de présenter des sujets lors de plusieurs grands événements Français et Européens.\n\nLa veille technique et les projets personnels occupent également une grande partie de mon temps.\n\nLe reste est principalement dédié au sport et à la nourriture 😁."
    },
    {
      "key": "emeric_martineau",
      "name": "Emeric Martineau",
      "company": "Crédit Agricole Technologies et Services",
      "companyLogo": "/images/partners/credit_agricole_technologies_et_services.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/emeric_martineau.jpg",
      "socials": {
        "twitter": "MartineauEmeric",
        "github": "emeric-martineau"
      },
      "bio": "D'abord développeur temps-réel puis exploitant, passé par hotlineur, technicien de maintenance informatique, administrateur systèmes et réseaux et enfin développeur.\n\nJe m'intéresse à énormément de sujets que j'inter-connecte mentalement pour en ressortir des idées et des concepts farfelus et improbable.\n\nJe travaille actuellement au Crédit Agricole Technologies et Services dans l'équipe accompagnant les developpeurs vers plus d'automatisation (CI/CD) et que qualité (Sonar).\n"
    },
    {
      "key": "eric_alard",
      "name": "Eric Alard",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/eric_alard.jpg",
      "socials": {},
      "bio": "Pendant 30 ans, j'ai dévalé les pistes de bobsleigh aux 4 coins du monde, participant 5 fois aux Jeux Olympiques. J'interviens aujourd'hui auprès d'un large public pour montrer les convergences entre le monde du sport et de l'entreprise. \nEt, je constate que, de plus en plus, les datas envahissent le monde du sport. Elles sont partout, sur le terrain et en dehors, avant, pendant et après les rencontres sportives.\nMais, avec cette révolution, n'y a-t-il pas un risque de déshumaniser le sport et donc de le rendre moins attrayant émotionnellement parlant ?\n"
    },
    {
      "key": "etienne_anne",
      "name": "Etienne Anne",
      "company": "MAIF",
      "companyLogo": "/images/partners/maif.png",
      "city": "Poitiers, France",
      "photoUrl": "/images/speakers/etienne_anne.jpg",
      "socials": {
        "twitter": "Zwiterrion_",
        "github": "Zwiterrion"
      },
      "bio": "Développeur \"Full-Stack\" travaillant depuis quelques années sur des APIs gateways et leurs intégrations dans l'écosystème d'un grand groupe de l'assurance. \nDepuis 2019, je contribue à  des produits Open Source à la MAIF, notamment sur [Otoroshi](https://maif.github.io/otoroshi/manual/getting-started.html), un API management WASM-native.\nEn side project, je maintiens une application de gestion de liste de souhaits nommé [Pleaf](https://pleaf.fr)."
    },
    {
      "key": "flavien_normand",
      "name": "Flavien Normand",
      "company": "Lucca",
      "companyLogo": "/images/partners/lucca.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/flavien_normand.jpg",
      "socials": {
        "twitter": "Supamiu_",
        "github": "Supamiu"
      },
      "bio": "Angular Lover, DnD GM and Open Source gaming tools creator"
    },
    {
      "key": "florent_le_borgne",
      "name": "Florent le borgne",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/florent_le_borgne.jpg",
      "socials": {}
    },
    {
      "key": "florent_legras",
      "name": "Florent Legras",
      "company": "SFEIR",
      "companyLogo": "/images/partners/sfeir.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/florent_legras.png",
      "socials": {
        "twitter": "florent_legras",
        "github": "flegras"
      },
      "bio": "CTO Data chez Sfeir. Je travail depuis 15 ans dans l'écosystème data de startup ou de grand comptes. \n\nDepuis 2015 j'explore les technologies Cloud de Google et j'aide des entreprise à les mettre en places.\n\nJe suis Google Authorized Trainer et certifié Google Cloud Data Engineer\n\nGoogle Developer Expert depuis 2022"
    },
    {
      "key": "florian_girard",
      "name": "Florian Girard",
      "company": "SIPA - Ouest-France",
      "companyLogo": "/images/partners/sipa___ouest_france.png",
      "city": "Rennes, France",
      "photoUrl": "/images/speakers/florian_girard.jpg",
      "socials": {},
      "bio": "Architecte Ouest-France passé par les domaines télécoms, bancaire, maritime, agricole."
    },
    {
      "key": "gael_poupard",
      "name": "Gaël Poupard",
      "company": "Onepoint",
      "companyLogo": "/images/partners/onepoint.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/gael_poupard.png",
      "socials": {
        "github": "ffoodd",
        "linkedin": "gaël-poupard-40117b30",
        "website": "https://ffoodd.fr"
      },
      "bio": "Lead tech front chez onepoint à Nantes, je bricole avec HTML et CSS depuis IE6. \n\nSpécialiste passé par les cases designer UX/UI en agence, développeur PHP, développeur front-end en start-up aux commandes d’un guide de styles — on ne parlait pas encore de design system ! —, chef de chantier sur une refonte technique front-end chez un éditeur dans un environnement Java, puis spécialiste front-end et CMS en ESN, je suis désormais référent accessibilité et expert HTML / CSS / SVG chez onepoint.\n\nJ’ai entre autres choses commis a11y.css et chaarts, fait partie de la core team Bootstrap et de l’organisation de Paris Web et contribue régulièrement à divers projets open-source.\n\nJe cultive désormais le bon HTML et du CSS, fait des audits RGAA et prône l’assurance qualité web avec Opquast.\n"
    },
    {
      "key": "gerome_grignon",
      "name": "Gérôme Grignon",
      "company": "Lucca",
      "companyLogo": "/images/partners/lucca.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/gerome_grignon.png",
      "socials": {
        "twitter": "GeromeGrignon",
        "github": "geromegrignon"
      },
      "bio": "Web Developer chez Lucca le jour, mainteneur open-source la nuit.\nCo-fondateur communauté Angular Devs France"
    },
    {
      "key": "guillaume_laforge",
      "name": "Guillaume Laforge",
      "company": "Google",
      "companyLogo": "/images/partners/google.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/guillaume_laforge.jpg",
      "socials": {
        "twitter": "glaforge",
        "github": "glaforge"
      },
      "bio": "During the day, **Guillaume Laforge** is **Developer Advocate** for **Google Cloud**, covering a wide range of topics from generative AI, machine learning APIs, serverless development, or service orchestration. At night, Guillaume wears his **Apache Groovy** hat, or you can hear him make jokes on the French podcast **Les Cast Codeurs** !"
    },
    {
      "key": "guillaume_le_floch",
      "name": "Guillaume Le Floch",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Niort, France",
      "photoUrl": "/images/speakers/guillaume_le_floch.jpg",
      "socials": {
        "twitter": "glfloch",
        "github": "glefloch"
      },
      "bio": "Guillaume est consultant formateur chez Zenika Nantes. Ayant une appétence pour tout ce qui tourne autour de la data, il intervient sur des projets mêlant des problèmes fonctionnels et techniques forts. Contributeur Quarkus depuis 1an, il participe principalement à l'intégration de Gradle dans Quarkus."
    },
    {
      "key": "guillaume_moirod",
      "name": "Guillaume Moirod",
      "company": "Independant",
      "companyLogo": "/images/partners/independant.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/guillaume_moirod.jpg",
      "socials": {
        "github": "gmoirod"
      },
      "bio": "Un voyage de 2 décennies dans le développement (essentiellement Java), puis dans le DevOps, puis dans le Cloud. \nJ’accompagne désormais les clients à mettre en place une démarche DevSecOps et GitOps dans leur delivery.\n\n- TechLead/Architecte DevOps\n- Contributeur d'une Internal Developer Platform\n- Formateur DevSecOps et Linux"
    },
    {
      "key": "guillaume_renaudin",
      "name": "Guillaume Renaudin",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/guillaume_renaudin.png",
      "socials": {
        "twitter": "rguillome",
        "github": "rguillome"
      },
      "bio": "Directeur technique de l'expertise Data et IA chez Zenika, ça fait 20 ans que j'arpente les SI des entreprises pour servir en tant que développeur, d'architecte et data ingénieur.\n\nJ'aime particulièrement voir grandir et mûrir des projets tant sur le plan technique que sur le plan humain !\n\nL'IA et la Data sont les domaines dans lesquels, je trouve actuellement, le plus de challenges et d'opportunités."
    },
    {
      "key": "gwenael_bec",
      "name": "Gwenaël Bec",
      "company": "Sopra Steria",
      "companyLogo": "/images/partners/sopra_steria.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/gwenael_bec.png",
      "socials": {},
      "bio": "Fullstack de naissance mais avec un attrait pour le front end et les problématiques des utilisateurs et du métier. \n\n👨‍💻 Référent Technique @Sopra Steria  \n🎓Formateur Interne VueJS (🤗), ~~AngularJS (☠️)~~  \n🌞 Front & Conference Enjoyer"
    },
    {
      "key": "hugo_gresse",
      "name": "Hugo Gresse",
      "company": "INRIA",
      "companyLogo": "/images/partners/inria.png",
      "city": "Montpellier, France",
      "photoUrl": "/images/speakers/hugo_gresse.jpg",
      "socials": {
        "twitter": "HugoGresse",
        "github": "@HugoGresse"
      },
      "bio": "Mobile developer for [Pl@ntNet app](https://play.google.com/store/apps/details?id=org.plantnet) at INRIA, Montpellier, France\n\nPreviously:\n- lead android developer at Teads\n\nAlso a web developer and open source contributor: \n- [openfeedback.io](https://openfeedback.io)\n- [openplanner.fr](https://github.com/HugoGresse/OpenPlanner)\n- more on [github](https://github.com/HugoGresse)\n\nPrésident SunnyTech (2024), orga de Montpellier JS / Montpellier Tech, et de Montpellier Android User Group \n\n\n\n"
    },
    {
      "key": "hugo_vassard",
      "name": "Hugo Vassard",
      "company": "Ippon Technologies",
      "companyLogo": "/images/partners/ippon_technologies.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/hugo_vassard.jpg",
      "socials": {},
      "bio": "ML Engineer / Data Engineer"
    },
    {
      "key": "ilona_marie_lemaire_lefebvre",
      "name": "Ilona-Marie Lemaire-Lefebvre",
      "photoUrl": "/images/speakers/ilona_marie_lemaire_lefebvre.jpg",
      "socials": {}
    },
    {
      "key": "isabelle_collet",
      "name": "Isabelle Collet",
      "photoUrl": "/images/speakers/isabelle_collet.jpg",
      "socials": {}
    },
    {
      "key": "jean_pascal_thiery",
      "name": "Jean-Pascal Thiery",
      "company": "WeScale",
      "companyLogo": "/images/partners/wescale.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/jean_pascal_thiery.jpg",
      "socials": {
        "twitter": "jpthiery",
        "github": "@jpthiery"
      }
    },
    {
      "key": "jean_phi_baconnais",
      "name": "Jean-Phi Baconnais",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/jean_phi_baconnais.jpg",
      "socials": {
        "twitter": "JPhi_Baconnais",
        "github": "jeanphi-baconnais"
      },
      "bio": "**Consultant @Zenika Nantes**\n\nPlongé dans le développement avec l'éco-système Java, curieux de nature, j'aime découvrir et expérimenter de nouvelles technos back end ou front end et les partager autour de moi.\n\nGitLab Heroes 🦊 - Community Hero Gitpod 🍑 - Co orga des Human Talks Nantes\n"
    },
    {
      "key": "jerome_masson",
      "name": "Jérôme Masson",
      "company": "WeScale",
      "companyLogo": "/images/partners/wescale.png",
      "city": "Aix-en-Provence, France",
      "photoUrl": "/images/speakers/jerome_masson.jpg",
      "socials": {
        "twitter": "sphinxgaiaone",
        "github": "Sphinxgaia"
      },
      "bio": "Je me définis comme un **Kubernetes addict & evangelist**. Le **landscape CNCF** est un terrain de jeux qui est le parfait endroit pour un passionné comme moi. \nMa carrière de consultant & d'architecte m'a amené à côtoyer des environnements complexes tant sur le `plan humain` que sur le `plan technique`."
    },
    {
      "key": "jimmy_kasprzak",
      "name": "Jimmy Kasprzak",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/jimmy_kasprzak.jpg",
      "socials": {
        "twitter": "JimmyKasprzak",
        "github": "Orodan"
      },
      "bio": "Directeur technique et formateur à Zenika, je me passionne pour le monde du développement web depuis déjà quelques années. J'adore me confronter à de nouvelles problématiques, découvrir, apprendre et partager autour de moi avec des gens qui partage la même passion. Adepte de Javascript, Typescript, CSS et de tout ce qui fait le web d'aujourd'hui, n'hésitez pas à me retrouver sur les différents réseaux sociaux pour échanger. Quand je ne suis pas en train de parler web, vous me trouverez sûrement en train d'élever de me balader dans la faille de l'invocateur où de \"piloter\" sur Mariokart :)"
    },
    {
      "key": "john_dennison",
      "name": "John Dennison",
      "company": "Sogeti",
      "companyLogo": "/images/partners/sogeti.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/john_dennison.jpg",
      "socials": {},
      "bio": "John Dennison is a senior Cloud and DevOps architect at Sogeti , part of Capgemini. He has worked for over 20 years in the IT Industry and has a range of experience from IoT & data to being an application architect and DevOps expert. He is passionate about automation and improving developer experiences by allowing them to focus on producing value for their customers. He has followed the Dapr project for many years and is involved in implementing solutions based on Dapr for our customers."
    },
    {
      "key": "jonathan_gelin",
      "name": "Jonathan Gelin",
      "company": "GT-ICONSULTING (Freelance)",
      "companyLogo": "/images/partners/gt_iconsulting__freelance_.png",
      "city": "Genappe, Belgium",
      "photoUrl": "/images/speakers/jonathan_gelin.png",
      "socials": {
        "twitter": "jonathan_gelin",
        "github": "jogelin"
      },
      "bio": "Who am I? Whether it's as a Software Engineer, Tech Lead, or Architect, if it involves software development, I'm in!\n\nMy journey began in the realm of Java development, but I fully transitioned into the universe of JavaScript/TypeScript and its exciting toolset.\n\nI support companies through their software development cycle challenges by utilizing Nx monorepos, micro frontends, robust testing strategies, and a touch of Extreme Programming philosophy.\n\nEvery day for me is like waiting for the next episode of my favorite series—filled with learning, sharing, and growing together. Indeed, I'm as passionate about coaching and sharing knowledge as I am about coding.\n\nI am the father of two incredible boys, and I am endlessly grateful to my wife for supporting my passion every day."
    },
    {
      "key": "julien_buret",
      "name": "Julien Buret",
      "company": "SNCF Connect & Tech",
      "companyLogo": "/images/partners/sncf_connect___tech.png",
      "photoUrl": "/images/speakers/julien_buret.jpg",
      "socials": {},
      "bio": "Julien participe à plein temps depuis presque trente ans au développement d'un grand nombre d'applicatifs, avec une forte appétence pour l'open-source. Il maintient notamment les projets [tock](https://doc.tock.ai/) et  [kmongo](https://litote.org/kmongo/).\n\nIl est actuellement Principal Engineer chez SNCF Connect & Tech."
    },
    {
      "key": "julien_haumont",
      "name": "Julien Haumont",
      "company": "BlaBlaCar",
      "companyLogo": "/images/partners/blablacar.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/julien_haumont.jpg",
      "socials": {
        "twitter": "j_haumont",
        "github": "jhaumont"
      }
    },
    {
      "key": "julien_hery",
      "name": "Julien Hery",
      "company": "SFEIR",
      "companyLogo": "/images/partners/sfeir.png",
      "city": "Lille, France",
      "photoUrl": "/images/speakers/julien_hery.jpg",
      "socials": {
        "twitter": "HeryDev",
        "github": "Julien-Hery"
      },
      "bio": "Hi everyone, I'm Julien — a Fullstack JS Developer at SFEIR. I'm curious about new technologies and tools to make developers' life easier, always eager to learn. Currently exploring the world of Flutter to discover cross-platform development. \nBeyond coding, you'll catch me playing RPG & Roguelike games, trying to learn how to play various music instruments, hiking and camping in the wild."
    },
    {
      "key": "julien_sulpis",
      "name": "Julien Sulpis",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/julien_sulpis.jpg",
      "socials": {
        "twitter": "jsulpis",
        "github": "jsulpis"
      },
      "bio": "Développeur front-end passionné, j'aime explorer les outils du web moderne pour créer des applications sans compromis entre performance, accessibilité, et design qui sort du lot. CSS, WebGL et librairies JS minimalistes sont mes outils de prédilection."
    },
    {
      "key": "kevin_dunglas",
      "name": "Kévin Dunglas",
      "company": "Les-Tilleuls.coop",
      "companyLogo": "/images/partners/les_tilleuls_coop.png",
      "city": "Lille, France",
      "photoUrl": "/images/speakers/kevin_dunglas.jpg",
      "socials": {
        "twitter": "dunglas",
        "github": "dunglas"
      },
      "bio": "Kévin est le créateur du framework [API Platform](https://api-platform.com) (un outil populaire pour développer des projets API-first) ainsi que de [Mercure](https://mercure.rocks) (une solution de publication en temps réel), de [Vulcain](https://vulcain.rocks) (un style d'API dirigées par les clients) et de [FrankenPHP](https://frankenphp.dev) (un serveur d'application performant et moderne pour PHP).\n\nIl est également co-mainteur du serveur web [Caddy](https://caddyserver.com) et membre de la Core Team du framework [Symfony](https://symfony.com) (l'un des frameworks web parmi les plus utilisés au monde), contributeur aux langages de programmation Go et PHP et il a cofondé la société société coopérative [Les-Tilleuls.coop](https://les-tilleuls.coop) (entreprise entièrement possédée par ses salarié·es et où les décisions sont prises sur le principe 1 personne = 1 voix)."
    },
    {
      "key": "laurene_thenoz",
      "name": "Laurène Thenoz",
      "company": "Hymaia",
      "companyLogo": "/images/partners/hymaia.png",
      "city": "Chartres, France",
      "photoUrl": "/images/speakers/laurene_thenoz.jpg",
      "socials": {},
      "bio": "I span through most organisational layers from manager to team member to CoDir member, from tech to product to organisation, from consulting to executing to training, and that makes me better at seeing things from a systemic point of view than being the expert on a specific domain.\n\nI use this strength to connect things, contextualise them, find strange metaphors, and share new and simpler ways to navigate the world we work in on a daily basis.\n\nThese days I work as a data product manager for my clients and a manager, trainer and head of product within Hymaia."
    },
    {
      "key": "laurent_grangeau",
      "name": "Laurent Grangeau",
      "company": "Google",
      "companyLogo": "/images/partners/google.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/laurent_grangeau.jpg",
      "socials": {
        "twitter": "laurentgrangeau",
        "github": "laurentgrangeau"
      },
      "bio": "Laurent Grangeau is a Cloud Solution Architect with more than 10+ years of experience. Former Java developer, he has since developed in .NET, with Agile and DevOps mindsets. He has been experimenting with cloud providers for more than 5+ years. Docker enthusiast from the beginning, he has experienced with building microservices and distributed systems. He loves to automate things and run distributed applications at scale."
    },
    {
      "key": "laurentiu_capatina",
      "name": "Laurentiu Capatina",
      "company": "PayFit",
      "companyLogo": "/images/partners/payfit.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/laurentiu_capatina.jpg",
      "socials": {
        "github": "lcapatina"
      },
      "bio": "I'm currently working as an SRE at PayFit on internal developer platform topics being curious about database resilience & optimisation subjects. At PayFit, we work closely with product teams on their data related issues pushing towards the adoption of performant solutions and supporting migrations out of legacy systems.\n\nPreviously, I was part of the Mantu AI Innovation Lab first as a data scientist, next taking a role of a data engineer and afterwards becoming the system administrator in charge of building an on-premise infrastructure for AI oriented projects. Furthermore, I also acted as a promoter on GreenIT subjects participating at client facing presentations and giving internal trainings."
    },
    {
      "key": "laurine_le_net",
      "name": "Laurine LE NET",
      "company": "Takima",
      "companyLogo": "/images/partners/takima.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/laurine_le_net.jpg",
      "socials": {},
      "bio": "Certains penseront certainement qu’avec un nom pareil, Laurine LE NET était prédestinée à l’IT. Dans les faits, se sont les macros VBAs d’Excel qui l’ont poussée dans le monde du dev (pas de jugement)... Et depuis, le code et Laurine, c’est une grande histoire d’amour dans laquelle elle s’investit à 500%.\n\nFormatrice, conférencière en école, elle aime transmettre son savoir-faire et partager ses tips. Et des tips ? Elle en a plein ! \n\nDans la tête de Laurine, tout est rangé dans des boites, et donc, le clean code, elle adore ça.\n\nArchitectures, conception, best practices, tout mène à penser qu’il y aura de belles choses à apprendre à ses côtés."
    },
    {
      "key": "leonie_watson",
      "name": "Léonie Watson",
      "company": "W3C",
      "city": "Bristol, UK",
      "photoUrl": "/images/speakers/leonie_watson.jpg",
      "socials": {
        "twitter": "leoniewatson",
        "linkedin": "lwatson"
      },
      "bio": "Accessibility engineer, Director of TetraLogical, member of W3C Board of Directors, W3C WebApps co-Chair, writer and speaker, screen reader user, tequila drinker and crime fiction junkie."
    },
    {
      "key": "lise_quesnel",
      "name": "Lise Quesnel",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/lise_quesnel.jpg",
      "socials": {
        "twitter": "QuesnelLise",
        "github": "lisequesnel"
      },
      "bio": "Consultante en développement web, j'ai évolué dans différents contextes, me permettant d'avoir un esprit critique sur les pratiques de développement, l'organisation et la communication en équipe. J'aime questionner et comprendre pourquoi les choses ont été faites ainsi, tant sur le plan technique qu'organisationnel. Je porte également une attention particulière aux bonnes pratiques de développement.\nDepuis plusieurs années, je partage également mes connaissances lors de conférences techniques. Féministe dans un milieu masculin, j'essaie de faire bouger les choses."
    },
    {
      "key": "loic_mathieu",
      "name": "Loïc Mathieu",
      "company": "Kestra Technologies",
      "companyLogo": "/images/partners/kestra_technologies.png",
      "city": "Lille, France",
      "photoUrl": "/images/speakers/loic_mathieu.jpg",
      "socials": {
        "twitter": "loicmathieu",
        "github": "loicmathieu"
      },
      "bio": "Loïc est  Lead Software Engineer chez [Kestra Technologies](https://kestra.io/) où il aide à créer leur SaaS, anciennement consultant formateur chez Zenika Lille, il est aussi Google Developer Expert (GDE) Google Cloud. \nIl réalise des missions variées autour de Java, de la JVM, de l’architecture solution et de la performance. Ni le Cloud, ni Kubernetes, ni Kafka ne lui font peur; il aime relever des défis et apprendre de nouvelles choses. \nContributeur Quarkus depuis plus de 3 ans, il contribue à plusieurs extensions et parle régulièrement de Quarkus (et d’autres sujets) dans des meetups ou des conférences, et même parfois sur son [blog](https://www.loicmathieu.fr)."
    },
    {
      "key": "lucas_audart",
      "name": "Lucas AUDART",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/lucas_audart.jpg",
      "socials": {
        "twitter": "Slocalyy",
        "github": "Slocaly"
      },
      "bio": "Je m'appelle Lucas Audart, je suis un jeune développeur lyonnais, spécialisé dans le développement web et l'écosystème Javascript.\n\nJe suis passionné de technologie web, avec une affection particulière pour les technologies front-end. Actuellement Consultant pour Zenika Lyon, je suis en mission chez Kolecto où je suis développeur Front-end sur une React / NextJs que j'affectionne grandement.\n"
    },
    {
      "key": "luz_delgado",
      "name": "Luz Delgado",
      "photoUrl": "/images/speakers/luz_delgado.jpg",
      "socials": {}
    },
    {
      "key": "manon_carbonnel",
      "name": "Manon Carbonnel",
      "company": "Shodo Nantes",
      "companyLogo": "/images/partners/shodo_nantes.png",
      "city": "Rennes, France",
      "photoUrl": "/images/speakers/manon_carbonnel.jpg",
      "socials": {
        "twitter": "manoncarbonnel_",
        "github": "manoncarbonnel"
      },
      "bio": "🌐 Développeuse web full stack (PHP, Python, JavaScript) et facilitatrice Agile chez [Shodo Nantes](https://shodo.io/), passionnée par les cultures Agile et le Software Craft.\n\n🤝 J'apprécie particulièrement le travail en équipe, notamment en mob programming, et je facilite régulièrement des katas pour encourager cette pratique via le le meetup [Mob Programming FR](https://www.meetup.com/paris-mob-programming/).\n\n✊ Je milite pour une meilleure inclusion des femmes et des personnes LGBT+ dans la tech."
    },
    {
      "key": "marjorie_aubert",
      "name": "Marjorie Aubert",
      "company": "Comet",
      "companyLogo": "/images/partners/comet.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/marjorie_aubert.png",
      "socials": {
        "twitter": "Tagada2022",
        "github": "@Tagada26"
      },
      "bio": "Bonjour à toutes et à tous,\n\nJe m’appelle Marjorie, développeuse full-stack chez Comet. Cela n’a pas toujours été mon métier. Après 6 années en tant que conseillère nationale en prévention des risques professionnels pour le monde agricole durant lesquelles j’ai effectué des missions de PO, je suis tombée dans le terminal avec joie il y a presque deux ans.\n\nTrès heureuse de pouvoir vous rencontrer, et de partager ensemble à Who run the tech ☀️"
    },
    {
      "key": "mathieu_ancelin",
      "name": "Mathieu Ancelin",
      "company": "SERLI",
      "companyLogo": "/images/partners/serli.png",
      "city": "Poitiers, France",
      "photoUrl": "/images/speakers/mathieu_ancelin.jpg",
      "socials": {
        "twitter": "TrevorReznik",
        "github": "mathieuancelin"
      },
      "bio": "CTO & Co-Founder @ Cloud APIM, dev @Serli, Open source enthusiast, I created Otoroshi, an opensource http reverse proxy and API Management plateform."
    },
    {
      "key": "mazlum_tosun",
      "name": "Mazlum Tosun",
      "company": "GroupBees",
      "companyLogo": "/images/partners/groupbees.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/mazlum_tosun.jpg",
      "socials": {
        "twitter": "MazlumTosun3",
        "github": "tosun-si"
      },
      "bio": "# About me 👋\n\nGoogle Developer Expert on Google Cloud.\n\nPassionate about tech and Data, Craftsman at heart and functional programming lover, I work on long missions or specialized expertise with many customers.\n\nTech Lead Full-Stack in the past, I set up architectures (Hexagonal, Domain Driven Design) and helped teams to improve their code quality and propose best practices.\n\nToday Lead and Architect Data on Google Cloud, I evangelize this platform while ensuring continuous improvement and expertise.\nI explore issues related to Data, Infra As Code, DevOps automation (CI/CD) and best practices.\n\nCo-founder and Head of Data & Cloud of GroupBees, a group of freelances consultants intended to give them access to a framework, to a community based on sharing in order to ensure them a rise in skills as well as better employability:\n\nMy Google Cloud content :\n- Videos : https://bit.ly/gcp-learning-mazlum-gb\n- Article : https://medium.com/@mazlum.tosun"
    },
    {
      "key": "melanie_bats",
      "name": "Mélanie Bats",
      "company": "Obeo",
      "companyLogo": "/images/partners/obeo.png",
      "city": "Toulouse, France",
      "photoUrl": "/images/speakers/melanie_bats.jpg",
      "socials": {
        "twitter": "melaniebats",
        "github": "mbats"
      },
      "bio": "I am Mélanie Bats and I am CTO at Obeo. In my daily work, I am mainly focused on the development of modeling tools with Sirius. I am also committer for  the Sirius project. I am also involved in the Eclipse community as being part of the Eclipse Planning Council. I am also a free software activist who has organized and participated in free software events in the Toulouse area."
    },
    {
      "key": "melissa_cruz",
      "name": "Mélissa Cruz",
      "photoUrl": "/images/speakers/melissa_cruz.jpg",
      "socials": {}
    },
    {
      "key": "melissa_pinon",
      "name": "Mélissa PINON",
      "company": "Sopra Steria",
      "companyLogo": "/images/partners/sopra_steria.png",
      "city": "Angers, France",
      "photoUrl": "/images/speakers/melissa_pinon.jpg",
      "socials": null,
      "bio": "Ingénieur DevOps/SRE chez Sopra Steria, je travaille avec mon équipe sur l'industrialisation de divers projets. \n\nNous fournissons des outils, gérons la partie Gitlab CI/CD et administrons les clusters Kubernetes."
    },
    {
      "key": "mickael_alves",
      "name": "Mickaël Alves",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/mickael_alves.png",
      "socials": {
        "twitter": "CruuzAzul",
        "github": "CruuzAzul"
      },
      "bio": "👋🏼 Web Maker, application builder et passionné par le développement web, le Javascript, le design et les nouvelles technologies ! 👨🏻‍💻\n\nActuellement consultant web chez Zenika 🔴, j'adore partager mes connaissances en enseignant en école ou en parlant lors de conférences 📣\n\nJe suis co-organisateur de LyonJS 🦁, Appwrite Hero 🦸🏼‍♂️, et Remotion Expert 🎬.\n"
    },
    {
      "key": "milica_mihajlija",
      "name": "Milica Mihajlija",
      "company": "Google",
      "companyLogo": "/images/partners/google.png",
      "city": "London, UK",
      "photoUrl": "/images/speakers/milica_mihajlija.jpg",
      "socials": {
        "twitter": "bibydigital",
        "github": "mihajlija"
      },
      "bio": "Milica is a technical writer at Google working on privacy and identity. She is a big believer in the open web, always exploring new technologies that are moving it forward.\n"
    },
    {
      "key": "morgan_blanloeil",
      "name": "Morgan Blanloeil",
      "company": "WeScale",
      "companyLogo": "/images/partners/wescale.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/morgan_blanloeil.jpg",
      "socials": {
        "twitter": "morganBlan"
      },
      "bio": "Cloud Native Developer chez WeScale\n\nDéveloppeur Backend avec une forte appétence pour les sujets d'automatisation et de conteneurisation !\n\nJe fais également partie de ceux qui pensent que le DevOps est bien une philosophie et non un métier !\n\n"
    },
    {
      "key": "nicolas_frankel",
      "name": "Nicolas Fränkel",
      "company": "Apache APISIX",
      "companyLogo": "/images/partners/apache_apisix.png",
      "city": "Geneva, Switzerland",
      "photoUrl": "/images/speakers/nicolas_frankel.jpg",
      "socials": {
        "twitter": "nicolas_frankel",
        "github": "nfrankel"
      },
      "bio": "Developer Advocate with 15+ years experience consulting for many different customers, in a wide range of contexts (such as telecoms, banking, insurances, large retail and public sector). Usually working on Java/Java EE and Spring technologies, but with focused interests like Rich Internet Applications, Testing, CI/CD and DevOps. Currently working for Hazelcast. Also double as a teacher in universities and higher education schools, a trainer and triples as a book author."
    },
    {
      "key": "nicolas_lavacry",
      "name": "Nicolas Lavacry",
      "company": "Casden Banque Populaire",
      "companyLogo": "/images/partners/casden_banque_populaire.png",
      "photoUrl": "/images/speakers/nicolas_lavacry.jpg",
      "socials": {
        "twitter": "levaski",
        "github": "levaski"
      },
      "bio": "Nicolas est architecte au sein de la Casden Banque Populaire, mais est passé par différents environnements fonctionnels tels que la domotique, la billetterie ou encore les courses hippiques.\nPassionné de nouvelles technologies autant que de bons plats, il aime y mettre son grain de sel."
    },
    {
      "key": "noemie_d_",
      "name": "Noémie Delrue",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/noemie_d_.jpg",
      "socials": {
        "twitter": "NoemieDelrue"
      },
      "bio": "Salut c'est Noémie !\n\nNantaise pure petit beurre et bretonne de cœur, je travaille dans l'informatique depuis 8 ans.\n\nMon univers à moi ? C'est avant tout du Microsoft. Entre cas d'usage spécifiques, contraintes techniques ou de gouvernance, j'ai le sentiment que chacun de mes projets n'est jamais qu'un nouveau puzzle à résoudre.\n\nEn dehors ça, je suis aussi une grande bricoleuse. Je rénove ma maison de fond en comble. Ce qui n'est toutefois qu'un nouveau casse-tête quand on y regarde d'un peu plus près.\n\nLaissez-vous tenter par les histoires que j'ai à raconter =D"
    },
    {
      "key": "olivier_leplus",
      "name": "Olivier Leplus",
      "company": "AWS",
      "companyLogo": "/images/partners/aws.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/olivier_leplus.png",
      "socials": {
        "twitter": "olivierleplus",
        "github": "tagazok"
      },
      "bio": "Developer Advocate at AWS and Google Developer Expert in Web Technologies. I love to share knowledge (and love) among developers and people in general."
    },
    {
      "key": "olivier_perez",
      "name": "Olivier Perez",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/olivier_perez.jpg",
      "socials": {
        "twitter": "olivierperez",
        "github": "olivierperez"
      },
      "bio": "Développeur piloté par la passion, j'ai arrêté de compter les langages que j'ai rencontré depuis mes 10 ans. À 33 ans, je suis aujourd'hui développeur Android chez Zenika, mes journées m'amènent à faire beaucoup de Kotlin mais mes soirées m'offrent la possiblité de faire joujou avec plein d'autres technos."
    },
    {
      "key": "olivier_poncet",
      "name": "Olivier Poncet",
      "company": "Hawkswell",
      "companyLogo": "/images/partners/hawkswell.png",
      "city": "Massy, France",
      "photoUrl": "/images/speakers/olivier_poncet.jpg",
      "socials": {
        "twitter": "ponceto91",
        "github": "@ponceto"
      },
      "bio": "Geek, ex-nerd repenti, je code, je teste, je bricole, je soude et parfois fait sauter les plombs. CTO et spécialiste du magiciel, je suis aussi libriste dans l'âme et très impliqué dans le mouvement des logiciels libres."
    },
    {
      "key": "paul_vulliemin",
      "name": "Paul Vulliemin",
      "company": "Sopra Steria",
      "companyLogo": "/images/partners/sopra_steria.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/paul_vulliemin.jpg",
      "socials": null,
      "bio": "Ingénieur logiciel chez Sopra Steria, je suis un profil touche à tout/couteau suisse, passionné par tous les sujets techniques liés à l'IT.\n\nJ'aime apprendre et découvrir de nouveaux sujets techniques, et j'aime par dessus résoudre des problèmes.\n\nJ'ai commencé par le développements d'applications et maintenant je travaille principalement sur des sujets liés à l'industrialisation et à l'administration de systèmes : CI/CD, Kubernetes, Docker, Ansible, Terraform, etc. Tout en intervenant toujours ponctuellement sur d'autres sujets techniques.\n\nMes péchés mignons ce sont les PoC, et ma kryptonite, la doc."
    },
    {
      "key": "philippe_antoine",
      "name": "Philippe Antoine",
      "company": "Google",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/philippe_antoine.jpg",
      "socials": {}
    },
    {
      "key": "pierre_therrode",
      "name": "Pierre Therrode",
      "company": "SNCF Connect & Tech",
      "companyLogo": "/images/partners/sncf_connect___tech.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/pierre_therrode.jpg",
      "socials": {
        "github": "pi-2r"
      },
      "bio": "développeur chez SNCF Connect & Tech sur la partie chatbot"
    },
    {
      "key": "safae_dinia",
      "name": "Safae Dinia",
      "photoUrl": "/images/speakers/safae_dinia.jpg",
      "socials": {}
    },
    {
      "key": "sandra_pietrowska",
      "name": "Sandra Pietrowska",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/sandra_pietrowska.jpg",
      "socials": {},
      "bio": "Passionnée par l'univers de la Data, après plusieurs années d'expérience, j'ai pris conscience de l'importance à la fois du \"Savoir-faire\" et du \"Faire-savoir\" dans ce domaine.\n\nEn ce qui concerne le \"Savoir-faire\", je contribue en tant que Data Scientist et ML Engineer au développement de Produits Data. Mon expertise couvre la compréhension des besoins, la collecte et la préparation des données, ainsi que la conception et l'industrialisation d'algorithmes de machine learning, tout en suivant les bonnes pratiques du code.\n\nQuant au \"Faire-savoir\", mon objectif est de démystifier la Data en mettant en lumière ses enjeux et ses concepts clés, ainsi qu'en sensibilisant aux risques associés à l'utilisation des données. Je partage cette mission à travers des formations, des articles de blog, des conférences, et ma récente initiative, la Fresque de la Data. Mon engagement vise à rendre la Data plus accessible et compréhensible pour tous."
    },
    {
      "key": "simon_chopin",
      "name": "Simon Chopin",
      "company": "Canonical",
      "companyLogo": "/images/partners/canonical.png",
      "city": "Rennes, France",
      "photoUrl": "/images/speakers/simon_chopin.jpg",
      "socials": {
        "github": "schopin-pro"
      },
      "bio": "I'm a software jack-of-all-trades, partial to working in the bowels of modern operating systems. I started learning my craft contributing to Debian while in university. I then spent a number of years doing all sorts of things, from Linux kernel development up to Windows WPF app development to WebGL rendering, to finally land at Canonical where I've been working since 2021 (\"Impish Indri\") in the Ubuntu Foundations team, maintaining the plumbing of the OS you've all come to know and have ambivalent feelings about.\n\nI have strong opinions loosely held about things such as C, Rust, packaging, software toolchains, FOSS, or Breton folk music :-)"
    },
    {
      "key": "simon_mercier",
      "name": "Simon Mercier",
      "company": "Worldline",
      "companyLogo": "/images/partners/worldline.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/simon_mercier.png",
      "socials": {}
    },
    {
      "key": "stephane_begaudeau",
      "name": "Stéphane Begaudeau",
      "company": "Obeo",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/stephane_begaudeau.jpg",
      "socials": {
        "twitter": "sbegaudeau",
        "github": "sbegaudeau"
      },
      "bio": "Stéphane Bégaudeau est un développeur full stack et consultant en modélisation chez Obeo, un membre stratégique de la Fondation Eclipse. Il y contribue notamment à différents projets open source de la Fondation Eclipse depuis près d'une décennie."
    },
    {
      "key": "stephane_trebel",
      "name": "Stéphane Trebel",
      "company": "WeScale",
      "companyLogo": "/images/partners/wescale.png",
      "photoUrl": "/images/speakers/stephane_trebel.jpg",
      "socials": {
        "twitter": "stephanetrebel",
        "github": "StephaneTrebel"
      },
      "bio": "Je bourlingue depuis une vingtaine d'années dans le monde du numérique, entre développement web full-stack et architecture de solutions diverses et variées\n\nMes intérêts:\n- Le code, quelque soit le langage, avec quand même une grosse préférence pour la Programmation Fonctionnelle et la Qualité Logicielle\n- L'automatisation, quelle qu'elle soit, en particulier des tests, et donc l'Intégration Continue\n- L'itération, et donc le DevOps\n- Les memes, partout, toujours, tout le temps"
    },
    {
      "key": "stephanie_vachon",
      "name": "Stéphanie Vachon",
      "company": "Nantes Métropole",
      "companyLogo": "/images/partners/nantes_numerique_responsable_.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/stephanie_vachon.png",
      "socials": {
        "twitter": "vachon_steph"
      },
      "bio": "Cheffe de projet aux usages collaboratifs numériques - Direction des Ressources Numériques - Nantes Métropole\n\nAnciennement :\nIntégratrice front-end et développeuse web WordPress jusqu'en 2023\nFormatrice à l'école Webstart, MJM et ECV pendant 5 ans\n\nAsso :\nMembre du bureau de l'association Designers Ethiques\nIntervention diverses avec Estim Numérique"
    },
    {
      "key": "sylvain_coudert",
      "name": "Sylvain Coudert",
      "company": "Freelance",
      "city": "Auvergne, France",
      "photoUrl": "/images/speakers/sylvain_coudert.jpg",
      "socials": {
        "twitter": "sylv_coud"
      },
      "bio": "Dev .NET depuis 2008, Freelance depuis 2018, Crafter devant l'éternel et debugger de l'infini!\nJ'aime apprendre, transmettre et découvrir.\nChanteur rockeur circassien intermittent et papa à temps plein, j'aime également prendre le temps de regarder le vent agiter les feuilles d'un arbre."
    },
    {
      "key": "theo_gianella",
      "name": "Théo Gianella",
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "/images/speakers/theo_gianella.jpg",
      "socials": {
        "github": "TGianella"
      },
      "bio": "I am a former teacher/researcher in French literature who turned his life around in 2023 to become a web developer. I currently work as a front-end developer at Zenika in Lyon, on assignment for Bedrock Streaming where I participate in maintaining and enhancing the web apps for some of the biggest streaming platforms in Europe !\n\nThe main thing I kept from my first career is a passion in talking to other people about the things I love or which spark my curiosity. I already had the chance to talk @Devoxx France in 2024 and soon @Breizhcamp !"
    },
    {
      "key": "thierry_chantier",
      "name": "Thierry Chantier",
      "city": "Villeurbanne, France",
      "photoUrl": "/images/speakers/thierry_chantier.jpg",
      "socials": {
        "twitter": "titimoby",
        "github": "titimoby"
      },
      "bio": "Une passion née dans les lectures, le monde informatique et électronique m'a happé dès mon ZX Spectrum pour ne jamais me lâcher.<br/>\nDéveloppeur de métier, du jeu vidéo au monde du master data management, j'ai aussi touché aux univers de la QA et de la mise en production.<br/>\nJe suis maintenant Developer Advocate, chez OVHcloud, jonglant entre technique, communauté et transmission de savoirs.\n\nComme une passion mérite toujours qu'on la transmette, j'ai fondé Mixteen pour essayer d'aider les enfants à appréhender le monde numérique.<br/>\nCette envie de transmettre c'est aussi manifestée en m'amenant à prendre part à l'organisation de plusieurs MiXiT puis à cofonder le GDG Lyon.<br/>\nDe manière parallèle, j'essaie de partager également par le biais d'articles sur mon blog et de vidéos sur ma chaîne YouTube.<br/>\n\nEn résumé : <br/>\nhttps://noti.st/titimoby\n\nDans le détail : <br/>\nhttps://www.twitch.tv/titimoby<br/>\nhttps://mixteen.org/ <br/>\nhttps://tontoncodeur.fr/ <br/>\nhttps://www.youtube.com/thierrychantier\nhttps://gdg.community.dev/gdg-cloud-and-iot-lyon/ <br/>"
    },
    {
      "key": "thomas_paillot",
      "name": "Thomas Paillot",
      "company": "INRIA",
      "companyLogo": "/images/partners/inria.png",
      "city": "Montpellier, France",
      "photoUrl": "/images/speakers/thomas_paillot.jpg",
      "socials": {
        "github": "@thomaspaillot"
      },
      "bio": "Thomas Paillot is an experienced Frontend Software Engineer with over 10 years of industry experience. Initially trained in art and design, Thomas began his career as a UX designer, combining creativity with technical expertise. Over time, he transitioned into a frontend developer role, specializing in crafting user-friendly interfaces that effectively merge design principles with robust coding practices. Currently, Thomas is employed at [INRIA](https://www.inria.fr) (french institute dedicated to science and research in digital technologies), where he contributes to the development of the [Pl@ntNet website](https://identify.plantnet.org) — a participatory science tool designed to assist individuals worldwide in identifying plants."
    },
    {
      "key": "thomas_rannou",
      "name": "Thomas Rannou",
      "company": "Microsoft",
      "companyLogo": "/images/partners/microsoft.png",
      "city": "Nantes, France",
      "photoUrl": "/images/speakers/thomas_rannou.jpg",
      "socials": {
        "twitter": "thomas_rannou",
        "github": "thomasrannou"
      },
      "bio": "Cloud Solution Architect @ Microsoft. Passioné de logiciel et de nuage j'aime bidouiller, builder et déployer mon code partout où il peut être exécuté !"
    },
    {
      "key": "tiffany_souterre",
      "name": "Tiffany Souterre",
      "company": "AWS",
      "companyLogo": "/images/partners/aws.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/tiffany_souterre.jpg",
      "socials": {
        "twitter": "tiffanysouterre",
        "github": "amagash"
      },
      "bio": "I love science and I love data! After finishing a PhD in genetic engineering, I continued my quest for discovering new patterns through data science and machine learning. I worked for 3 years as ML/Data Engineer and I discovered the world of Developer relations at Microsoft. I now work as a Developer Advocate in AI/ML at AWS and I love sharing my passion with other developers."
    },
    {
      "key": "tony_jarriault",
      "name": "Tony Jarriault",
      "company": "Cap Gemini",
      "companyLogo": "/images/partners/capgemini.png",
      "city": "Toulouse, France",
      "photoUrl": "/images/speakers/tony_jarriault.jpg",
      "socials": {
        "twitter": "JarriaultTony",
        "github": "TJarriault"
      },
      "bio": "Depuis mes premier pas en informatique, j'ai toujours été fasciné par les enjeux liés à la sécurité numérique, je suis également cloud addict. Le cloud nous apporte une très grande agilité, pour nous donner accès à l’innovation !\n\nJ'ai été responsable technique pour le build et le run de plate forme infogérée. J'ai participé au coaching des équipes sur le volet technique.\nJ’accompagne nos clients dans la définition de leur besoin et de la mise en œuvre des solutions. \n"
    },
    {
      "key": "tristan_nitot",
      "name": "Tristan Nitot",
      "company": "OCTO Technology",
      "companyLogo": "/images/partners/octo_technology.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/tristan_nitot.jpg",
      "socials": {
        "twitter": "J'ai quitté ce feu de poubelle",
        "github": "nitot"
      },
      "bio": "Tristan Nitot, 57 ans, est entrepreneur du numérique, consultant, auteur et conférencier. Il a été impliqué depuis ses débuts dans le projet open source [Mozilla](https://www.mozilla.org/fr/) (à qui l'on doit le navigateur Web Firefox), a co-fondé Mozilla Europe, qu'il a présidé pendant près d'une décennie. Il a ensuite rejoint la Startup française Cozy Cloud (hébergement de données personnelles en open source) puis le moteur de recherche européen Qwant. Après un passage en tant que responsable *Sustainability* chez l'hébergeur Cloud Scaleway, il est dorénavant directeur associé d'[OCTO Technology](https://octo.fr) et travaille sur les Communs Numériques et l'anthropocène au sein du collectif [Frugarilla.fr](https://www.frugarilla.fr/). Depuis plusieurs années, il s'investit aussi dans la lutte contre le dérèglement climatique et a lancé le podcast \"[L'Octet Vert](https://www.standblog.org/blog/category/podcast)\", qui explore la relation entre le climat et le numérique. "
    },
    {
      "key": "valentin_deleplace",
      "name": "Valentin Deleplace",
      "photoUrl": "/images/speakers/valentin_deleplace.jpg",
      "city": "Paris, France",
      "company": "Google",
      "socials": {
        "twitter": "val_deleplace",
        "github": "Deleplace",
        "linkedin": "deleplacevalentin"
      },
      "bio": "Valentin is a developer of cloud backends. He's into performance, algorithms, DB, UX, DX, and Go"
    },
    {
      "key": "vanessa_perillat",
      "name": "Vanessa Perillat",
      "company": "SFEIR",
      "companyLogo": "/images/partners/sfeir.png",
      "city": "Paris, France",
      "photoUrl": "/images/speakers/vanessa_perillat.jpg",
      "socials": {
        "twitter": "vanessaperillat"
      },
      "bio": "Après un parcours en France et aux Etats-Unis, j’anime depuis 5 ans les équipes Talent Acquisition d'une entreprise constituée de 900 développeuses, développeurs, tech lead et architectes qui s'appelle SFEIR.\n\nJe fais à présent partie du comité de direction de l'entreprise et il m'a fallu du temps dans ma carrière professionnelle, pour comprendre que seul le travail et la performance ne suffisaient pas pour atteindre ses objectifs d'épanouissement professionnel.\n\nJ'aimerais, à travers cette conférence, vous faire gagner du temps pour vous donner les clés et les leviers pour être épanoui.e professionnellement.\n\nJe crois fondamentalement en l'intelligence collective et le partage avec la communauté et je suis ravie de pouvoir y contribuer à travers cette conférence. \n\nhttps://www.linkedin.com/in/vanessa-perillat/\n"
    },
    {
      "key": "viktoria_semaan",
      "name": "Viktoria Semaan",
      "company": "AWS",
      "companyLogo": "/images/partners/aws.png",
      "city": "New York, USA",
      "photoUrl": "/images/speakers/viktoria_semaan.jpg",
      "socials": {},
      "bio": "As a Senior Developer Advocate at AWS, Viktoria helps developers learn and build AI and cloud solutions. She develops technical resources, tutorials, and guides that equip individuals with the skills they need to thrive in the tech industry. Viktoria has been recognized as the #4 Top Female Content Creator worldwide and has built a community of over 500,000 tech enthusiasts on her social media platforms.\n\nViktoria's career experience spans technology, management consulting, and engineering. She has previously led Build and Go-To-Market motions with AWS Strategic Software Partners. Before joining AWS, she worked at Accenture Strategy & Consulting. Beyond her role in driving product innovation and go-to-market strategies, Viktoria is deeply committed to coaching and talent development, as well as advocating for diversity and inclusion.\n\nShe earned an MBA from the UCLA Anderson School of Management and completed the Entrepreneurial Studies Summer Program at HEC Paris."
    },
    {
      "key": "yohan_lasorsa",
      "name": "Yohan Lasorsa",
      "company": "Microsoft",
      "companyLogo": "/images/partners/microsoft.png",
      "city": "Grenoble, France",
      "photoUrl": "/images/speakers/yohan_lasorsa.jpg",
      "socials": {
        "twitter": "sinedied",
        "github": "sinedied"
      },
      "bio": "Passionné d'Open Source et d'artisanat logiciel, le web est le terrain de jeu ultime pour Yohan. Avec plus de 15 ans d'expérience dans divers domaines tels que la recherche appliquée sur le mobile et l'IoT, en passant par le développement et l'architecture d'applications cloud, il a commencé avec des stacks de bas niveau avant de plonger dans le développement web. En tant qu'ingénieur fullstack et bricoleur du dimanche, il aime maintenant pousser des morceaux de JavaScript partout où il peut, en partageant sa passion avec les autres."
    }
  ]
}