{
  "sessions": [
    {
      "key": "____crowdsec___la_securite_web_par_la_foule",
      "title": " 🔒 Crowdsec - la sécurité web par la foule",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "security"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "arthur_lutz"
      ],
      "slot": "day-1-quickie-1",
      "room": "Belem",
      "openfeedbackId": 64,
      "abstract": "À l'heure de l'intelligence collective et du machine learning, que diriez vous d'une introduction à l'approche collaborative en matière de sécurité informatique ?\n\nCrowdsec est une plateforme de détection et protection collaborative des tentatives d'intrusion des systèmes informatiques. Sans rentrer dans le détail des enjeux de cybersécurité, nous allons regarder comment fonctionne ce projet.\n\nPour faire le pont entre la catégorie \"💻 Security\" et \"☁️ DevOps & Cloud\", nous regarderons comment Crowdsec identifie les menaces ou scans dans une infrastructure hébergée sur ☸️ Kubernetes et comment il permet de limiter ces attaques ou tentatives d'intrusions. Une bonne partie de Crowdsec est publié en logiciels libres.\n\n🧑‍💻 *Pile technique : golang, linux, nginx, lua, kubernetes, iptables, CVE*"
    },
    {
      "key": "___panique_a_bord_du_nautilus_____nemo_vous_initie_a_la_programmation_iot___",
      "title": "😱 Panique à bord du Nautilus 🐚! Nemo vous initie à la programmation IoT 📟",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "mobile_iot"
      ],
      "complexity": "Beginner",
      "speakers": [
        "guillaume_membre",
        "jeremy_lejeune",
        "stephane_cohan"
      ],
      "slot": "day-1-codelab-1",
      "room": "Hangar",
      "openfeedbackId": 24,
      "abstract": "Vous êtes les électromécaniciens 🛠 du Nautilus 🐚 et une avarie a provoqué une défaillance des générateurs ! Vous devez à tout prix réparer la salle des machines…\nPas de panique, armé d’un micro-contrôleur, de leds et de capteurs, vous vous attelez à remettre en marche le sous-marin, façon DIY.\n\nAu travers de ce codelab, venez réveiller le Maker qui sommeille en vous en s'initiant à la programmation sur ESP32, un micro-contrôleur très utilisé par la communauté DIY, et (re-)découvrir quelques bases d'informatique embarquée.\n\nSeul ou en binôme, cet atelier est accessible aux débutants en électronique comme en développement. Pour faciliter le démarrage des TPs, l'installation de l'outil [Arduino IDE](https://www.arduino.cc/en/software) est indispensable.\nAttention, le nombre de places est limité à 20 tables en binome ou en individuel!"
    },
    {
      "key": "_cloudrun_a_l_echelle_d_une_entreprise",
      "title": "CloudRun à l’échelle d’une entreprise",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "antony_lallement",
        "christophe_furmaniak"
      ],
      "slot": "day-1-conference-5",
      "room": "Jules Verne",
      "openfeedbackId": 45,
      "abstract": "**Decathlon** accélère sa transformation numérique avec pour ambition de devenir *LA* plateforme numérique du sportif et atteindre le niveau de maturité des Digital Giants.\nPour cela, Decathlon a besoin de construire des fondations solides pour héberger les services développés et mettre à disposition des solutions techniques pour accélérer le développement, la stabilité,la scalabilité et la sécurité.\n\nUn des choix stratégiques forts de Decathlon est de s’appuyer sur des technologies à base de **conteneurs**, que ceux-ci soient lancés dans des instances **Kubernetes** ou dans des services *serverless* comme **Cloud Run**.\n\n**Cloud Run**, de par ses racines *serverless*, est présenté comme un service facilitant l’adoption des développeurs. Cependant, dans un contexte d’entreprise où il ne faut pas oublier les aspects industrialisation, sécurisation des accès, audit et intégration avec l’écosystème réseau interne et celui des partenaires, son utilisation se complexifie fortement.\n\nNous vous présenterons ce que nous proposons à nos développeurs pour leur permettre de se focaliser sur leur métier, à savoir développer, tout en leur permettant de fournir des services **Cloud Run** qui respectent les pratiques partagées au sein de l’entreprise.\n\nMots clé: GCP, Cloud Run, Terraform, GitOps, GitHub Actions, Les Ops sont les amis des Devs, Serverless\n"
    },
    {
      "key": "_retourauxsources___le_cache_http",
      "title": "#RetourAuxSources : Le cache HTTP",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "hubert_sablonniere"
      ],
      "slot": "day-2-conference-3",
      "room": "Jules Verne",
      "openfeedbackId": 2,
      "abstract": "Dans le cadre de nos projets Web, on finit tous tôt au tard par faire appel à ce bon vieux cache HTTP.\nÉvidemment, on cherche à réduire les temps de chargement de nos utilisateurs et à soulager la charge de nos serveurs.\nAu départ, ça parait simple, il suffit \"juste\" de l'activer.\nAu milieu, on se perd un peu dans les en-têtes et les multiples couches qui entrent en jeu.\nEt à la fin, ça se termine bien trop souvent par un « Ça ne marche pas ? Essaye en vidant ton cache ! ».\n\nChoisir et implémenter une stratégie de cache, c'est complexe et ça ne se fait pas à la fin du projet.\nChaque étape est concernée : conception, développement, build, déploiement et run.\nPour faire les bons choix, il est important de bien comprendre comment tout cela fonctionne.\n\nAu menu de cette session, je vous propose de (re)découvrir le cache HTTP par l'exemple et la pratique.\nNous reviendrons sur les différents en-têtes HTTP gérés par les navigateurs, CDN, proxys-cache et autres serveurs.\nNous parlerons des différents caches présents au sein des navigateurs (HTTP, Service Worker, back/forward...).\nEnfin, nous aborderons différents contextes et cas de figures en proposant des stratégies adaptées (site statique, SPA, API REST...)."
    },
    {
      "key": "ameliorer_l_experience_utilisateur_de_nos_formulaires",
      "title": "Améliorer l'expérience utilisateur de nos formulaires",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "ux_ui"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "geoffrey_crofte"
      ],
      "slot": "day-2-conference-1",
      "room": "Tour de Bretagne",
      "openfeedbackId": 6,
      "abstract": "**Les formulaires sont au centre de notre utilisation du Web aujourd'hui.**\n\nCe n'est pas à l'ère où les chatbots et interfaces vocales sont censés remplacer les formulaires et accompagner les utilisateur·rice·s qu'il faut relâcher nos efforts sur l'ergonomie et la qualité du code et de l'expérience de formulaires web.\n\nEntre **accessibilité, ergonomie, qualité du code et expérience utilisateur**, je vous propose de faire un petit tour d'horizon des erreurs les plus communes et de synthétiser tout cela sous la forme d'une checklist de **bonnes pratiques** qui pourrait encadrer la création de formulaires dans vos projets.\n\nJe vous expliquerai brièvement comment **suivre l'usage** que vos utilisateurs et utilisatrices en ont pour **toujours améliorer leur expérience**.\n"
    },
    {
      "key": "apprenez_rust_pas_a_pas_en_construisant_une_application_en_ligne_de_commande",
      "title": "Apprenez Rust pas à pas en construisant une application en ligne de commande",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "languages"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "julien_rollin"
      ],
      "slot": "day-1-codelab-2",
      "room": "Hangar",
      "openfeedbackId": 8,
      "abstract": "Rust est un langage de programmation récent qui promet fiabilité, performance et sécurité. Cependant Rust est aussi réputé comme difficile d’accès.\n \nVenez développer pas à pas une application en ligne de commande pour découvrir et apprendre Rust.\nL’atelier est conçu de manière pédagogique pour appréhender les concepts un par un tout au long de l’atelier.\n"
    },
    {
      "key": "au_secours__mon_si_est_ouvert_sur_le_cloud___",
      "title": "Au secours, mon SI est ouvert sur le Cloud !!",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "security"
      ],
      "complexity": "Beginner",
      "speakers": [
        "laurent_grangeau",
        "tony_jarriault"
      ],
      "slot": "day-1-conference-1",
      "room": "Titan",
      "openfeedbackId": 23,
      "abstract": "Dans un contexte d’ouverture vers l’extérieur, le SI est de plus en plus exposé publiquement sur Internet.\nMais comment garantir la sécurité de celui-ci ? Le Zero Trust s’impose comme l’approche la plus sécurisée en obligeant les entreprises à contrôler les identités et les autorisations des ressources afin de garantir l’intégrité des flux.\nDans cette session, nous expliquerons brièvement ce qu’est le Zero Trust et comparerons la sécurité périmétrique (modèle du château fort) avec celle de l’approche Zero Trust (modèle de l'aéroport).\nNous verrons comment implémenter cette approche en s’appuyant sur Hashicorp Boundary pour accéder de manière sécurisée et transparente à des serveurs et des bases de données, et GCP IAP pour sécuriser des applications."
    },
    {
      "key": "authentification_autorisation__le_cookie_et_ses_rejetons",
      "title": "Authentification/autorisation: le cookie et ses rejetons",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "clement_delafargue",
        "geoffroy_couprie"
      ],
      "slot": "day-2-conference-2",
      "room": "Titan",
      "openfeedbackId": 41,
      "abstract": "Depuis l'essor des architectures microservices, l'auth a bien évolué. Au cookie de session se sont ajoutés tout un tas de tokens et de topologies (délégation d'accès avec oauth, tokens stateless avec JWT, atténuation avec les macarons…).\n\nNous vous proposons un tour d'horizon des principales architectures que l'on retrouve dans le domaine de l'authentification et de l'autorisation, avec un focus particulier sur  les architectures distribuées.\n\nDans ce cadre, nous vous présenterons les biscuits, une plateforme pour l'autorisation basée sur un jeton permettant la délégation atténuée et un langage de gestion de droits basés sur la programmation logique.\n\nClément et Geoffroy ont travaillé ensemble sur les architectures distribuées chez Clever Cloud, notamment via la mise en place de macarons. Ils contribuent tous les deux au projet biscuit, basé sur leur expérience avec JWT et macarons.  \nGeoffroy travaille désormais chez Apollo GraphQL, où il travaille sur la fédération d'APIs.  \nClément travaille chez bellroy, qu'il a rejoint après fretlink, où il a mis en place toute la platforme d'autorisation basée sur les macarons.  \n\nAprès cette présentation vous aurez une vision plus claire :\n\n- des grands types d'architecture d'autorisation\n- des types de jetons d'auth courants, ainsi que leurs domaines d'application\n- de la modélisation de règles d'accès dans un langage dédié\n- de l'atténuation _offline_ et des perspectives qu'elle ouvre dans les architectures distribuées\n"
    },
    {
      "key": "bien_se_lancer_dans_le_domain_driven_design_sans_se_tromper_de_combat",
      "title": "Bien se lancer dans le Domain Driven Design sans se tromper de combat",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "josian_chevalier"
      ],
      "slot": "day-2-conference-5",
      "room": "Titan",
      "openfeedbackId": 26,
      "abstract": "Le Domain Driven Design est sur toutes les lèvres. Silver bullet ultime, distributeur à buzzwords, à croire que si à ta troisième levée de fonds tu ne fais pas du DDD, t’as raté ta start up. Mais par quoi commencer pour en tirer de la valeur rapidement ?\n\nEt si la réponse n’était pas dans ses agrégats, value-objects, domain events et autres patterns tactiques populaires mais plutôt dans compréhension du métier ? Cela tombe bien car le DDD offre des outils qui permettent de s’approprier le métier afin de le modéliser correctement. \n\nDécouvrons ensemble les patterns stratégiques - la partie la plus importante du Domain-Driven Design  - qui vous offriront de meilleurs retours sur investissement. Cela vous permettra d’adopter en douceur cette philosophie, loin de la hype et des difficultés techniques."
    },
    {
      "key": "bigquery_best_practices_and_recommendations_to_reduce_costs_with_bi_engine__slots__materialized_views",
      "title": "BigQuery best practices and recommendations to reduce costs with BI Engine, Slots, Materialized Views",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "marton_kodok"
      ],
      "slot": "day-2-conference-3",
      "room": "Tour de Bretagne",
      "openfeedbackId": 20,
      "abstract": "This session will deliver best practices and recommendations for tuning BI Engine for your existing BigQuery workloads for cheaper and faster queries. Learn how we at REEA are orchestrating BI Engine reservations, on a 5TB dataset, considered small for BigQuery but with big cost savings and accelerated queries. We are seeing many presentations for big enterprises, but now we are showcasing how our queries perform better with lower costs. We are going to address the top considerations when to turn on BI Engine, how to use cloud orchestration for making this an automatic process, and combined with BigQuery and Datastudio query complexity that might save precious development time, lower bills, faster queries.\n"
    },
    {
      "key": "build_your_8_bit_computer_from_scratch",
      "title": "Build your 8-bit computer from scratch",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "olivier_huber"
      ],
      "slot": "day-2-conference-3",
      "room": "Titan",
      "openfeedbackId": 46,
      "abstract": "\"Ce que je ne peux pas créer, je ne le comprends pas” - Richard Feynman, un des plus grands physiciens, pédagogue remarquable et drôle.\nJe suis passionné par l’informatique bien sûr, mais surtout par la création en général et l’apprentissage en particulier.\nJe souhaite vous présenter, pour la première fois, mon retour d’expérience de la création d’un ordinateur 8-bit à partir de composants électroniques simples et le tout sur breadboard !\nDonc relativement facilement reproductible chez vous, ce qui est par ailleurs mon but initial.\nAncré dans un storytelling bien à moi, je ferai une démonstration en live de l’ordinateur et quels enseignements j’en ai tirés."
    },
    {
      "key": "cassons_des_tokens_jwt",
      "title": "Cassons des tokens JWT",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "security"
      ],
      "complexity": "Beginner",
      "speakers": [
        "benjamin_merieau",
        "jean_verrons"
      ],
      "slot": "day-2-codelab-2",
      "room": "Les Machines",
      "openfeedbackId": 1,
      "abstract": "Vous connaissez tous, ou avez déjà entendu parler des tokens JWT (JSON Web Token). Ils sont souvent utilisés dans le cas de partage d’information entre deux ou plusieurs entités ( par exemple entre un Serveur et un Client).\nCependant, connaissez-vous vraiment leurs entrailles ? Pourquoi certaines informations sont-elles présentes ? Que se passerait-il si vous les oubliez ?\nAprès avoir détaillé la structure d'un token JWT, nous verrons étape par étape quelles sont les attaques possibles sur des tokens JWT et comment les implémenter. Vérification de la signature, clé publique, secret faible ou encore révocation de token sont autant de notions que nous aborderons dans ce TP guidé. Au cours de ces différents exercices nous verrons également quelles sont les bonnes pratiques en termes de sécurité lorsque l'on utilise des tokens JWT."
    },
    {
      "key": "choreography_vs_orchestration_in_serverless_microservices",
      "title": "Choreography vs Orchestration in serverless microservices",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "guillaume_laforge"
      ],
      "slot": "day-1-conference-3",
      "room": "Tour de Bretagne",
      "openfeedbackId": 47,
      "abstract": "We went from a single monolith to a set of microservices that are small, lightweight, and easy to implement. Microservices enable reusability, make it easier to change and scale apps on demand but they also introduce new problems. How do microservices interact with each other toward a common goal? How do you figure out what went wrong when a business process composed of several microservices fails? Should there be a central orchestrator controlling all interactions between services or should each service work independently, in a loosely coupled way, and only interact through shared events? In this talk, we’ll explore the Choreography vs Orchestration question and see demos of some of the tools that can help."
    },
    {
      "key": "cloud_seed_____le_voyage_extraordinaire_promis_par_gitlab_pour_deployer_rapidement_votre_application_sur_gcp",
      "title": "Cloud Seed 🌱- le voyage extraordinaire promis par GitLab pour déployer rapidement votre application sur GCP",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "jean_phi_baconnais"
      ],
      "slot": "day-2-quickie-2",
      "room": "Titan",
      "openfeedbackId": 53,
      "abstract": "Le déploiement de nos applications sur un provider Cloud ne devrait pas être une étape compliquée.\n\nC’est dans ce sens que les équipes d’incubation de GitLab ont initié un nouveau projet : Cloud Seed 🌱. Cette expérimentation basée sur des templates de GitLab CI vous permet de déployer, pour le moment, vos applications rapidement avec Cloud Run. \n\nDans ce talk, je vous présenterai cette nouvelle expérimentation et vous ferai un état des lieux des fonctionnalités à venir."
    },
    {
      "key": "coder_votre_infrastructure_avec_votre_langage_prefere_",
      "title": "Coder votre infrastructure avec votre langage préféré!",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "francois_bouteruche",
        "olivier_leplus"
      ],
      "slot": "day-1-codelab-2",
      "room": "Les Machines",
      "openfeedbackId": 21,
      "abstract": "Pulumi et l'AWS Cloud Developement Kit (AWS CDK) ont ouvert une nouvelle ère pour l'infrastructure-as-code. Jusqu’à maintenant, nous utilisions principalement des langages déclaratifs pour décrire les ressources d'infrastructure dont nous avions besoin. Cela permet d'automatiser complètement le déploiement de l'infrastructure et de rendre celui-ci répétable de manière consistante à l'envie. Cependant, tester ces modèles d’infrastructure sans déployer s’avère complexe, les décomposer en module réutilisable est fastidieux et l’auto-complétion dans les IDE est pauvre.\n\nPulumi et AWS CDK amène à l’infrastructure-as-code à un nouveau niveau en permettant aux développeurs d’utiliser leur langage de programmation favori pour développer, tester et déployer leur infrastructure. Ils peuvent exploiter toute la puissance d’abstraction de leur langage, créer facilement des packages réutilisables et bénéficier d’une auto-complétion performante.\n\nDans ce workshop, vous allez coder votre première infrastructure-as-code avec un des 4 langages proposés : TypeScript, Java, Python ou C#.\n"
    },
    {
      "key": "comment_construire_une_application_micro_frontend_a_l_aide_de_module_federation",
      "title": "Comment construire une application Micro-Frontend à l'aide de Module Federation",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "web"
      ],
      "complexity": "Advanced",
      "speakers": [
        "nicolas_morel",
        "alban_depretz"
      ],
      "slot": "day-2-codelab-2",
      "room": "Hangar",
      "openfeedbackId": 3,
      "abstract": "Alors que votre application frontend grossit, elle devient de plus en plus difficile à maintenir, notamment avec plusieurs équipes travaillant sur  la même base de code.   \nMicro-Frontend est un concept emprunté des microservices pour scaler une application frontend. Votre application monolithique est découpée en de multiple morceaux (par fonctionnalité, page, composant…) où chacun de ces morceaux peuvent être développés et déployés en autonomie par une équipe. \n\nModule Federation permet de partager du code et des dépendances entre application au runtime.  \n\nDans cet atelier, vous apprendrez comment Module Federation facilite la construction d'une application Micro-Frontend."
    },
    {
      "key": "comment_j_ai_largue_apollo_server_pour_graphql_yoga",
      "title": "Comment j'ai largué Apollo Server pour GraphQL Yoga",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "nicolas_lepage"
      ],
      "slot": "day-1-conference-2",
      "room": "Tour de Bretagne",
      "openfeedbackId": 54,
      "abstract": "Dans l'écosystème des serveurs GraphQL, Apollo Server fait figure de référence.\nMais de plus en plus d'alternatives font leur apparition, et notamment en début d'année GraphQL Yoga v2, un serveur fully featured et extensible.\nSimple à mettre en place, Yoga ouvre l'accès via des plugins à de nombreuses fonctionnalités : authentification, mise en cache, reporting d'erreur, et bien plus...\n\nAlors après 4 années de relation compliquée avec Apollo, ma décision est prise, je le largue pour Yoga !\nSeulement après autant de temps, l'adhérence entre mon projet et Apollo est devenue assez forte...\nComment migrer les directives customs ? les subscriptions ? les uploads/downloads de fichiers ? le batching de queries ? et qui va s'occuper des enfants ?\n\nDans cette présentation, je vous donne mon retour d'expérience sur cette séparation difficile mais salutaire.\nGraphQL Yoga est-il vraiment mieux que Apollo Server ? Est-ce simple de migrer de l'un à l'autre ? La promesse de l'extensibilité de Yoga est-elle tenue ?\nEssayons de répondre à toutes ces questions !"
    },
    {
      "key": "comment_programmer_des_portes_logiques_dans_l_adn",
      "title": "Comment programmer des portes logiques dans l'ADN",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "tiffany_souterre"
      ],
      "slot": "day-1-quickie-2",
      "room": "Titan",
      "openfeedbackId": 32,
      "abstract": "\"Programmer le vivant\", on entend souvent cette phrase mais à quel point cela est-il vrai ? \nLes avancées en biotechnologies ont permis de comprendre une partie du code du vivant et l'ingénierie génétique nous permet de le re-programmer de façon très précise. Des concepts tels que les portes et les circuits logiques peuvent être programmés dans l'ADN. \n\nLa biologie n'était pas votre matière préférée à l'école mais vous êtes quand même intrigué·e ? Pas de panique, aucun bagage en biologie n'est requis pour comprendre. Laissez-moi vous montrer ces étonnantes propriétés de la nature et à quel point le vivant n'est pas si loin d'un programme informatique."
    },
    {
      "key": "conception_de_language___communiquer_avec_la_machine",
      "title": "Conception de language : communiquer avec la machine",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "languages"
      ],
      "complexity": "Beginner",
      "speakers": [
        "monsieurbadia"
      ],
      "slot": "day-2-quickie-2",
      "room": "Belem",
      "openfeedbackId": 15,
      "abstract": "parser, tranformer, transpiler, compiler ou encore analyser sont les fers de lance pour construire un compilateur. Mais qu'est-ce qu'un compilateur ? Grosso modo ce n'est rien d'autre qu'un traducteur.\n\nLongtemps laissé pour compte dans le paysage front le compilateur fait son retour dans l'écosystème des frameworks modernes. Par exemple, la stack de l'excellent framework Svelte est basée sur un compilateur. L'idée de ce talk est de voir ensemble les différents modules qui composent la stack d'un compilateur. Pour ensuite pouvoir être capable de créer le notre en Rust from scratch avec zero dépendances *(pas de Bison, pas de Flex).* En soi, le langage d'implémentation n'est pas important. Ce qui nous importe, c'est la sémantique et être capable de traduire un langage donné vers un langage cible. Pour notre cas, nous traduirons un langage A vers l'assemblage web *(WebAssembly).*\n\nAinsi, notre compilateur produira un programme sûr et optimisé pour le web. Si tu es intéressé par le turfu, ou plutôt curieux de comprendre le fonctionnement des frameworks modernes à l'instar de Svelte. Ce talk éclairera tes zones d'ombres et te donnera le bagage technique pour te permettre de créer ton propre compilateur avec le langage de ton choix."
    },
    {
      "key": "ctrl_alt_depression",
      "title": "Ctrl+Alt+Depression",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "ux_ui"
      ],
      "complexity": "Beginner",
      "speakers": [
        "manon_gruaz"
      ],
      "slot": "day-1-conference-2",
      "room": "Titan",
      "openfeedbackId": 61,
      "abstract": "Avez-vous déjà remarqué que Designer et Dépression commencent par les deux mêmes lettres? Coïncidence? \n\nTous les ingrédients pour une bonne dépression sont intrinsèques au métier de designer: Perfectionnisme, Performance, Comparaison et Créativité à tout prix. Faites mijoter dans une culture tech où l’on cherche à plaire en permanence, où quoi que l’on fasse nous ne sommes jamais assez… BOUM, reBOUM et KaBOUM!\n\nJe m’appelle Manon, mon métier est designer et j’ai traversé une dépression majeure. J’ai été en arrêt de travail pendant 11 mois. \n\nLa dépression c’est être un sad mac dans un monde de happy windows. \nAlors que le burnout commence à devenir acceptable, la dépression ne l’est toujours pas. Le burnout (épuisement professionnel) c’est le badge d’honneur des ambitieux, alors que la dépression est encore synonyme de faiblesse, de fainéantise, d’abandon de toute dignité ou naître avec un nuage pluvieux qui nous suit partout. Dans l’imaginaire collectif, il faut avoir honte d’être en dépression. \n\nJ’ai envie de dire Fuck la honte. J’ai envie de lever le voile sur une réalité que beaucoup trop vivent cachés, dans la souffrance et la culpabilité. Souvent isolé et incompris, le retour à la vie « normale » est un chemin semé d’embûches que je comparerais plus à un rollercoaster qu’une croisière dans mon lit. La dépression peut arriver à n’importe qui. Il est temps de regarder la dépression dans le blanc des yeux, avec un petit sourire au coin des lèvres. Car l’humour ça aide à faire passer la pilule…enfin l’antidépresseur!\n\n “Depression is your body saying ‘fuck you, I don’t want to be this character anymore. I don’t want to hold up this avatar that you created. And the world is too much for me” - Jim Carrey\n\nEntre positivisme toxique et culte du «hustle», comment s’en sortir?\nLa réalité est que s’aimer soi-même n’est pas inné et que c’est une aptitude à apprendre. Si guérir, c’était s’aimer? \nSi développer l’auto-compassion était la réponse? Sous prétexte que le design c'est un métier-passion, doit-on tout supporter? Comment se réapproprier sa créativité?\nPeut-on redéfinir la performance, la réussite? Peut-on avoir une relation saine avec son travail?\nPeut-on vivre le bien être et le succès en même temps? Comment soutenir une personne qui vit une dépression? \n\nAvec humour et amour, je vais parler sans fard de la solitude et les pensées suicidaires mais aussi de l'acceptation, les remises en question, les découvertes, la dignité et l’espoir au bout du tunnel. J’ai envie de vous partager les apprentissages et comportements que j’ai appris pour naviguer l'inconfort (qui peuvent vous servir) et les petites choses qui font que maintenant ma vie est plus jolie.\n\nParler de dépression, c’est parler de ce qui nous rend humain sans jugement.\nC’est là que le travail commence.\nEt si on remettait tout en question, Ensemble."
    },
    {
      "key": "dagger_io__le_nouveau_couteau_suisse_portable_base_sur_docker_pour_votre_ci_cd",
      "title": "Dagger.io, le nouveau couteau-suisse portable basé sur Docker pour votre CI/CD",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "herve_leclerc"
      ],
      "slot": "day-2-conference-3",
      "room": "Belem",
      "openfeedbackId": 68,
      "abstract": "Que celui ou celle qui n'a jamais été dans une des situations suivantes me jette la première pierre...\n\n* Refaire n fois le même pipeline de CI/CD sur n solutions différentes ?\n* S'arracher les cheveux pour tenter de reproduire la suite de tests exécutée par la PIC sur les environnements de développement\n* Assimiler n syntaxes pour n solutions de CI/CD différentes ?\n* Faire 50 commits pour troubleshooter un pipeline de CI/CD\n\nDagger.io est un kit de développement permettant de construire des pipelines de CI/CD pouvant être exécutés ensuite sur n'importe quel runtime compatible Docker, y compris votre poste de dev.\n\nCes derniers peuvent donc être exécutés sur votre solution de CI/CD préférée, via une simple commande, mais aussi en local. \nDagger a été développé par les créateurs de Docker, en open-source bien évidemment et repose sur le language CUE, développé par Google.\n\nJe vous propose de le benchmarker ensemble afin de déterminer si la promesse était trop belle pour être vraie, ou si nous sommes en présence de l'outil unique, qui les gouvernera tous. \n\nBon, spoiler alert, on atterrira très probablement quelque part entre les deux....\n\n"
    },
    {
      "key": "dall_e_v2____un_robot_et_un_peintre_font_de_la_generation_d_image_par_ia_",
      "title": "DALL-E V2 -  un robot et un peintre font de la génération d'image par IA ",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "olivier_mertens"
      ],
      "slot": "day-1-conference-3",
      "room": "Jules Verne",
      "openfeedbackId": 28,
      "abstract": "### Cela commence comme une histoire drôle \n\nEn lisant le titre on peut se dire que les  moustaches se frisent ( quoi tu connais pas *Dali* ? ) \nQu'a pu inventer ce cher petit robot ramasseur ? a -t'il vu un astronaute chevaucher un cheval blanc dans l'espace ?\n\n*DALL-E*  **v2** est une technologie *open AI* où l'on peut d'une simple phrase ( en natural language ) :\n- créer une image à la volée avec des éléments générés\n- éditer une photo existante avec des éléments supplémentaires ou la modifier selon votre demande \n- faire des variations d'une image à la volée suivant son bon vouloir\n\nUne chose est sûre avec DALL-E votre imagination débordante peut se lâcher ! \n\n### Au revoir GIMP , Photoshop et les créatifs ?\n\nSous cet aspect fun, cet outil permet de comprendre comment l'IA interprète et analyse nos demandes.\n\nEn démontrant ses capacités, son fonctionnement et réfléchir à des possibles usages pour celle-ci.\n\nPar exemple comment son modèle utilise des biais imposés, gère les stéréotypes éventuels et ses hypothèses de compréhension par rapport à sa technique d'apprentissage.\n\nEt pour alimenter le petit rabot facétieux, on générera un tas d'image suivant avec des phrases aléatoires.\n"
    },
    {
      "key": "dates_et_heures_a_l_horizon___fuyez__ou_venez_decouvrir_tous_les_pieges_qu_elles_vous_tendent",
      "title": "Dates et Heures à l'horizon ? Fuyez… ou venez découvrir tous les pièges qu'elles vous tendent",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "arnaud_pichery"
      ],
      "slot": "day-2-conference-2",
      "room": "Tour de Bretagne",
      "openfeedbackId": 34,
      "abstract": "Ajouter 24h à une date, rien de plus simple... ou pas! Saviez-vous qu'en 1850 à 13h à Lyon… il était 13h09:58 à Paris ? Ou que si vous étiez monté dans l'Orient-Express le 1er janvier 1900 à Paris, vous seriez arrivé à Bucarest le 23 décembre 1899! \n\nAlors, pour vous éviter d'être d'astreinte dans la nuit du 18 au 19 janvier 2038, je vous propose un petit voyage au pays des dates et heures. \n\nNous commencerons ce voyage par une présentation des principaux protagonistes: dates, heures, instants, fuseaux horaires, secondes intercalaires et DST avec ces journées qui font 23h ou 25h… et comment notre notion actuelle du temps s'est mise en place au cours des derniers siècles.\n\nNous continuerons par un tour d'horizon des différents types et formats que l'on a créé pour stocker et manipuler les dates. Spoiler alert: certains ingénieur(e)s ont été créatif !\n\nNous regarderons ensuite les pièges classiques que vous pourrez rencontrer, cachés dans une spec ou dans le code de votre collègue, et comment certaines librairies et bonnes pratiques pourront vous aider à les éviter.\n"
    },
    {
      "key": "de_la_terre_a_la_lune__et_au_dela__avec_nestjs",
      "title": "De la Terre à la Lune (et au-delà) avec NestJS",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "languages"
      ],
      "complexity": "Beginner",
      "speakers": [
        "nicolas_berthaud",
        "olivier_dangreaux",
        "olivier_thierry"
      ],
      "slot": "day-1-codelab-1",
      "room": "L'Atelier",
      "openfeedbackId": 19,
      "abstract": "Un backend javascript avec un framework moderne, efficient et performant ? NestJS est là pour vous emmener vers les étoiles !\n\nNestJS est un framework Node.js s'appuyant au choix sur Express ou Fastify. Pourquoi ne pas utiliser directement ces derniers ? Tout simplement parce que NestJS intègre les paradigmes des frameworks de référence du marché (Spring pour Java, Django pour Python ou encore Laravel pour PHP) pour faciliter la vie du développeur et lui permettre de développer rapidement des API bien conçues et plus fiables.\n\nDurant ce codelab vous aurez sous vos doigts tous les outils pour satelliser vos API aussi bien que Jules Verne a lancé sa fusée vers la lune. En créant une API de réservation de voyages spatiaux vous découvrirez l'approche MVC  structurée en modules de NestJS inspirée d'Angular.  Nous coderons en TypeScript une API REST sécurisée s'appuyant sur le puissant TypeORM, en utilisant des \"decorators\", l'injection de dépendances et autres \"guards\" ... Enfin, nous fiabiliserons notre API au travers de tests unitaires Jest.\n\nNestJS, vers l'infini et au-delà !\n\nPrérequis : Node.js installé sur votre machine (en version LTS de préférence), VS Code (ou n'importe quel éditeur de code). Des connaissances de base de Javascript. Suivez nous sur les réseaux sociaux où nous partagerons le repository Github que vous pourrez cloner avant le codelab."
    },
    {
      "key": "decouvrez_le_bon_html_et_economisez_du_js_et_du_css",
      "title": "Découvrez « le bon HTML » et économisez du JS et du CSS",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "gael_poupard"
      ],
      "slot": "day-2-conference-4",
      "room": "Titan",
      "openfeedbackId": 38,
      "abstract": "Si vous utilisez une tartine de JavaScript pour implémenter un bloc dépliant, une fenêtre modale ou de la suggestion dans un champ de formulaire : ce sujet est fait pour vous ! \n\nVenez découvrir des éléments et attributs HTML modernes, et leurs utilisations avancées — pour respecter le principe de moindre pouvoir et adopter l’amélioration progressive comme approche préférentielle.\n\nGardez votre JavaScript pour les grandes occasions, HTML s’occupe de tout !\n"
    },
    {
      "key": "des_cloud_events_partout__",
      "title": "Des Cloud Events partout !",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "loic_mathieu"
      ],
      "slot": "day-2-conference-1",
      "room": "Belem",
      "openfeedbackId": 10,
      "abstract": "Cloud Events est une spécification d’événement standard pour le cloud. Elle permet de faciliter l'implémentation d'application inter-opérable dans le cloud, en étant agnostique du cloud provider et de la technologie.\n\nAprès une courte introduction sur ce que sont les Cloud Events, je vais vous monter dans une session de live coding comment utiliser les Cloud Events dans une fonction Google Cloud, puis dans une API REST, et enfin dans un composant messaging Kafka. \n\nLe tout en Java avec Quarkus naturellement ;) !"
    },
    {
      "key": "designers_x_developers___ca_match____ou_ca_match_____",
      "title": "Designers x Developers : Ça match 💙 ou ça match 🥊 ?",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "ux_ui"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "sabrina_vigil",
        "simon_leclercq"
      ],
      "slot": "day-2-conference-4",
      "room": "Tour de Bretagne",
      "openfeedbackId": 4,
      "abstract": "Culture, langage, outils... Entre designers & developers, pas toujours simple d’être du même côté du ring ! À l’heure de l’expérience utilisateur et de la scalabilité, Sabrina & Simon du Design System de Decathlon vous attendent aux vestiaires pour débriefer et préparer le prochain match !\nAnalyse tactique, définition du plan de jeu, vérification de l’équipement. \nOn chausse. Gong 🔔 ! Et c’est parti !"
    },
    {
      "key": "devenir_streamer_serieux____t_es_serieux__",
      "title": "Devenir streamer sérieux !? T'es sérieux ?",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "olivier_perez"
      ],
      "slot": "day-2-conference-5",
      "room": "Belem",
      "openfeedbackId": 67,
      "abstract": "Partager votre passion vous anime, mais avez-vous votre place à côté de vos streamers favoris ? Ces dernières années nous ont révélé que oui ! Il n'est plus nécessaire d'être un gamer pour réussir sur Twitch.\n\nCependant le streaming est une discipline qui a ses propres règles !\n\nComment s'y prendre, les bons reflèxes, les dangers à éviter ? J'aimerai partager avec vous 2 années d'expérience de streaming pour vous offrir une rampe de lancement aussi efficace que celle d'un Starship et vous aider à retomber sur vos pattes."
    },
    {
      "key": "devsecops___de_la_securite_dans_mon_devops",
      "title": "DevSecOps : de la sécurité dans mon DevOps",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "security"
      ],
      "complexity": "Beginner",
      "speakers": [
        "adrien_pessu",
        "tugdual_grall"
      ],
      "slot": "day-1-conference-2",
      "room": "Belem",
      "openfeedbackId": 7,
      "abstract": "De plus en plus d'équipes mettent en place les principes du DevOps avec comme objectif de déployer plus fréquemment en production. Ces principes amènent les Dev et Ops à travailler ensemble avec les mêmes outils et méthodes.\n\nIl est maintenant standard d’avoir les builds, tests, et déploiements automatisés, mais qu’en est-il de la sécurité?\n\nLa “sécurité des applications” est au mieux quelque chose qui arrive trop tard, ou le plus souvent inexistante. Les raisons mises en avant sont la complexité, l’impact sur la productivité qui ralentissent les déploiements; et on se dit aussi que les attaques n'arrivent qu'aux autres.\n\nIl est temps d’appliquer les principes du DevOps à la sécurité, c’est ce que promet le DevSecOps! \n\nAvec le DevOps, et sans être un expert système, vous arrivez à coder votre infrastructure (Terraform, YAML, Kubernetes, Serverless, …). Avec le DevSecOps, vous allez déployer vos applications tout en  vous assurant de la sécurité de votre code.\n\nDurant cette présentation, qui s’appuie sur des retours d'expérience et de nombreuses démonstrations, vous verrez qu’il est possible d’intégrer la sécurité au cycle du développement sans impacter la productivité."
    },
    {
      "key": "documentons_l_accessibilite_en_phase_de_design_",
      "title": "Documentons l’accessibilité en phase de design ",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "ux_ui"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "stephanie_walter"
      ],
      "slot": "day-1-conference-4",
      "room": "Titan",
      "openfeedbackId": 31,
      "abstract": "Les besoins en termes d’accessibilité sont, aujourd’hui encore, pris en compte après coup, en fin de projet. Et très mal documentés. Voir carrément pas du tout pris en compte et oubliés des maquettes livrées aux équipes de développement. Pourquoi réparer plus tard, ce qu’on pourrait construire correctement dès le début ? Une bonne documentation aide les équipes à implémenter les besoins d’accessibilité de la bonne manière, dès le départ. Nous verrons pourquoi et comment les designers peuvent documenter l’accessibilité et les interactions utilisateurs"
    },
    {
      "key": "drame_dans_les_r",
      "title": "Drame dans les R",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "charline_charrier",
        "nicolas_greffard"
      ],
      "slot": "day-1-quickie-2",
      "room": "Belem",
      "openfeedbackId": 27,
      "abstract": "Au moment de démarrer un nouveau projet IA révolutionnaire, un inconnu très agile se précipite dans l'équipe du narrateur et l'oblige à changer son approche pour s'élever plus haut et plus loin que ce qu'il escomptait. L'intrus et le narrateur profitent du projet pour échanger sur leurs préjugés, façons de faire et retour d'expériences des plus légers que l'R.\nAu cours de ce récit, Charline, Scrum Master, et Nicolas, Data Scientist, exploreront les difficultés, de prime abord, d'avoir une approche agile sur un projet d'IA et ils feront un REX sur la façon dont ils travaillent ensemble depuis deux ans. L'agilité dans l'IA, python y croire ? Et si en fait, agilité et IA avaient des philosophies plus proches qu'on ne le pense ?"
    },
    {
      "key": "entiers__virgules_flottantes_ou_representations_exotiques___parlons_d_elegance_",
      "title": "Entiers, virgules flottantes ou représentations exotiques : parlons d'élégance ",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "fabien_tregan",
        "olivier_poncet"
      ],
      "slot": "day-1-conference-1",
      "room": "Belem",
      "openfeedbackId": 63,
      "abstract": "Manipuler des nombres dans notre code est un problème à peu près résolu et auquel nous n'accordons plus beaucoup d'importance. Et pourtant ! Prendre le temps de se pencher un peu sur les bases se révèle parfois très intéressant.\n\nNous vous proposons de revenir sur ce que signifie « représenter un nombre », pourquoi et comment nous faisons souvent des maths plus ou moins fausses, des concessions et avec plus ou moins de rigueur ou d'astuce selon que nous traitons du bancaire ou du jeu vidéo. Nous parlerons de solutions utilisées sur les cartes graphiques d'aujourd'hui mais aussi d'autres un peu oubliées telles que les nombres à virgule fixe ou les compteurs polynomiaux ... et de pourquoi un RotoZoom sur 486, c'était mathématiquement faux et beau à la fois."
    },
    {
      "key": "entreprise_agile_et_sans_chef___l_atelier",
      "title": "Entreprise agile et sans chef : l'atelier",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "benjamin_casseron",
        "cecile_staehle",
        "godefroy"
      ],
      "slot": "day-1-codelab-2",
      "room": "L'Atelier",
      "openfeedbackId": 69,
      "abstract": "Recrutement, investissement, choix d’un prestataire, attribution des tâches, licenciement : découvrez comment embarquer les équipes (tech/support/produit/etc.) dans la vie d'une entreprise collaborative, en gouvernance partagée."
    },
    {
      "key": "et_si_les_meilleurs_dockerfile_etaient_ceux_que_l_on_n_ecrit_pas",
      "title": "Et si les meilleurs Dockerfile étaient ceux que l'on n'écrit pas",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "fabien_martin"
      ],
      "slot": "day-2-quickie-1",
      "room": "Belem",
      "openfeedbackId": 0,
      "abstract": "Une manière assez commune de construire une image aujourd'hui consiste à écrire un Dockerfile.\nL'écriture d'un bon Dockerfile n'est pas simple, il faut sélectionner une image de base, mettre en place un ensemble de bonnes pratiques autour de la sécurité, de la maintenabilité, de la performance etc.\nMais ce n'est pas tout, il va aussi falloir le maintenir dans le temps !\n\nLa CNCF propose une spécification, les Cloud Native Buildpacks, qui vise à transformer notre code source en une image pouvant tourner sur n'importe quel cloud.\nJe vous propose durant ce talk une rapide présentation des Cloud Native Buildpacks, suivi d'une mise en oeuvre pratique avec la création et la mise à jour d'une image... sans Dockerfile !\n"
    },
    {
      "key": "feminisation_de_la_filiere_numerique___cassons_les_codes__",
      "title": "Féminisation de la filière numérique : cassons les codes !",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "arthur_tarroux",
        "melissa_cottin",
        "stephanie_vachon"
      ],
      "slot": "day-1-codelab-3",
      "room": "L'Atelier",
      "openfeedbackId": 49,
      "abstract": "Le constat est assez simple : les métiers du numérique recrutent, les besoins en compétences ne cessent de grandir, les opportunités d’emplois sont aujourd'hui bien réelles. Pourtant, les femmes restent encore sous-représentées dans ce secteur porteur : seulement 27 % de femmes travaillent aujourd’hui dans le numérique. Ce chiffre tombe à 15 % environ dans les métiers de l’informatique. \n\nMalgré les efforts engagés pour réduire les écarts, les effets tardent à se faire ressentir et les chiffres n’évoluent pas assez rapidement. \nAutocensure, stéréotypes, image du geek, méconnaissance du secteur... les freins sont encore bien présents.\n\nComment rendre la filière attractive pour les femmes ? Comment s'engager individuellement ? Par où commencer ?\n\nL'association ESTIMnumérique vous propose un atelier collaboratif en 4 étapes :\n- Questionner l'existant, \n- Changer de regard sur ses pratiques professionnelles,\n- Echanger ses retours d'expériences et/ou ses bonnes pratiques,\n- Identifier collectivement les solutions concrètes pour favoriser la mixité dans le numérique.\n\nCet atelier sera animé par Mélissa Cottin, directrice ESTIMnumérique, Arthur Tarroux, chargé de mission mixité au sein de l'association, et Stéphanie Vachon, co-fondatrice de Nantes Numérique Responsable.\n\nCet atelier s'adresse à toutes et à tous. Places limitées : 40 personnes (travaux en groupe)."
    },
    {
      "key": "franceconnect_pour_authentifier_vos_utilisateurs__",
      "title": "FranceConnect pour authentifier vos utilisateurs ?",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "david_batiot",
        "sophie_luzin"
      ],
      "slot": "day-2-quickie-1",
      "room": "Tour de Bretagne",
      "openfeedbackId": 14,
      "abstract": "Vous avez tous utilisé FranceConnect pour vos démarches administratives.  \nDepuis 2020, nous le proposons pour s’authentifier sur notre espace assuré cbp4you.fr.\n\nPourquoi une société privée a-t-elle voulu utiliser FranceConnect ?  \nQuelle est la différence avec les providers OpenID Connect des GAFAM ?  \nComment réconcilier les données FranceConnect dans son écosystème ?  \nNous vous partagerons ce retour d’expérience et celui de nos utilisateurs.\n"
    },
    {
      "key": "fresque_du_numerique",
      "title": "Fresque du Numérique",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "franck_pr",
        "sophie_n_goma"
      ],
      "slot": "day-2-codelab-1-long",
      "room": "L'Atelier",
      "openfeedbackId": 18,
      "abstract": "La Fresque du Numérique est un atelier ludique et collaboratif de 3 heures avec une pédagogie similaire à celle de La Fresque du Climat. Le but de ce \"serious game\" est de sensibiliser et former les participant·e·s aux enjeux environnementaux du numérique.\n\nL'atelier vise aussi à expliquer les grandes lignes des actions à mettre en place pour évoluer vers un numérique plus soutenable, puis à ouvrir des discussions entre les participant·e·s sur le sujet."
    },
    {
      "key": "fuzz_testing_made_easy",
      "title": "Fuzz Testing Made Easy",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "languages"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "katie_hockman"
      ],
      "slot": "day-1-conference-3",
      "room": "Titan",
      "openfeedbackId": 70,
      "abstract": "Go now supports fuzz testing natively as of Go 1.18, a tool that can be used to identify bugs and security vulnerabilities in your code. This talk will discuss how and why fuzzing can be used in Go, introduce differential fuzzing,\nand describe the mechanics of how fuzzing works under the hood. This talk will include a live code demo of a bug being found, fixed, and tested in real time using fuzzing."
    },
    {
      "key": "grid_dungeon_master",
      "title": "Grid Dungeon Master",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "web"
      ],
      "complexity": "Advanced",
      "speakers": [
        "raphael_goetter"
      ],
      "slot": "day-2-codelab-1",
      "room": "Les Machines",
      "openfeedbackId": 60,
      "abstract": "Ingrid, cheffe aventurière en CSS Grid Layout, vous emmène avec elle explorer le Grid Dungeon Master. Différents paliers d'exercices et de quiz vous attendent jusqu'au niveau du trésor final qu'il faudra récupérer à grand coup de lignes de code CSS.\n\nSeul·e·s les braves qui connaissent déjà Grid Layout (et qui disposent d'un ordinateur portable) auront une chance de revenir de cette aventure couvert·e·s de gloire."
    },
    {
      "key": "how_openai_codex_learned_to_write_and_refactor_javascript____",
      "title": "How OpenAI Codex learned to write and refactor JavaScript !?!",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "_gerardsans________"
      ],
      "slot": "day-2-conference-1",
      "room": "Jules Verne",
      "openfeedbackId": 57,
      "abstract": "As a JavaScript developer, the struggle is real. So, how is it possible that an AI learned how to write and refactor code? In this talk, I'll look at what milestones allowed openAI, a company in SF founded by Elon Musk, to achieve such incredible results. The current progress and future of AI are truly exciting!"
    },
    {
      "key": "kanye_west__maths_and_signals___how_to_clone_shazam___",
      "title": "Kanye West, Maths and Signals ! How to clone Shazam 🎧",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "moustapha_agack"
      ],
      "slot": "day-1-conference-1",
      "room": "Tour de Bretagne",
      "openfeedbackId": 48,
      "abstract": "J’ai toujours rêver de comprendre comment  fonctionnait Shazam.\n\nCette application qui permet de retrouver l’artiste et le titre d’une chanson juste avec un enregistrement de quelques secondes.\nDu coup j’ai décider de la re-coder ! Je vous montre tout cela pendant ce talk,  et ce sera l’occasion de parler notes musicales, harmoniques, fréquences, signaux, et de transformée de fourrier (et de Kanye West) pour recréer l’algorithme qui fait tourner le moteur Shazam  ⚡️\n\n\n\n\n\n\n\nComment cloner Shazam !  L'application qui permet de retrouver l'artiste et le titre d'une chanson juste avec un enregistrement de quelques secondes.\n\nOn va parler notes musicales, harmoniques, fréquences, signaux,  et transformation de fourrier (et de Kanye West) pour recréer l'algorithme qui fait tourner le moteur Shazam  ⚡️"
    },
    {
      "key": "l_accessibilite__c_est_pas_sorcier__",
      "title": "L'accessibilité, c'est pas sorcier !",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "mobile_iot"
      ],
      "complexity": "Beginner",
      "speakers": [
        "fanny_demey_pluvinage",
        "gerard_paligot"
      ],
      "slot": "day-2-conference-2",
      "room": "Belem",
      "openfeedbackId": 30,
      "abstract": "Le handicap est l'affaire de tous. Il existe sous différentes formes et touche près d'une personne sur cinq.  Pourtant la plupart des applications mobiles que l'on retrouve sur les stores sont inaccessibles.\nFanny (alias Jamy), spécialiste de l'accessibilité, et Gérard (alias Fred), vrai touche à tout, vous invite à bord de leur camion laboratoire pour expérimenter les problématiques d'accessibilité mobile les plus courantes et surtout apprendre ensemble à les résoudre sur Android avec Jetpack Compose. \n\nDémonstration, mise en situation, live coding sont au programme.\n\nAllez Marcel, en route ! 🚚\n\n*Voix off : Cette emission s'adresse aux développeurs et développeuses Android bien sûr mais également à toute personne curieuse de découvrir comment  utiliser un smartphone quand on est aveugle.*"
    },
    {
      "key": "la_programmation_dynamique_pour_sauver_jules_verne",
      "title": "La programmation dynamique pour sauver Jules Verne",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "eleouet_gaetan"
      ],
      "slot": "day-1-conference-5",
      "room": "Tour de Bretagne",
      "openfeedbackId": 40,
      "abstract": "Rien n'a voir avec la programmation orientée objet ou la programmation fonctionnelle, la programmation dynamique est une famille d'algorithme.\n\nDe la terre à la lune ont été cartographiée des micro-météorites, la carte présente dans un quadrillage, la terre en bas à gauche et la lune en haut en droite, l'obus se dirige au plus court, soit vers le haut, soit vers la droite. Quel est le plus petit nombre de météorites que l'on risque de rencontrer ?\n\nLe nautilus descend vers les profondeurs, à chaque minutes, le capitaine Nemo peut changer son allure, pour descendre 1, 2 ou 3 lieu. De combien de façons différentes peut-il descendre jusqu'à 20000 lieux ?\n\nPour fêter Jules Verne, je souhaitais disposer ses livres sur des grandes tables. Les livres sont identiques de tous les côtés et font 10cm par 20cm, les tables sont disposées en un grand rectangle de 1m par 20m, de combien de façons possibles puis-je disposer mes livres ?\n\nSi cela t'intéresse de résoudre ces problèmes, et même mieux de comprendre ce qui se cache derrière la programmation dynamique, cette conférence est faite pour toi"
    },
    {
      "key": "le_cote_obscur_du_shadow_dom",
      "title": "Le côté obscur du Shadow DOM",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "adrien_bordone"
      ],
      "slot": "day-1-quickie-1",
      "room": "Tour de Bretagne",
      "openfeedbackId": 29,
      "abstract": "Tu as déjà essayé de mettre en place du shadowDom ? C’est super, ça permet d’isoler ton CSS du reste de l’application. Mais au moment où tout te semble parfait, tout s’écroule comme un château de cartes.\n\nUne couleur qui n’est pas la bonne, des marges qui se comportent bizarrement, une police qui ne fonctionne pas.\n\nDans ce quickie nous allons découvrir ensemble pourquoi ces comportements se produisent et comment y faire face.\n"
    },
    {
      "key": "le_futur_de_la_medecine_sera_open_source",
      "title": "Le futur de la médecine sera open source",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "david_sferruzza"
      ],
      "slot": "day-2-quickie-1",
      "room": "Jules Verne",
      "openfeedbackId": 44,
      "abstract": "Pendant la crise du COVID, un collectif d'ingénieurs crée le respirateur artificiel MakAir. La particularité de ce projet ? Être parti de rien pour arriver à des essais cliniques en quelques mois seulement. Une des principales raisons qui rend ça possible est l'open source. Dans cette présentation nous utiliserons l'aventure MakAir pour montrer à quel point il peut être décisif de changer nos méthodes de travail en s'inspirant des méthodes de l'open source et pourquoi c'est important pour le futur de la médecine."
    },
    {
      "key": "le_gitops_dont_vous_etes_le_heros",
      "title": "Le GitOps dont vous êtes le héros",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "louis_tournayre"
      ],
      "slot": "day-1-conference-4",
      "room": "Belem",
      "openfeedbackId": 5,
      "abstract": "Dans le vaste royaume de Kubernetes, notre application est en péril. Les bugs et les besoins utilisateurs non couverts sont en train d’épuiser la patience du métier. Les correctifs et nouvelles fonctionnalités seront-ils déployés à temps pour sauver l’Application ? Si le processus de livraison ne s’améliore pas, les utilisateurs vont déserter l’Application et ce sera sa fin.\n\nÀ vous, public, de devenir le héros qui va sauver l’Application en embrassant la voie du GitOps.\n\nCette ~~présentation~~ aventure sera interactive ! Vos choix vous permettront d’arriver ou pas en production dans les temps. Dans ce premier tome de cette saga, vous allez apprendre ce qu’est GitOps, vous choisirez votre solution et la mettrez en œuvre. Préparez-vous à des démonstrations basées sur vos choix, vous apprendrez de vos erreurs comme de vos succès, et peut être arriverez vous à temps en production.  \n___\n*4ème de couverture :  \nCette conférence est destinée aux aventuriers de tous niveaux, curieux de découvrir l’approche GitOps qui traite de l'automatisation et du \"versionnement\" des déploiements des applications.  \nLe seul prérequis est l’envie d’apprendre en s’amusant. Quelques bases sur kubernetes peuvent aider mais ce n'est pas essentiel.*"
    },
    {
      "key": "le_voyage_d_un_petit_modele_dans_le_pays_du_mlops",
      "title": "Le voyage d’un petit modèle dans le pays du MLOps",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "thibaud_le_gall",
        "yulianna_khorolich"
      ],
      "slot": "day-2-codelab-1",
      "room": "Hangar",
      "openfeedbackId": 42,
      "abstract": "Le développement d’un modèle est terminé et la clé USB contenant le notebook Jupiter est remise au Team Leader. L’aventure du modèle ne doit pas s'arrêter là.\n\nNous vous invitons à un voyage ordinaire dans le MLOps. Une épopée quotidienne du travail menant d'un modèle tout frais sortis des cerveaux potentiellement géniaux de vos data scientists vers une fonctionnalité utilisable !\n\nVenez vivre les tribulations de l'industrialisation du machine learning, au cours desquelles nous affronterons les affres de la reproductibilité, nous surmonterons les difficultés du monitoring jusqu'à nous repaitre du succès de notre première mise en production.\n\nLors de cette expédition, nous serons accompagnés par notre fidèle compagnon, VertexAI, dont nous exploiterons la capacité à faciliter notre parcours pour le déploiement, afin de nous recentrer sur l'intégration.\n\nLes évènements et faits de cette histoire sont réels, toute ressemblance avec la réalité est purement intentionnelle."
    },
    {
      "key": "liberez__delivrez__webassembly_du_navigateur_____avec_wasi",
      "title": "Libérez, délivrez  WebAssembly du navigateur ... Avec WASI",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "philippe_charriere"
      ],
      "slot": "day-2-conference-5",
      "room": "Tour de Bretagne",
      "openfeedbackId": 22,
      "abstract": "Vous avez les paroles ?  Désolé 😉\n\nOn a commencé à entendre parler de WebAssembly aux alentours de 2015 (une sorte de bytecode optimisé qui peut s'exécuter dans un navigateur pour apporter des supers pouvoirs à JavaScript - Et vous pouvez coder ça avec du Rust, Go, Swift, ...). L'intégration de Wasm (le petit nom de WebAssembly) avec la VM JavaScript est plutôt complète (on peut déjà faire de belles choses et les mettre en production). Rapidement (plus ou moins) il est apparu que Wasm présentait de l'intérêt pour d'autres cas d'usages (FaaS, UDF, plugins, ...). Donc en 2019, c'est la naissance de la spécification WASI : WebAssembly System Interface, ou comment \"exécuter du Wasm\" en dehors d'un navigateur.\n\nCe talk comportera 2 parties:\n\n- Une \"petite\" partie : une introduction à WASI avec ses qualités et ses faiblesses, les perspectives\n- Une \"plus grosse partie\" :  des démonstrations avec différents langages (Rust, Go, C#, AssemblyScript, Swift, ...) et différents outils pour par exemple faire des services Wasm (Suborbital, Spin, ...)  et une CLI en Go avec des plugins Wasm.\n\nL'objectif est de vous donner tous les éléments nécessaires pour vous y mettre par vous même. Je fournirais donc tous les environnements avec les toolchains préinstallées utilisable dans Gitpod mais aussi Docker avec VSCode.\n\n\n\n\n\n"
    },
    {
      "key": "managing_data_and_resources_in_your_progressive_web_app_like_a_pro",
      "title": "Managing data and resources in your Progressive Web App like a pro",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "laura_morinigo"
      ],
      "slot": "day-2-conference-2",
      "room": "Jules Verne",
      "openfeedbackId": 50,
      "abstract": "Creating a web app means that we will use different resources like assets, fonts, and some other interface elements. The challenge relies on managing those resources to load fast and be available offline. PWAs use modern capabilities to target this problem and of course, make sure to deliver a good user experience. During this talk, we will learn about client-side storage solutions, cache strategies, and what it means to have an offline-ready web app so you can choose wisely from these strategies like a pro!"
    },
    {
      "key": "motional_intelligence__how_animation_brings_product_to_life",
      "title": "Motional Intelligence: How Animation Brings Product to Life",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "ux_ui"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "cyril_mottier"
      ],
      "slot": "day-1-quickie-2",
      "room": "Jules Verne",
      "openfeedbackId": 37,
      "abstract": "Gone are the days when animations used to simply add flair to a design. Today, animation plays a key role in bringing an extra layer of information and adding personality to your brand.\n\nIn this talk we will focus on how motion guides your users, keeps them focused on what’s important, educates them about information hierarchy, guides their focus through experience, and adds delight to your product. Said differently, tune in to learn how animation can bring your product to life 🧟‍♂️."
    },
    {
      "key": "my_life_as_blind_web_user",
      "title": "My Life as blind web user",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "ronan_robe"
      ],
      "slot": "day-1-codelab-1",
      "room": "Les Machines",
      "openfeedbackId": 9,
      "abstract": "Atelier mené avec l'ACIAH pour être en immersion dans le quotidien d'un malvoyant face au numérique.\nMuni d'un bandeau pour cacher les yeux des participants et de casques audio, nous inviterons les participants à réaliser des choses simples du quotidien : envoyer un email, lire un article dans la presse, naviguer sur le site web du devfest :)\nAprès l'atelier, aucun doute qu'ils regarderont les balises HTML aria sous un autre angle"
    },
    {
      "key": "oh_crab___my_watch_speaks_rust___",
      "title": "Oh crab ! My watch speaks Rust 🦀",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "mobile_iot"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "pierre_yves_aillet"
      ],
      "slot": "day-1-conference-5",
      "room": "Belem",
      "openfeedbackId": 43,
      "abstract": "Lorsqu'on parle d'IoT, on a tous à l'esprit l'Arduino, les puces WiFi ESP...\nEt en général, on les programmes en hybride C/C++.\n\nPar nostalgie, j'aime beaucoup le C, mais je me suis demandé si on ne pouvait pas utiliser des langages plus modernes...\n\nLors de ce talk je vous présenterai ma découverte de la T-Watch 2020 et mes tentatives pour la programmer en Rust.\nCe sera aussi l'occasion de découvrir l'éco-système Rust existant autour de l'embarqué et les avantages qu'apporte le langage dans ce contexte particulier.\n\n"
    },
    {
      "key": "plongez_dans_le_monde_fantastique_de_jules_verne_grace_a_un_peu_d_ar_et_beaucoup_d_imagination___",
      "title": "Plongez dans le monde fantastique de Jules Verne grâce à un peu d’AR et beaucoup d’imagination 📖",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "mobile_iot"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "julian_clemot",
        "yannick_jacqueline"
      ],
      "slot": "day-1-quickie-1",
      "room": "Titan",
      "openfeedbackId": 25,
      "abstract": "Et s’il était possible de donner vie aux personnages de l’univers futuriste de Jules Verne ? \nQuoi de mieux pour présenter un livre à nos enfants que de réussir à l’illustrer pour le rendre interactif ?\nNous avons voulu mettre en image ses plus beaux romans afin de pouvoir captiver les petits comme les plus grands lorsque l’heure de “l’histoire du soir” a sonné.\n\nPour relever ce défi, nous avons utilisé les dernières technos mobiles :\n- Jetpack Compose pour l’UI ;\n- CameraX pour l’utilisation de l’appareil photo ;\n- ML Kit pour l’OCR ;\n- ARCore pour la partie réalité augmentée.\n\nL’objectif de ce talk est de vous montrer comment nous avons utilisé ces technologies pour essayer d’imager certains romans afin de rendre leur lecture plus ludique."
    },
    {
      "key": "pourquoi_l_ux_writing_doit_etre_integre_des_la_phase_de_conception",
      "title": "Pourquoi l'UX Writing doit être intégré dès la phase de conception",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "ux_ui"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "jozan_aurelie"
      ],
      "slot": "day-2-quickie-1",
      "room": "Titan",
      "openfeedbackId": 39,
      "abstract": "Le contenu, les mots sont bien souvent réfléchis une fois les wireframes posés. Pourtant, le contenu fait partie intégrante de l'expérience. L'UX Writing permet de concevoir les mots qui seront clairs, efficients et utiles à l'utilisateur pour atteindre son objectif.\n\nEt si on intégrait la réflexion autour des mots dès le début d'un projet pour concevoir des parcours qui \"parlent\" aux utilisateurs ?"
    },
    {
      "key": "public_speaking__it_s_for_you_",
      "title": "Public Speaking? It’s for you!",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "frederic_harper"
      ],
      "slot": "day-2-conference-4",
      "room": "Jules Verne",
      "openfeedbackId": 16,
      "abstract": "Do you have a passion? Do you like to share with others? Public speaking can help you share this passion with others  in your industry and help them  find success. But let's be honest: you'll get a lot out of it too. You'll learn from attendees, grow your network, get visibility, and much more in return for your efforts. Let's explore how you can start getting comfortable with public speaking and how you can find opportunities to reach the perfect audience. Who knows, you could be the one speaking on this stage next time!"
    },
    {
      "key": "qwik__rapidement",
      "title": "Qwik, rapidement",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "benjamin_legrand"
      ],
      "slot": "day-2-quickie-2",
      "room": "Jules Verne",
      "openfeedbackId": 13,
      "abstract": "Qwik, par le créateur d'angular, est un nouveau venu dans la jungle des frameworks javascript\n\nSes performances sont très impressionnantes, car il fait le pari de miser sur le HTML d'abord.\n\nDans ce qwikie  ;) , on verra pourquoi ca fonctionne, et comment. \n\nEt est ce que Qwik est au niveau de ses concurrents ?\n\n"
    },
    {
      "key": "sea_to_sky__building_resilient_applications_on_google_cloud_s_fiber_optic_network",
      "title": "Sea to Sky: Building resilient applications on Google Cloud's fiber optic network",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "stephanie_wong"
      ],
      "slot": "day-1-conference-2",
      "room": "Jules Verne",
      "openfeedbackId": 33,
      "abstract": "Some of you might be surprised to know that the Cloud isn't in the sky, it's undersea. Google Cloud is underpinned by fiber optic cables that criss-cross the globe to create one of the most advanced networks supporting failover, redundancy, and a highly performant virtualized network. Join Stephanie Wong on a journey to the bottom of the ocean and up into the sky as she discusses Google's physical network infrastructure, the technology that support Google Cloud's virtual private cloud, and the new world of service-oriented networking in the cloud. She'll dig into the inner workings of Google's decades of subsea and terrestrial cable designs, the network topology they've built to withstand failures, and how you can build resilient applications in the cloud as a result. "
    },
    {
      "key": "serverless___eviter_le_vendor_locking_en_construisant_sa_propre_plateforme_faas_grace_a_openfaas_et_kubernetes",
      "title": "Serverless : Éviter le vendor locking en construisant sa propre plateforme FaaS grâce à OpenFaaS et Kubernetes",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Advanced",
      "speakers": [
        "katia_himeur"
      ],
      "slot": "day-1-codelab-3",
      "room": "Hangar",
      "openfeedbackId": 55,
      "abstract": "Le serverless permet d’exécuter des applications sans avoir à gérer de serveurs. Le “Function as a Service” ou FaaS est un modèle d’exécution qui consiste à considérer ses applications comme des fonctions dans un environnement serverless. \n\nLes offres managées FaaS font parties des services de base que proposent la grande majorité des fournisseurs cloud. D’un fournisseur à un autre, la manière d’utiliser ces services est différente, augmentant le vendor locking.\n\nAu travers cet atelier, nous allons voir comment il est possible de créer sa propre plateforme FaaS dans Kubernetes avec OpenFaaS. Favorisant ainsi la réversibilité et facilitant les tests dès le poste du développeur."
    },
    {
      "key": "service_mesh_workshop_with_istio",
      "title": "Service Mesh Workshop with Istio",
      "language": "English",
      "talkType": "codelab",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "abdellfetah_sghiouar"
      ],
      "slot": "day-2-codelab-2",
      "room": "L'Atelier",
      "openfeedbackId": 17,
      "abstract": "Service Mesh is becoming a key component in Cloud Native world. It allows dev and Ops teams to connect, secure, and observe applications without mixing business logic with infrastructure concerns. This way teams can focus on delivering value, letting the mesh does all the complex non-functional work like service discovery, load balancing, encryption, authentication, authorization, support for the circuit breaker pattern, and other capabilities. Istio is one of the major Open Source Service Mesh options available today. In this workshop, you will have an opportunity to deploy and try some of the key concepts of Istio. We will provide you with a Cloud Environment and all the tools and guidance needed to get your hands dirty with Istio\n\n"
    },
    {
      "key": "simple_jstures_can_go_a_long_way",
      "title": "Simple JStures can go a long way",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "charlie_gerard"
      ],
      "slot": "day-1-conference-1",
      "room": "Jules Verne",
      "openfeedbackId": 66,
      "abstract": "When talking about devices that use motion detection, what usually comes to mind is sensors that trigger lights or alarms but rarely anything more than that. However, the human body can execute a lot more complex gestures that are not detected by these systems.\nWhat if I told you, you could build interactive applications using personalized motion detection in a few lines of JavaScript code?! In this talk, I’ll show you how building such a system doesn’t have to be as complicated as it sounds!\n"
    },
    {
      "key": "suistesabeilles",
      "title": "SuisTesAbeilles",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "guillaume_petra"
      ],
      "slot": "day-2-quickie-2",
      "room": "Tour de Bretagne",
      "openfeedbackId": 12,
      "abstract": "Etant moitié dans le monde numérique, moitié dans le monde des abeilles, il fallait bien que l'un déborde sur l'autre...\n\nApres avoir monté la plateforme de métrologie de l’entreprise et lancé l'obsession de la mesure, je devais l’appliquer sur mes abeilles. Je devais savoir ce qui se passe dans mes ruches, anticiper.. Pour arrêter de courir après mes abeilles...\n\nJe vous présente un retour d'expérience sur la mise en place d'un système de mesures de l’activité de mes ruches à base de capteurs, d'Arduino et de LoRa, de la conception, la programmation, jusqu’à la gestion de l'énergie.\n\nDisclaimer: Il est possible que je parle beaucoup de la vie des abeilles...\n"
    },
    {
      "key": "tdd_et_tdd_sont_dans_un_bateau",
      "title": "TDD et TDD sont dans un bateau",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "languages"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "arnaud_bailly"
      ],
      "slot": "day-2-conference-4",
      "room": "Belem",
      "openfeedbackId": 52,
      "abstract": "Cette session est une introduction par la pratique à l’utilisation des systèmes de types fonctionnels “avancés”, tels qu’on peut les trouver dans des langages comme Haskell, OCaml ou Idris, pour modéliser et coder des problèmes concrets complexes de manière plus sûre et compacte. À partir d’un exemple relativement complexe mais très concret, le numéro de sécurité sociale et sa vérification, je présente différentes approches pour développer une implémentation qui soit la plus sûr et la plus expressive possible : tests de propriétés, tests de mutations, types de données algébriques et types dépendants sont au programme. Bien que le code présenté soit en Haskell, cette session devrait donner aux participants des idées et concepts transposables dans leur environnement technique particulier.\n\nLe Test-Driven Development ou TDD est une pratique essentielle pour faire croître du logiciel de manière incrémentale et sûre. Mais le mot \"Test\" dans TDD est trompeur : il n'est pas tant question de _tester_ que de guider le développement en définissant des micro-objectifs, des exemples, automatiquement vérifiés. \n\nSi les exemples sont nécessaires pour comprendre un problème, ils présentent quelques inconvénients :\n\n* leur énumération est quelque peu fastidieuse, répétitive, verbeuse et parfois difficile à relier au problème que l'on cherche à résoudre ;\n* ils ne sont pas suffisants pour s'assurer que la solution produite est robuste.\n\nCette session se veut une introduction à différentes autres approches pour guider le développement :\n\n* utiliser un système de types plus _précis_ pour \"rendre les états impossibles non représentables\" afin de réduire l'espace à explorer (donc à tester) ;\n* définir des _propriétés_ automatiquement vérifiées, ie. le _Property-Based Testing_, pour guider le développement et accroître la confiance dans le code produit ;\n* utiliser des _mutations_ pour prendre en défaut du code \"naïf\" et améliorer sa résilience.\n\nJe présente ces différentes pratiques en codant en direct un exemple tiré de notre vie quotidienne, la validation d'un numéro de sécurité sociale."
    },
    {
      "key": "technical_seo_101_for_js_developers",
      "title": "Technical SEO 101 for JS developers",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "martin_splitt"
      ],
      "slot": "day-2-conference-5",
      "room": "Jules Verne",
      "openfeedbackId": 62,
      "abstract": "The web is a great platform to reach a broad audience with our web apps and sites, but to do so we need to make sure that our web apps are findable for our potential users. \nIn this session we will open up the black box of SEO and find out what we can do in our code to make sure our web apps are search-friendly and gather a set of tools to debug and test our sites for discoverability."
    },
    {
      "key": "temporal_io___mes_workflows_sont_cloud_ready",
      "title": "Temporal.io - mes workflows sont cloud ready",
      "language": "French",
      "talkType": "quickie",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "alexandre_vilain"
      ],
      "slot": "day-1-quickie-2",
      "room": "Tour de Bretagne",
      "openfeedbackId": 36,
      "abstract": "Qui ne s’est jamais retrouvé, pour orchestrer des workflows métier complexes, à développer une solution maison ? On commence par ajouter une base de données pour gérer l’état, puis on ajoute du queueing pour faire transiter la donnée et on finit par développer des fonctions de retry complexes qui ne gèrent jamais tous les cas particuliers ? Avant même d’intégrer leur logique métier, les développeurs doivent résoudre une quantité de problématiques d’orchestration de workflows qui rendent les développements lourds et parfois complexes à maintenir. Et si on arrêtait de réinventer la roue ?\n\nTemporal.io est un moteur de workflow, dérivé de Cadence, initialement développé chez Uber et utilisé en production chez Netflix, Stripe ou encore Snapchat. Les paradigmes apportés par temporal.io sont simples et permettent aux équipes de réduire leur « glue-code » pour se concentrer sur leur code métier. Écrivez vos workflows dans le langage de votre choix grâce à ses SDKs disponibles dans plusieurs langages: JAVA, Go, Typescript, PHP (et bientôt Python, Ruby, Rust & .NET), la plateforme temporal s’occupe du reste. \n\nL’objectif est de vous présenter temporal.io: son fonctionnement, ses cas d’utilisation et son intérêt pour les équipes de développement."
    },
    {
      "key": "testez_vos_data_pipelines___",
      "title": "Testez vos data pipelines ! ",
      "language": "French",
      "talkType": "codelab",
      "tags": [
        "bigdata_ai"
      ],
      "complexity": "Beginner",
      "speakers": [
        "stephanie_baltus_bergamo"
      ],
      "slot": "day-1-codelab-3",
      "room": "Les Machines",
      "openfeedbackId": 35,
      "abstract": "Les tests unitaires et d'intégration font partie intégrante de la vie des backend ou frontend engineers. Le Test Driven Development (TDD) commence même à devenir une habitude. Pourtant, **chez les data engineers** c'est une toute autre histoire : la pratique n'est pas automatique, peu répandue alors que nous développons bien du logiciel.\n\nLe logiciel évolue chaque jour et **qui dit évolution, dit introduction de bug** ! Notre vie de data engineer ne serait-elle pas plus simple si nous pouvions nous assurer très rapidement de la qualité de nos pipelines ? \n\nQue ce soit en python, en java, en scala, les outils existent pourtant pour tester le code de transformations de données. Alors, si vous voulez **prendre soin de votre futur logiciel** en rendant vos pipelines  plus robustes, cet atelier est fait pour vous !\n\nJe vous propose de **développer ensemble, des pipelines testées, facile à faire évoluer** et de vous aider à vous orienter vers du TDD. Pour cela nous utiliserons :\n\n- Python\n- Poetry pour le build & la gestion de dépendances\n- Apache Airflow pour orchestrer nos pipelines\n- unitest pour les test unitaires\n- Docker & testscontainer pour les tests d'intégration\n- great_expectation pour les tests de qualité de la donnée\n\nUn repository git sera mis à disposition peu avant l'atelier, contenant notamment les dépendances nécessaires et un squelette de projet.\n\nA la fin de cet atelier, j'espère que chacun(e) soit convaincu(e) de l'intérêt des tests dans le développement de pipelines data et se sente suffisamment à l'aise pour intégrer cette pratique dans son quotidien."
    },
    {
      "key": "testing_web_applications_with_playwright",
      "title": "Testing Web Applications with Playwright",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "debbie_o_brien"
      ],
      "slot": "day-1-conference-4",
      "room": "Jules Verne",
      "openfeedbackId": 58,
      "abstract": "Testing is hard, testing takes time to learn and to write, and time is money. As developers we want to test. We know we should but we don't have time. So how can we get more developers to do testing? We can create better tools.\n\nLet me introduce you to Playwright - Reliable end-to-end cross browser testing for modern web apps, by Microsoft and fully open source. Playwright's codegen generates tests for you in JavaScript, TypeScript, Dot Net, Java or Python. Now you really have no excuses. It's time to play your tests wright."
    },
    {
      "key": "the_hitchhikers_guide_to_web_privacy",
      "title": "The hitchhiker's guide to web privacy",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Intermediate",
      "speakers": [
        "maud_nalpas"
      ],
      "slot": "day-2-conference-1",
      "room": "Titan",
      "openfeedbackId": 11,
      "abstract": "Hitchhiking isn't really a thing anymore, is it? \"The real danger of hitchhiking has most likely remained relatively constant, but the general perception of this danger has increased\".\n\nIn the same way, people are increasingly worried about their privacy on the web. Browsers are taking measures to allay these concerns, and the whole landscape is shifting.\n\nThis also impacts us, web developers. What can you do, and what should you do, to improve privacy on your site?\n\nIn this talk, I'll take you on a little trip to answer that question. I'll share concrete tips, things you can do today on your site to improve user privacy—and also user experience, while we're at it.\n\nPack up and follow me!"
    },
    {
      "key": "the_pwa_cheat_sheet_for_2023",
      "title": "The PWA Cheat Sheet for 2023",
      "language": "English",
      "talkType": "conference",
      "tags": [
        "web"
      ],
      "complexity": "Beginner",
      "speakers": [
        "maximiliano_firtman"
      ],
      "slot": "day-1-conference-5",
      "room": "Titan",
      "openfeedbackId": 56,
      "abstract": "PWAs are now installable on every mobile and desktop OS, but there are many new things since last years we need to do to create a successful experience. We will start understanding the current state of the PWA platform, including market share and compatibility. \n\nWe will mention new challenges for desktop, Android, and iOS and the checklist of features and things for a successful experience for all users in the upcoming year.\n"
    },
    {
      "key": "trouver_sa_voix__et_l_accepter_pour_mieux_l_utiliser",
      "title": "Trouver sa voix, et l'accepter pour mieux l'utiliser",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "sylvain_coudert"
      ],
      "slot": "day-1-conference-3",
      "room": "Belem",
      "openfeedbackId": 65,
      "abstract": "Dans la saga Dune de Frank Herbert, la voix est un outil absolu de domination et de manipulation.\nSans chercher à atteindre cette extrémité mais force est d'admettre qu'une voix bien placée, bien utilisée, peut être une arme redoutable dans la vie quotidienne.\nLes politiques et les pro du marketing n'ont aucun scrupule à l'utiliser pleinement alors pourquoi pas vous?\nGrâce à quelques exercices et à un travail d'écoute assidu, vous disposerez bientôt, en plus de vos brillants argumentaires, d'un outil de pointe pour vous faire entendre, comprendre et surtout écouter!\nQue ce soit en réunion, en conférence ou au téléphone, ne négligez plus votre voix, cultivez-la!"
    },
    {
      "key": "voyage_au_centre_de_la_veille___apprendre_en_continue_avec_sa_veille_technologique_",
      "title": "Voyage au centre de la Veille : apprendre en continue avec sa veille technologique.",
      "language": "French",
      "talkType": "conference",
      "tags": [
        "discovery"
      ],
      "complexity": "Beginner",
      "speakers": [
        "david_franck",
        "fabien_hiegel"
      ],
      "slot": "day-1-conference-4",
      "room": "Tour de Bretagne",
      "openfeedbackId": 59,
      "abstract": "React 32 ? Groovy 12 ? Kotlin 7 ? Docker 202 ? Des technologies inconnues déferlent chaque jour des sombres recoins de l'internet. Le temps de vous y intéresser est difficile à trouver : ni votre projet, ni votre organisation personnelle ne le permettent. Et finalement, quand arrive le moment de s’y atteler, vous manquez d’efficacité.\n\nVous aimeriez maintenir vos connaissances à jour, pour rester pertinent sur votre domaine d'expertise. Ou encore, satisfaire votre curiosité en découvrant de nouveaux horizons. Les possibilités d'explorations s'étendent devant vous, mais comment savoir par quel bout commencer ?\n\nAlors, embarquez avec nous dans un voyage au centre de la Veille. Nous partirons à la découverte d’un processus et d’outils qui transformeront votre veille. Vous aurez alors les clés pour mettre en place votre propre contenu utile et exploitable pour aller plus loin dans votre quotidien. Le résultat : un second cerveau qui vous accompagnera toute votre vie.\n"
    },
    {
      "key": "what_about_logs_",
      "title": "What About Logs?",
      "language": "English",
      "talkType": "quickie",
      "tags": [
        "cloud_devops"
      ],
      "complexity": "Beginner",
      "speakers": [
        "daniel__phrawzty__maher"
      ],
      "slot": "day-1-quickie-1",
      "room": "Jules Verne",
      "openfeedbackId": 51,
      "abstract": "In this fun, fast-paced talk, Dan puts his sysadmin hat on and takes you on a fun—and hopefully enlightening—journey through a topic that most of us take for granted: **logs**. There’s a good chance you’ve been emitting, collecting, and generally dealing with logs for much of your career (in one form or another). Yet despite the fact that logging is a technique as old as computing itself, there’s a very good chance that you’ve never stopped to ask yourself: what are they? Really, *what are logs?* Good question. Let’s find out!"
    }
  ],
  "speakers": [
    {
      "key": "_gerardsans________",
      "name": "Gerard Sans",
      "feature": false,
      "city": "London, UK",
      "photoUrl": "https://pbs.twimg.com/profile_images/1559493448918499328/585bWd6T_400x400.png",
      "socials": {
        "twitter": "gerardsans"
      },
      "bio": "Google Developer Expert; former AWS Amplify team"
    },
    {
      "key": "abdellfetah_sghiouar",
      "name": "Abdellfetah Sghiouar",
      "company": "Google",
      "city": "Stockholm, Sweden",
      "feature": false,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GhSLJKrHXv6ctwyeNDMLGxTZv93wf2GoTNBKhitVQ=s96-c",
      "socials": {
        "twitter": "boredabdel",
        "github": "boredabdel",
        "linkedin": "sabdelfettah"
      },
      "bio": "Senior Cloud Developer Advocate at Google Cloud\nCommunity lead and Podcast host\n4 x Kubernetes & 5 x Google Cloud certified"
    },
    {
      "key": "adrien_bordone",
      "name": "Adrien Bordone",
      "feature": false,
      "company": "Code Busters",
      "companyLogo": "/images/partners/code_busters.png",
      "city": "Paris, Nantes",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GgdM04Ms84mnWOyJ282-o-AK6d3jx0u4ADwKLuTGw=s96-c",
      "socials": {},
      "bio": "Passionné de nouvelles technologies et développeur Full-Stack spécialisé en Java et Angular, j'apporte un soin particulier à la qualité du code.\n\nEn tant que Squad Leader chez Code Busters, mon rôle est d’accompagner mon équipe dans leur apprentissage en leur transmettant tout ce que j’ai pu acquérir au cours de mes différentes expériences.\n"
    },
    {
      "key": "adrien_pessu",
      "name": "Adrien PESSU",
      "feature": false,
      "company": "Okta",
      "city": "Nantes, France",
      "photoUrl": "https://lh4.googleusercontent.com/-1wzRZnWEiLs/AAAAAAAAAAI/AAAAAAAAAgY/MXjzTjS-Qu4/photo.jpg",
      "socials": {
        "twitter": "adrienpessu",
        "github": "@adrienpessu"
      },
      "bio": "Je suis un développeur Freelance passionné, en particulier de Java, Kotlin et Web. Je m'intéresse aussi particulièrement à la sécurité applicative (AppSec). J'aime chercher/corriger des bugs de sécurité, mais aussi partager et mettre en place les bonnes pratiques."
    },
    {
      "key": "alban_depretz",
      "name": "Alban Depretz",
      "feature": false,
      "company": "Klaxoon",
      "companyLogo": "/images/partners/klaxoon.png",
      "city": "Rennes, France",
      "photoUrl": "https://media-exp1.licdn.com/dms/image/C4D03AQEdt3jN-wCMzw/profile-displayphoto-shrink_400_400/0/1568642993657?e=1664409600&v=beta&t=FJ1poYT-5R5xVQufipK797224GLrVoA6JLkrUyvpEOI",
      "socials": {
        "github": "chdeps"
      },
      "bio": "Senior Software engineer at klaxoon / Mines Paristech alumni. When not coding, I’m windsurfing, skiing or climbing."
    },
    {
      "key": "alexandre_vilain",
      "name": "Alexandre vilain",
      "feature": false,
      "company": "OVHCloud",
      "companyLogo": "/images/partners/ovhcloud.png",
      "city": "Nantes, France",
      "photoUrl": "https://pbs.twimg.com/profile_images/720272063567683584/Vq-SDxBc_normal.jpg",
      "socials": {
        "twitter": "AlexVilain",
        "github": "alexandrevilain"
      },
      "bio": "Technical Leader @OVHCloud.\nWorking on Kubernetes & Go."
    },
    {
      "key": "antony_lallement",
      "name": "Antony Lallement",
      "feature": false,
      "company": "ADN Consulting",
      "companyLogo": "/images/partners/adn_consulting.png",
      "city": "Lille, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gj83vz09VDCMQQ9TksnAMwDXFhIlUjGRa1YsRkN=s96-c",
      "socials": {
        "github": "ADN182"
      }
    },
    {
      "key": "arnaud_bailly",
      "name": "Arnaud Bailly",
      "feature": false,
      "company": "IOG",
      "companyLogo": "/images/partners/iog.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GhRr_m3TnIcuC0DwlgrBLpWd5kQoOV9bhyRDC5L=s96-c",
      "socials": {
        "twitter": "dr_c0d3",
        "github": "abailly"
      },
      "bio": "Arnaud has been developing software and helping team develop softwares for nearly three decades, in various technologies,  contexts and roles. He is interested in everything software-related with a peculiar passion for strongly-typed functional programming."
    },
    {
      "key": "arnaud_pichery",
      "name": "Arnaud Pichery",
      "city": "Paris, France",
      "company": "Dataiku",
      "feature": false,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gj7k1fYA0Nf5skTYgOAOfTPFuGboGHfr-yxsPHxuA=s96-c",
      "socials": {}
    },
    {
      "key": "arthur_lutz",
      "name": "Arthur Lutz",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GiEzfeAQZvPH9ffS6rw5X6EKKVsN9FSJ92tuL-C=s96-c",
      "socials": {
        "twitter": "arthurlutz",
        "github": "arthurzenika"
      },
      "bio": "Arthur est consultant DevOps, linuxien, fan de Kubernetes et Pythoniste, il s’est spécialisé dans le domaine du DevOps et de l’Infrastructure-as-code au fur et à mesure de ces 15 années d'expérience.\n\nFormateur sur plusieurs sujets, il se passionne pour le Continuous Delivery, la métrologie, l'expérience développeur, la production logicielle et les bonnes pratiques associées.\n\nCurieux de tout, il bidouille de l’électronique, la domotique et les outils makers sur son temps personnel et dans le milieu associatif. \n\nAvide de partage, il participe à des communautés de logiciels libres, de nombreux meetup et conférences en tant qu’organisateur et speaker… \n"
    },
    {
      "key": "arthur_tarroux",
      "name": "Arthur Tarroux",
      "feature": false,
      "company": "Association ESTIMnumérique",
      "companyLogo": "/images/partners/association_estimnumerique.png",
      "city": "Rennes, France",
      "photoUrl": "https://i.ibb.co/pxVK8Dm/Arthur-Tarroux-ESTIMnum-rique.png",
      "socials": {
        "twitter": "arthurtarroux"
      },
      "bio": "Passionné de Sciences Sociales, titulaire d’un Master en Sciences Politiques et Sociologie, Arthur Tarroux a rejoint l’association ESTIMnumérique, en tant que chargé de mission mixité, pour accompagner les entreprises dans le changement de leurs pratiques professionnelles. Sa mission ? Permettre aux entreprises de « chausser les lunettes de l’égalité femmes-hommes », afin d’imaginer de nouvelles actions en faveur de l'égalité et soutenir leur mise en œuvre."
    },
    {
      "key": "benjamin_casseron",
      "name": "Benjamin Casseron",
      "feature": false,
      "company": "Externatic",
      "companyLogo": "/images/partners/externatic.png",
      "city": "Nantes, France",
      "photoUrl": "https://web2day.co/wp-content/uploads/2022/03/BenjaminCasseron-Web2day-500x500.jpeg",
      "socials": {
        "twitter": "bcasseron"
      },
      "bio": "Recruteur, je suis passionné par la tech et d’entrepreneuriat.\n\nAprès quelques années dans le conseil, j’ai créé une société éditrice d’un outil de recrutement web (kskills, vendue en 2015).\nJ’ai ensuite rejoint le cabinet de recrutement informatique Externatic en tant qu’associé.\n\nEn 2021, nous avons fait évoluer Externatic en société à gouvernance partagée (sociocratie / entreprise opale). Les collaborateurs (26 personnes réparties sur 3 sites : Nantes, Bordeaux et Lille) participent dorénavant pleinement à la vie de l’entreprise. En ce qui concerne la direction, cela implique lâcher-prise et mise en place d’un environnement propice à la prise d’initiative.\n\nJe suis ravi de pouvoir partager ce retour d’expérience avec vous !"
    },
    {
      "key": "benjamin_legrand",
      "name": "Benjamin Legrand",
      "feature": false,
      "company": "Onepoint",
      "companyLogo": "/images/partners/groupe_onepoint.png",
      "city": "Nantes, France",
      "photoUrl": "https://avatars.githubusercontent.com/u/32519406?v=4",
      "socials": {
        "twitter": "benjilegnard",
        "github": "benjilegnard"
      },
      "bio": "Tombé dans la marmite du web étant petit. \n\nAyant appris le HTML dès l'enfance en regardant sous le capot ce que frontpage ou dreamweaver générait, c'est tout naturellement que Benjamin fit depuis 2008 du développement web son métier.\n\nD'abord full-stack, puis en fait full fronteux, parfois défricheur de frameworks javascript bizarres, amoureux du Typescript, fanboy d'Angular. touche à tout musicien. \n\nIntervenu sur plein de projets variés, de l'e-commerce à l'industrie, en passant par les telecoms .  Tech Lead front / Architecte Logiciel\n\nCes dernières années sur de longues missions chez Groupe Creative Nantes, aujourd'hui chez Onepoint.\n"
    },
    {
      "key": "benjamin_merieau",
      "name": "Benjamin Merieau",
      "feature": false,
      "company": "Stack Labs",
      "companyLogo": "/images/partners/stack_labs.png",
      "city": "Toulouse, France",
      "photoUrl": "https://lh5.googleusercontent.com/-I5DdNnX3xKc/AAAAAAAAAAI/AAAAAAAAAEU/pbh4G8bfRX0/photo.jpg",
      "socials": {},
      "bio": "Passionate about cybersecurity, I like to dive into security aspects of new technologies (Cloud, IoT, Blockchain).\nIn the cybersecurity field for 6 years, I work for Stack Labs as cloud cybersecurity engineer. My job is to help customers  to design and implement secure solution for cloud project and cloud migration.\n"
    },
    {
      "key": "cecile_staehle",
      "name": "Cécile Staehle",
      "feature": false,
      "company": "Troopers Web Republic",
      "companyLogo": "/images/partners/troopers_web_republic.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GjaruFC14Hn-O_6JTw4G5GL06Z_FalFeWX8jRxz=s96-c",
      "socials": {},
      "bio": "J’ai rejoint Troopers Web Republic (agence web) en 2018 où j’ai découvert le monde de l’entreprise libérée. Je me suis depuis prise de passion pour les innovations managériales et les nouvelles formes d’organisation. En tant que Responsable du Développement RH, je travaille à la mise en place d’outils et de process au service de notre gouvernance partagée et de notre culture d’entreprise, je participe à l’accompagnement des équipes et à l’amélioration continue de notre organisation.\nJe suis également devenue associée coopératrice de l’entreprise, transformée en SCOP – Société Coopérative – en 2021."
    },
    {
      "key": "charlie_gerard",
      "name": "Charlie Gerard",
      "feature": true,
      "company": "Stripe",
      "companyLogo": "/images/partners/stripe.png",
      "city": "Seattle, USA",
      "photoUrl": "https://avatars.githubusercontent.com/u/5985247?v=4",
      "socials": {
        "twitter": "devdevcharlie",
        "github": "charliegerard"
      },
      "bio": "Senior developer advocate at Stripe. Also GoogleDevExpert and author 📗. Very much into creative technology and HCI, mostly in JavaScript."
    },
    {
      "key": "charline_charrier",
      "name": "Charline Charrier",
      "feature": false,
      "company": "Valeuriad",
      "companyLogo": "/images/partners/valeuriad.png",
      "city": "Nantes, France",
      "photoUrl": "https://pbs.twimg.com/profile_images/695977815297159175/UcRTx5uR_400x400.jpg",
      "socials": {
        "twitter": "CharlineRenart"
      },
      "bio": "Dynamique agiliste, je suis convaincue que le plus important pour un produit c’est l’équipe qui le porte. Aujourd’hui, j’accompagne des équipes dans la réalisation de produit en ayant pour objectif un travail de qualité réalisé par une équipe qui y prend du plaisir !"
    },
    {
      "key": "christophe_furmaniak",
      "name": "Christophe Furmaniak",
      "feature": false,
      "company": "Decathlon",
      "companyLogo": "/images/partners/decathlon.png",
      "city": "Lille, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gg00lmhiR1QlD_cCDqqXVwdzbL8_2RCS_a_HWS_yw0",
      "socials": {
        "twitter": "cfurmaniak",
        "github": "looztra"
      },
      "bio": "Des racines de développeur passionné et responsable m’ont amené à traiter avec attention les sujets du cycle de vie des projets, du poste de travail du développeur jusqu’au déploiement sur les environnements en production.\n\nMa conviction que l’approche DevOps et le <i>Continuous Delivery</i> sont les bonnes directions à prendre m'amène (en tant qu'<i>Ops</i>) à collaborer autant que possible avec les développeurs que je côtoie au quotidien et à y jouer le rôle que je préfère : le facilitateur.\n\nJ'adore le YAML, que ce soit pour définir une construction <i>Google Cloud Build</i> (ou <i>CircleCI</i>) ou mettre à jour la configuration de composants applicatifs hébergés sur une instance <i>Kubernetes</i> en m'appuyant sur <i>Kustomize</i> et des outils <i>GitOps</i>."
    },
    {
      "key": "clement_delafargue",
      "name": "Clement Delafargue",
      "feature": false,
      "company": "Fretlink",
      "companyLogo": "/images/partners/fretlink.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AAuE7mCBqX89RjV4fdBxtFs9nkbMXT2Jq8yjjO-hob7Y",
      "socials": {
        "twitter": "clementd",
        "github": "divarvel"
      },
      "bio": "Développeur fonctionnel. Aujourd'hui je bosse principalement avec haskell.\nDans une vie précédente,  j'ai été CTO pour une boîte d'hébergement informatique."
    },
    {
      "key": "cyril_mottier",
      "name": "Cyril Mottier",
      "feature": false,
      "company": "Gens de Confiance",
      "companyLogo": "/images/partners/gens_de_confiance.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GglwUL6dsH7_5RmabNnpzd4wsbZZ4JDGIwULD1A=s96-c",
      "socials": {
        "twitter": "cyrilmottier",
        "github": "cyrilmottier"
      }
    },
    {
      "key": "daniel__phrawzty__maher",
      "name": "Daniel Maher",
      "feature": false,
      "company": "Scaleway",
      "city": "Paris, France",
      "photoUrl": "https://on.notist.cloud/headshots/hs-phrawzty-thumb-56755c06f22ebecf.png",
      "socials": {
        "twitter": "phrawzty",
        "github": "phrawzty"
      },
      "bio": "Dan is a veteran of the original dotcom bubble and has since worked in a variety of environments from start-ups to global corporations, including stints as a founder, university lecturer, and a day labourer. Today, Dan is a member of the Devopsdays global team, an amateur geographer, and a big fan of the European tech scene."
    },
    {
      "key": "david_batiot",
      "name": "David BATIOT",
      "feature": false,
      "company": "cbp",
      "companyLogo": "/images/partners/cbp.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GgBqMvxwHU80ztWh5I79q9dVb_CulMRGFYIoQXZJw=s96-c",
      "socials": {
        "twitter": "batiot",
        "github": "batiot"
      },
      "bio": "Développeur Back passionné depuis 20 ans, Side Project Addict et Tech Lead sur www.cbp4you.fr"
    },
    {
      "key": "david_franck",
      "name": "David Franck",
      "feature": false,
      "city": "Nantes, France",
      "company": "Shodo",
      "photoUrl": "https://s.gravatar.com/avatar/cf1cbcce6f105882a1fd51fceafe3f0e?s=80",
      "socials": {
        "twitter": "dayoud"
      },
      "bio": "Développeur passionné par l'apprentissage, l'amélioration continue, le craft et le partage de connaissances. \nJ'aime travailler dans des équipes qui sont ouvertes à l'échange. \nJe développpe principalement en Java sur des backends jusqu'à présent. \nJ'ai rejoint Shodo depuis Juillet 2022, en accord avec mes valeurs. "
    },
    {
      "key": "david_sferruzza",
      "name": "David Sferruzza",
      "feature": false,
      "company": "_icilundi",
      "companyLogo": "/images/partners/_icilundi.png",
      "city": "Nantes, France",
      "photoUrl": "https://avatars0.githubusercontent.com/u/1931963?v=4",
      "socials": {
        "twitter": "d_sferruzza",
        "github": "dsferruzza"
      },
      "bio": "Cofondateur et CTO de _icilundi, un réseau de lieux nantais (bureaux & restauration) pour entrepreneurs et innovateurs. Ingénieur généraliste et docteur en génie logiciel passionné de sciences, d'ordinateurs et de projets loufoques. (Ré)écrit des programmes en Rust. Développeur bénévole pour MakAir, un respirateur artificiel open source créé pendant le 1er confinement et amené jusqu'aux essais cliniques en quelques mois."
    },
    {
      "key": "debbie_o_brien",
      "name": "Debbie O'Brien",
      "company": "Microsoft",
      "city": "Palma, Spain",
      "feature": true,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GhLe6WBVfMbsf-rP-Sm96_SwsenKsQ5bsEAPpdGww=s96-c",
      "socials": {
        "twitter": "debs_obrien",
        "github": "debs-obrien",
        "linkedin": "debbie-o-brien-1a199975"
      },
      "bio": "Senior Program Manager at Microsoft\n\nOver 10 years experience in Frontend development. Microsoft Most Valuable Professional in developer technologies, Google Developer Expert in web technologies and Cloudinary Media Developer Expert and Github Star. International Conference Speaker. Teacher at Vue School. Writer for Ultimate Courses and Open Source contributor. Mentor for online learning platforms, Treehouse and OpenClassrooms. Lead teams both in house and remotely as well as giving workshops and training."
    },
    {
      "key": "eleouet_gaetan",
      "name": "Gaëtan Eleouet",
      "feature": false,
      "company": "Meritis",
      "companyLogo": "/images/partners/meritis.png",
      "city": "Paris, France",
      "photoUrl": "https://blog.egaetan.me/extern/photo.png",
      "socials": {
        "twitter": "egaetan",
        "github": "geleouet"
      },
      "bio": "Dans mes jeunes années être geek n’était pas un métier et pourtant je suis aujourd’hui développeur depuis 15 ans. \nAnimé par des convictions fortes sur l’impact des développeurs sur le monde, je transmets et j’enseigne dans le cadre d’atelier de code et en vacation en école d’ingénieur. \nAu-delà de mon métier, c’est aussi une passion : je code pour le plaisir dans des projets personnels et lors de compétition de programmation."
    },
    {
      "key": "fabien_hiegel",
      "name": "Fabien Hiegel",
      "feature": false,
      "company": "Shodo",
      "companyLogo": "/images/partners/shodo_nantes.png",
      "city": "Nantes, France",
      "photoUrl": "https://secure.gravatar.com/avatar/41dcae3b47a5744a926bb22d17f6804a",
      "socials": {
        "twitter": "fhiegel",
        "github": "fhiegel"
      },
      "bio": "Développeur passionné ; quel que soit le langage de programmation, tout est prétexte à créer et à y prendre du plaisir.\nPar mes diverses expériences, j'ai découvert et aiguisé mes pratiques du craft, notamment par des ateliers de partage\net de veille collective.\n\nEn animant des communautés de pratiques, en facilitant l'internalisation de formations ou encore,\nen ludifiant des ateliers de pratique,j'espère pouvoir transmettre cette passion aux personnes qui m'entourent \net les aider à apprendre les compétences techniques qui les font rêver."
    },
    {
      "key": "fabien_martin",
      "name": "Fabien Martin",
      "feature": false,
      "company": "VMware",
      "companyLogo": "/images/partners/vmware.png",
      "city": "Chambéry, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GiOpoxZEW0HIpnW1jm43F90rZF0QBDS34IDTibqEyw=s96-c",
      "socials": {
        "twitter": "beeNotice",
        "github": "beeNotice"
      },
      "bio": "Actuellement Solution Engineer chez VMware Tanzu, j'ai un début de carrière assez classique dans l'informatique !  \nDéveloppeur, Leader Technique, Architecte, j'ai eu l'occasion de travailler sur de super projets autour du Web, du DevSecOps et du Cloud.\n"
    },
    {
      "key": "fabien_tregan",
      "name": "Fabien Trégan",
      "feature": false,
      "company": "Freelance",
      "city": "Toulouse, France",
      "photoUrl": "https://pbs.twimg.com/profile_images/1163878482570616843/V5_0fxWv_400x400.jpg",
      "socials": {
        "twitter": "ftregan",
        "github": "fabientregan"
      },
      "bio": "Je n'ai rien à vendre.\n\n(mais n'hésitez pas à venir dire bonjour :) )"
    },
    {
      "key": "fanny_demey_pluvinage",
      "name": "Fanny Demey Pluvinage",
      "feature": false,
      "company": "Freelance",
      "city": "Lille, France",
      "photoUrl": "https://lh6.googleusercontent.com/-wScR9-Ut2gk/AAAAAAAAAAI/AAAAAAAAejo/tmttmUVooIQ/photo.jpg",
      "socials": {
        "twitter": "FannyDemey",
        "github": "FannyDemey"
      },
      "bio": "Fanny développe dans tout un tas de domaine depuis plus de 10 ans, en particulier du mobile sur Android. C'est une Lilloise engagée pour la communauté, Présidente et organisatrice du DevFest Lille. Elle est également engagée pour l'accessibilité, vous pouvez l'entendre en tant que host sur le podcast TechEthic. Actuellement freelance, elle travaille exclusivement sur des projets avec une forte dimension éthique."
    },
    {
      "key": "franck_pr",
      "name": "Franck Pramotton",
      "feature": false,
      "city": "Nantes, France",
      "photoUrl": "https://media-exp1.licdn.com/dms/image/C4D03AQEMaMgBoWgP_Q/profile-displayphoto-shrink_800_800/0/1638046913360?e=1668038400&v=beta&t=m0RfHcjkNZjor9RtPPt1gwHMAb_4tJgHSP778Iqyc4c",
      "socials": {
        "twitter": "franckpramotton",
        "linkedin": "franck-pramotton-8444151"
      },
      "bio": "\"Repenti\" d'une carrière de 30 ans chez un GAFAM, membre du Groupe de Travail Sobriété Numérique au sein de l’association «les Shifters », Instructeur et Animateur professionnel sur l'outil «La Fresque du Numérique»."
    },
    {
      "key": "francois_bouteruche",
      "name": "François Bouteruche",
      "feature": false,
      "company": "Amazon Web Services",
      "companyLogo": "/images/partners/amazon_web_services_emea.png",
      "city": "Paris, France",
      "photoUrl": "https://avatars0.githubusercontent.com/u/10872124?v=4",
      "socials": {
        "twitter": "fbouteruche",
        "github": "fbouteruche"
      },
      "bio": "I'm currently Senior Developer Advocate at Amazon Web Services. I am a tech enthusiast with a strong background around .NET development and DevOps philosophy and practices. \n\nI have a PhD  in Computer Science. I worked several years around handwriting recognition and pen-based interfaces so I'm very familiar with all the real stuff behind the buzz words AI and Machine Learning :) I led the R&D team at Evodia, the ancestor of [Script and Go](http://www.scriptandgo.com/en) After the fall of Evodia during the 2008-2010 financial crisis, I joined Orange Applications for Business, a subsidiary of Orange, where I focused on Application Lifecycle Management, Agile methodologies and then DevOps practices. I worked at the technical board of the company reporting to the CTO, [Philippe Ensarguet](https://www.linkedin.com/in/philippeensarguet). After 5 years, I joined [Younited Credit](https://www.younited-credit.com) at the beginning of its scaling stage to help them moving to a public cloud provider (Azure) and setting up Continuous Integration and Continuous Delivery best practices.\n\nThen, I worked 3 year at Microsoft France help .NET Developers from customers, ISV and meetup communities to take the best advantages of Microsoft Developer Tools.\n\nI've recently joined Amazon Web Services to help .NET Developers using AWS Cloud to build, test and deploy efficiently and securely on AWS Cloud.\n\nI regularly talk at conferences such as Tech Days, EclipseCon France, API Days, Paris Open Source Summit, Cloud Expo Europe, Breizhcamp, DevFest Nantes, DevFest Strasbourg, Codeurs en Seine...\n\nYou can find more [here](https://www.linkedin.com/in/francoisbouteruche)"
    },
    {
      "key": "frederic_harper",
      "name": "Frédéric Harper",
      "feature": true,
      "company": "Mindee",
      "companyLogo": "/images/partners/mindee.png",
      "city": "Montreal, Canada",
      "photoUrl": "https://i.ibb.co/Kzb1zrk/fharper.jpg",
      "socials": {
        "twitter": "fharper",
        "github": "fharper"
      },
      "bio": "With his Developer Relations as a Service company, Frédéric Harper help companies build healthy and thriving community, while creating educational content to help developers being successful with his customers' offerings. Fred had helped thousands of developers and has shared his passion for technology on the stage at more than 170 events around the world. He’s helped build successful communities at npm, Mozilla, Microsoft, DigitalOcean, and Fitbit, and is the author of the book Personal Branding for Developers at Apress. Behind this extrovert is a very passionate individual who believes in the power of communication... and cat videos."
    },
    {
      "key": "gael_poupard",
      "name": "Gaël Poupard",
      "feature": false,
      "company": "Onepoint",
      "companyLogo": "/images/partners/onepoint.png",
      "city": "Nantes, France",
      "photoUrl": "https://www.ffoodd.fr/ffoodd.jpg",
      "socials": {
        "twitter": "ffoodd_fr",
        "github": "ffoodd"
      },
      "bio": "Lead tech front chez Onepoint à Nantes, je bricole avec HTML et CSS depuis IE6. \n\nPassé par les cases designer UX/UI en agence, développeur PHP, développeur front en start-up au commande d’un guide de styles (on ne parlait pas encore de design system !), chef de chantier sur une refonte technique front chez un éditeur dans un environnement Java, puis spécialiste front et CMS en ESN, je suis désormais référent accessibilité et expert HTML / CSS / SVG chez Onepoint.\n\nJ’ai entre autre choses commis a11y.css et chaarts, fait partie de la core team Bootstrap et contribue régulièrement à divers projets open-source.\n\nJe cultive désormais le bon HTML et du CSS, fait des audits RGAA et prône l’assurance qualité web avec Opquast.\n"
    },
    {
      "key": "geoffrey_crofte",
      "name": "Geoffrey Crofte",
      "feature": false,
      "company": "Foyer Group",
      "companyLogo": "/images/partners/foyer_group.png",
      "city": "Luxembourg",
      "photoUrl": "https://pbs.twimg.com/profile_images/1325532716981497862/dTNjLbNU_400x400.jpg",
      "socials": {
        "twitter": "geoffreycrofte",
        "github": "geoffreycrofte"
      },
      "bio": "Lead (UX) Designer travaillant à Luxembourg.\nJ'ai travaillé pendant 12 ans sur des projets  à des postes très variés. Mes différentes casquettes m’ont permis de découvrir mon métier de points de vue très différents. (Développeur front, chef de projet, freelance, en agence, en startup, en consulting et dans une grosse boîte d'assurance)\n\nJe suis également développeur de plugins pour le CMS WordPress, Ninja (pour de vrai) et ancien danseur de licorne (pour de vrai aussi) et maroquinier amateur à mes heures perdues.\n\nJe partage également plein de choses sur mon blog, en compagnie d’autres auteurs et auteures invité·e·s, mais aussi lord de mes cours de design, ou mes interventions en meetup et conférences. \n\nAu plaisir d'échanger avec vous !\n"
    },
    {
      "key": "geoffroy_couprie",
      "name": "Geoffroy Couprie",
      "company": "Freelance",
      "city": "Nantes, France",
      "feature": false,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gjbu0BR5NRQI_BbpyOd1N97-0azre710tLUGqxFWw=s96-c",
      "socials": {
        "twitter": "gcouprie",
        "github": "Geal",
        "linkedin": "gcouprie"
      }
    },
    {
      "key": "gerard_paligot",
      "name": "Gerard Paligot",
      "feature": false,
      "company": "Decathlon",
      "companyLogo": "/images/partners/decathlon.png",
      "city": "Lille, France",
      "photoUrl": "https://pbs.twimg.com/profile_images/1465658195767136257/zdYQWsTj_400x400.jpg",
      "socials": {
        "twitter": "GerardPaligot",
        "github": "GerardPaligot"
      },
      "bio": "Father of two kids, husband of an incredible wife and huge fan of Disney long before I had children. I'm a Google Developer Expert for Android since 2022 and Mobile Staff Engineer at Decathlon. I'm also member of GDG Lille (Android), FRAUG and one of the co-organizer of the Devfest Lille."
    },
    {
      "key": "godefroy",
      "name": "Godefroy de Compreignac",
      "company": "Lonestone",
      "feature": false,
      "photoUrl": "https://avatars.githubusercontent.com/u/148421?v=4",
      "city": "Nantes, France",
      "socials": {
        "twitter": "Godefroy",
        "github": "Godefroy",
        "linkedin": "godefroy"
      },
      "bio": "Je crée de belles apps web et mobile avec mon équipe de 30 personnes et j’accompagne notre démarche d’entreprise libérée.\n\nQuand on a dépassé 10 personnes, l’organisation informelle ne marchait plus et on voulu se structurer.\n\nMais pas en reproduisant le schéma classique de hiérarchie pyramidale dont je redoute les travers.\n\nNous avons adopté progressivement les principes d’entreprise libérée et les process de la constitution Holacratie.\n\nÇa nous va bien et je vous partage mes retours d’expérience."
    },
    {
      "key": "guillaume_laforge",
      "name": "Guillaume Laforge",
      "feature": false,
      "company": "Google",
      "companyLogo": "/images/partners/google.png",
      "city": "Paris, France",
      "photoUrl": "https://lh6.googleusercontent.com/-q2nbAhzprxo/AAAAAAAAAAI/AAAAAAAAL6g/rLd0hunWYhg/photo.jpg",
      "socials": {
        "twitter": "glaforge",
        "github": "glaforge"
      },
      "bio": "Guillaume Laforge est Developer Advocate chez Google et se focalise en particulier sur l'offre Google Cloud Platform. Et la nuit, il enfile sa casquette Apache Groovy !"
    },
    {
      "key": "guillaume_membre",
      "name": "Guillaume Membré",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh5.googleusercontent.com/-_wR1F6ARzlY/AAAAAAAAAAI/AAAAAAAAABA/sL5Sk_m1uWA/photo.jpg",
      "socials": {
        "twitter": "GuillaumeMembre",
        "github": "gmembre-zenika"
      },
      "bio": "Geek à toute heure, je travaille principalement autour des technologies Java/JavaEE mais aussi sur des problématiques de déploiement continu, de qualimétrie. Désormais, je partage son expérience pour faciliter la mise en place de démarche devops chez différents acteurs. J'adore bidouiller des RaspberryPi ou Arduino pour créer des choses inutiles donc indispensables.\nLorsque le temps le permet, je décris mes aventures sur mon [site web](https://www.geekeries.fun)."
    },
    {
      "key": "guillaume_petra",
      "name": "Guillaume Petra",
      "feature": false,
      "company": "Bouygues Telecom",
      "companyLogo": "/images/partners/bouygues_telecom.png",
      "city": "Nantes, France",
      "photoUrl": "https://static.fnac-static.com/multimedia/Images/FR/MDM/12/ee/cf/13626898/1540-1/tsp20211122231221/Peluche-Pokemon-Dracaufeu-30-cm.jpg",
      "socials": {},
      "bio": "Guillaume est architecte technique chez Bouygues Telecom,  passionné par le cloud (certifié AWS), kubernetes et la blockchain.\nEt lorsque le temps le permet, il part s'occuper de ses abeilles. 🐝\n"
    },
    {
      "key": "herve_leclerc",
      "name": "Hervé Leclerc",
      "feature": false,
      "company": "Alterway",
      "companyLogo": "/images/partners/alterway.png",
      "city": "Nantes, France",
      "photoUrl": "https://assets.alterway.fr/2021/04/Herve_Leclerc-2.jpg",
      "socials": {},
      "bio": "Hervé Leclerc est le CTO d'Alter Way du groupe Smile.\n\nMonsieur Jourdain du DevOps, Il a lancé les premières plateformes d'intégration continue intégralement conteneurisées de la société ainsi que l'offre commerciale de CAAS (Container as a Service) d'Alter Way dès 2016.\n\nIl aime partager son savoir, son enthousiasme soit en tant que formateur officiel Docker ou Kubernetes ou lors d'événements en ligne ou physique.\n\nVoici quelques événements auxquels il a participé :\n\n- Webinar : Finops sur azure et aws (2021)\n- Webinar : GreenOps sur Azure (2022)\n- Cloud Sud (Meetup Montpellier) : Gestion dynamique des DNS et certificats dans kubernetes (2022)\n- OSXP : \"Native Kubernetes CD pipelines with Tekton CD\"\n- Animations de plusieurs ateliers Cloud Native Apss & Infra on Azure (2021)\n- Passage sur ifttd (if this then dev)  #154: Ordinateurs gris, téléphones noirs, et Ops vertes | IFTTD - If This Then Dev"
    },
    {
      "key": "hubert_sablonniere",
      "name": "Hubert Sablonniere",
      "feature": false,
      "company": "Clever Cloud",
      "companyLogo": "/images/partners/clever_cloud.png",
      "city": "Lille, France",
      "photoUrl": "https://lh3.googleusercontent.com/-zULkNj_mgrE/AAAAAAAAAAI/AAAAAAAAmiM/s1x33T4pEBo/photo.jpg",
      "socials": {
        "twitter": "hsablonniere",
        "github": "hsablonniere"
      },
      "bio": "Hubert est passionné par le Web. Il est toujours à la recherche de nouvelles idées et autres bidouilles pour améliorer l'expérience des utilisateurs et des développeurs."
    },
    {
      "key": "jean_phi_baconnais",
      "name": "Jean-Phi Baconnais",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/fife/ABSRlIolFLYdZXhdEhfta3KuRkn0TNkALmg_a4n3BDfczSV3NHXDHybLMTDH3fvTn_1jPt1dWReCOZUtu9jbSSFjtg4EfeIjBoX6ptGQGIQdYiwn-BBrkR1c96vFvwBmbm964nn9hehrGK05oHelbYG4uDcCJnXkNmh214yNwN2gZd_fhNpiBnN3XGEKB4pkgnhEF1KUBhcaGJe1xpLM0czGL8QdzKvBroZrrkXsID3MYhnihDGdYYGKJquZz2I9YeBo-jp_Zr69iotJ1L9VixvRvw1WVHDRIdmeo8LKEApVNWfH9E339jrxGvU9PSA3qHHPuz00RTFj8daRowjWxC9Z3ycOLnjCsIqGA2yyFX7AZ7zvobFgXgI0YsI0TCV_iRxRAPh98Hq_jcJZDdlENNWUdA0FH6K6NBXQLcWtA4ARObDFky_6zcbV8ccdG7Fxs4vAha_QYJY8jQ2bfyzDltVxxEHghAcuR6-QYflrwwwV55MXlXux66Eu3VS3uJQG6o7G5I-IgwsYYmNHhImJrSG0OfAuA_8zy4pETVYWBMgMyWmE7hoqI0LVvvl23bR0vYH-h3qyqz-P8RLuNWX2Dnhj73QUR23Oz68d7-R3OGgF7ZRNtDZFORp5x6iwQWG5SFWnSQB-3PKtNgOvsFdzZo035rH0vRbhZyy-Omn4aPSpljBuq0KXWS2wjgoBEdOf6DPwnP_4TOiU5ceLrVu-2pIST7xmnd0dJNb3ovyEkNVPw-I9Kg=s83-c",
      "socials": {
        "twitter": "JPhi_Baconnais",
        "github": "jeanphibaconnais"
      },
      "bio": "**Développeur / Consultant chez Zenika Nantes **\n\nPlongé dans le développement avec l'éco-système Java, curieux de nature, j'aime découvrir et expérimenter de nouvelles technos back end ou front end et les partager autour de moi.\n\nGitLab Heroes depuis l'été 2020 🦊 & Community Hero GitPod 🍑 depuis juin 2022\n"
    },
    {
      "key": "jean_verrons",
      "name": "Jean Verrons",
      "city": "Toulouse, France",
      "feature": false,
      "photoUrl": "https://i.ibb.co/YQdYkd9/image001.jpg",
      "socials": {},
      "bio": "I’m passionate about cybersecurity, I like to dive into security aspects of new technologies (Cloud, Hardware, Crypto, Kubernetes). In the cybersecurity field for 3 years, I work from Switzerland as cloud cybersecurity engineer. My job is to help the project to design and implement their solution in a secure way and to apply the cloud security policies (SCP, Process, Prisma, …)"
    },
    {
      "key": "jeremy_lejeune",
      "name": "Jérémy Lejeune",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh4.googleusercontent.com/-YW-wpZdJkrk/AAAAAAAAAAI/AAAAAAAAAAA/ACevoQPWmdnLhRJYTKKsHRXZxlcyRJSGgA/mo/photo.jpg",
      "socials": {
        "github": "yodur2potassium"
      },
      "bio": "Quite new in the development community, I started a career change 3 years ago as a web developer. Beginning with the PHP/Symphony - Javascript combo, I followed for a 2 year internship in the Information Systems Division at La Poste, working on Openshift and CI/CD development and deployment then on an micro-services based application mixing back-end and front-end conception and development with Java/Spring and Angular. I'm now working at Zenika in the Dreamlab team, managing and creating applications for the information system of the company. Passionate about functional programming, I discovered Scala recently and working on a small side project on Elm."
    },
    {
      "key": "josian_chevalier",
      "name": "Josian Chevalier",
      "feature": false,
      "company": "Shodo",
      "companyLogo": "/images/partners/shodo.png",
      "city": "Paris, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GgelE_U6a-upP-mAC3GyfCEU8J6JiH8ocfaZcOn=s96-c",
      "socials": {
        "twitter": "JosianChevalier"
      },
      "bio": "Artisan logiciel chez Shodo, je me spécialise en Domain Driven Design. Je m’efforce à améliorer mon approche du développement et mes connaissances, ainsi qu’à sensibiliser les développeurs aux problématiques de qualité logicielle."
    },
    {
      "key": "jozan_aurelie",
      "name": "Aurélie Jozan",
      "feature": false,
      "company": "Bewizyu",
      "companyLogo": "/images/partners/bewizyu.png",
      "city": "Nantes, France",
      "photoUrl": "https://pbs.twimg.com/profile_images/1317181475448565761/o0bOjUGP_400x400.jpg",
      "socials": {
        "twitter": "aureliejoz"
      },
      "bio": "Ancienne responsable éditoriale dans une maison d'édition (print, web). \nAyant, entre autres, écrit aussi bien sur la cuisine, les loisirs créatifs que la course à pied. \n\nDevenue UX Designer il y a 8 ans avec des missions pour start up, grandes agences, grands comptes. \nAimant surtout la recherche utilisateurs, l'UX strategy et l'UX Writing. "
    },
    {
      "key": "julian_clemot",
      "name": "Julian Clemot",
      "feature": false,
      "company": "Ippon Technologies",
      "companyLogo": "/images/partners/ippon_technologies.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/ACNPEu-OwvJ67WbtpPO3HtVy_UnFQZcdxl8mV84Cxqxl=s512-p-k-rw-no",
      "socials": {
        "linkedin": "julianclemot",
        "github": "JulianClemot"
      },
      "bio": "Développeur Mobile depuis plus de 8 ans, et plus spécialement en Android, j'ai exercé mon métier au Luxembourg et en Irlande avant d'effectuer un retour au sources et de poser mes valises à Nantes pour de bon."
    },
    {
      "key": "julien_rollin",
      "name": "Julien Rollin",
      "feature": false,
      "company": "Talan Labs",
      "companyLogo": "/images/partners/talan_labs.png",
      "city": "Paris, France",
      "photoUrl": "https://avatars.githubusercontent.com/u/1086565?v=4",
      "socials": {
        "twitter": "jrollin",
        "github": "jrollin"
      },
      "bio": "CTO depuis quelques années maintenant\n\nJ’ai participé à la création d’équipes au sein de plusieurs startup, je suis désormais dans une ESN pour faire grandir les équipes mais surtout les faire s’épanouir.\n\nJe m’oriente de plus en plus vers des langages fonctionnels et de bas niveau comme Rust.\nJe pense qu’un super projet c’est d’abord une équipe qui est heureuse de travailler, découvrir  et partager ensemble !\n\n[Linkedin](https://www.linkedin.com/in/julien-rollin/)\n"
    },
    {
      "key": "katia_himeur",
      "name": "Katia Himeur",
      "feature": false,
      "company": "Cockpit io",
      "companyLogo": "/images/partners/cockpit_io.png",
      "city": "Paris, France",
      "photoUrl": "https://avatars.githubusercontent.com/u/40885659?v=4",
      "socials": {
        "twitter": "katia_tal"
      },
      "bio": "À la suite de plusieurs expériences en tant que développeuse backend, Katia s'intéresse très vite à l’ensemble du cycle de vie des applications, ce qui lui permet de faire ses armes dans le monde de l’OPS.\n\nAujourd’hui experte Cloud & DevOps, elle accompagne tout type d’organisation (Start up IoT, Plateforme de streaming, acteur du transport et organisations gouvernementales) sur des projets de migration vers le cloud, vers les conteneurs, vers Kubernetes et d’industrialisation (Méthodologies, IaC, industrialisation, optimisation…)."
    },
    {
      "key": "katie_hockman",
      "name": "Katie Hockman",
      "feature": false,
      "company": "Datadog",
      "city": "New York, USA",
      "photoUrl": "https://pbs.twimg.com/profile_images/1566402330257506304/9IZjPon6_400x400.jpg",
      "socials": {
        "twitter": "katie_hockman"
      },
      "bio": "Team lead (manager) at Datadog."
    },
    {
      "key": "laura_morinigo",
      "name": "Laura Morinigo",
      "company": "Samsung",
      "city": "London, UK",
      "feature": true,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GhKBShL3YJ-JUQ4fpafi2aZ_hVJwshJmRfY3Ko8H_o=s96-c",
      "socials": {
        "twitter": "thisislalaok",
        "github": "lauramorinigo",
        "linkedin": "laurasmorinigo"
      },
      "bio": "Web Developer Advocate at Samsung\nMentor & Google Developer Expert for Firebase"
    },
    {
      "key": "laurent_grangeau",
      "name": "Laurent Grangeau",
      "feature": false,
      "company": "Google",
      "companyLogo": "/images/partners/google.png",
      "city": "Paris, France",
      "photoUrl": "https://avatars3.githubusercontent.com/u/4910715?v=4",
      "socials": {
        "twitter": "laurentgrangeau",
        "github": "laurentgrangeau"
      },
      "bio": "Laurent Grangeau is a Cloud Solution Architect with more than 10+ years of experience. Former Java developer, he has since developed in .NET, with Agile and DevOps mindsets. He has been experimenting with cloud providers for more than 5+ years. Docker enthusiast from the beginning, he has experienced with building microservices and distributed systems. He loves to automate things and run distributed applications at scale."
    },
    {
      "key": "loic_mathieu",
      "name": "Loïc MATHIEU",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lille, France",
      "photoUrl": "https://lh3.googleusercontent.com/-RuLeNSAnwNs/AAAAAAAAAAI/AAAAAAAAF-Y/LEEahe2FSqU/photo.jpg",
      "socials": {
        "twitter": "loicmathieu",
        "github": "loicmathieu"
      },
      "bio": "Loïc est consultant formateur chez Zenika Lille. Il réalise des missions variées autour de Java, de la JVM, de l’architecture solution et de la performance. Ni le Cloud, ni Kubernetes, ni Kafka ne lui font peur; il aime relever des défis et apprendre de nouvelles choses. \nContributeur Quarkus depuis plus de 2 ans, il contribue à plusieurs extensions et parle régulièrement de Quarkus (et d’autres sujets) dans des meetups ou des conférences et même parfois sur son [blog](https://loicmathieu.fr)."
    },
    {
      "key": "louis_tournayre",
      "name": "Louis Tournayre",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "https://lh4.googleusercontent.com/-cVRndUQ_8GQ/AAAAAAAAAAI/AAAAAAAAAB8/HnFHwMBucLc/photo.jpg",
      "socials": {
        "twitter": "_louidji",
        "github": "louiznk"
      },
      "bio": "Formateur, développeur passionné et surtout Dev qui automatise l' Ops @ Zenika Lyon.   \nMes sujets de cœur sont Dev côté backend, kubernetes, cloud, automatisation, ...  \n\nJ'aime le partage et l'échange en tant que speaker et aussi en tant qu'organisateur de meetup (co-fondateur et co-organisateur du [GDG Cloud IoT Lyon](https://www.meetup.com/fr-FR/GDG-Cloud-Lyon/)). "
    },
    {
      "key": "manon_gruaz",
      "name": "Manon Gruaz",
      "feature": false,
      "company": "Haleo Clinic",
      "companyLogo": "/images/partners/haleo_clinic.png",
      "city": "Montreal, Canada",
      "photoUrl": "https://pbs.twimg.com/profile_images/527248115946885120/Xhpe3VQa_400x400.jpeg",
      "socials": {
        "twitter": "manongruaz"
      },
      "bio": "☻ Product Design Lead • I am Compassionate by Design • Speaker"
    },
    {
      "key": "martin_splitt",
      "name": "Martin Splitt",
      "company": "Google",
      "city": "Zürich, Switzerland",
      "feature": true,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gjl4PGXSEUsKMlYw14ckkOEAwcIkZdJuduO1Qi3SPs=s96-c",
      "socials": {
        "twitter": "g33konaut",
        "github": "AVGP",
        "linkedin": "martinsplitt"
      },
      "bio": "Friendly internet fairy & community unicorn & cheerleader. He/him. Developer 🥑  at Google. Build stuff, have fun! "
    },
    {
      "key": "marton_kodok",
      "name": "Marton Kodok",
      "feature": false,
      "company": "Reea",
      "companyLogo": "/images/partners/reea_net.png",
      "city": "Târgu Mureș, Romania",
      "photoUrl": "https://lh4.googleusercontent.com/-zHuP1iWEDI8/AAAAAAAAAAI/AAAAAAABdts/1S_KVVRrcg0/photo.jpg",
      "socials": {
        "twitter": "martonkodok",
        "github": "pentium10"
      },
      "bio": "Márton is a Google Developer Expert(GDE) On Cloud, top user on Stackoverflow with 186k reputation, software developer, international speaker & passionate about mountain hiking.\n\nActive contributor for open-source solutions like Beanstalkd console, and Riak admin interface. Expert in Cloud Technologies, Scalability, HA, Serverless, database systems like Google BigQuery, Redis, MySQL, Elasticsearch. Mentor and consultant for startups.\n\nFor my updated speaker bio visit: https://kodokmarton.com/speaker/"
    },
    {
      "key": "maud_nalpas",
      "name": "Maud Nalpas",
      "company": "Google",
      "city": "Berlin, Germany",
      "feature": false,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GgfHjfweLkPE3NakHDTVlYJr6JNuudqF-tcBmopdQ=s96-c",
      "socials": {
        "linkedin": "maudnalpas",
        "twitter": "maudnals"
      },
      "bio": "Maud is a developer relations engineer at Chrome for web security and privacy. \n\nBefore joining Google, Maud was a full-stack developer leaning towards frontend development. She knows first-hand that the concepts needed to build private and secure websites can feel puzzling and obscure⏤and she's on a mission to change just that.\n\nMaud lives in Berlin and enjoys windsurfing, baking cookies, and playing the guitar off-key."
    },
    {
      "key": "maximiliano_firtman",
      "name": "Maximiliano Firtman",
      "city": "Buenos Aires, Argentina",
      "feature": false,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GhrFJ3_esY0sGmRsKYs7Lz1FymbLMxb_NP9t1jRmA=s96-c",
      "socials": {
        "twitter": "firt",
        "github": "firtman"
      },
      "bio": "Hi!, I'm a freelance mobile+web developer, author, trainer and speaker focusing on Progressive Web Apps, Performance, Mobile and the Web Platform."
    },
    {
      "key": "melissa_cottin",
      "name": "Mélissa Cottin",
      "feature": false,
      "company": "Association ESTIMnumérique",
      "companyLogo": "/images/partners/association_estimnumerique.png",
      "city": "Rennes, France",
      "photoUrl": "https://www.letelegramme.fr/ar/imgproxy.php/images/2021/03/10/melissa-cottin-et-son-equipe-proposent-un-accompagnement_5571975.jpg?article=12716816&aaaammjj=12716816",
      "socials": {
        "twitter": "ESTIMnumerique"
      }
    },
    {
      "key": "monsieurbadia",
      "name": "Wiliam Badiabantou",
      "city": "Paris, France",
      "feature": false,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AAuE7mAA2Bv1Vye6TX7gpoJCzyZha5IkmfikZjw7DDAgWA",
      "socials": {
        "twitter": "monsieurbadia",
        "github": "monsieurbadia"
      },
      "bio": "artist • naive software engineer"
    },
    {
      "key": "moustapha_agack",
      "name": "Moustapha Agack",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "https://lh6.googleusercontent.com/-Vzdk20GHbaA/AAAAAAAAAAI/AAAAAAAAAC0/ejfSNuj_OjM/photo.jpg",
      "socials": {},
      "bio": "I smash my keyboard, sometimes cool stuff comes out of it"
    },
    {
      "key": "nicolas_berthaud",
      "name": "Nicolas Berthaud",
      "feature": false,
      "company": "ASI",
      "companyLogo": "/images/partners/asi.png",
      "city": "Nantes, France",
      "photoUrl": "https://media-exp1.licdn.com/dms/image/C4D03AQGBCgLBLYsSdA/profile-displayphoto-shrink_800_800/0/1606733838753?e=1668038400&v=beta&t=wHR764NQiDIs-mVoUijdQGcAxsXR7eVLAgAqK9Dwmj8",
      "socials": {
        "github": "nberthaud"
      },
      "bio": "Lead Developer back chez ASI, je cumule plus de 15 ans d'expérience dans le développement. Amoureux du CSS, j'ai fait mes classes en commençant comme intégrateur Web avant de devenir développeur PHP/Symfony. Au gré des projets j'ai été amené à élargir mon domaine d'action en faisant du mobile (angularJs, Angular, VueJs...). Côté serveur je suis également passé par la case Java/Spring. Les BDD ne sont pas en reste, j'ai voyagé avec MariaDb, Postgres, MongoDb, SQL Server et consorts. Depuis quelques années maintenant, j'ai suivi l'évolution de l'univers du Javascript côté serveur en touchant à NodeJs, Express et NestJs.  \nReconnu chez ASI comme une personne aimant partager et transmettre ses compétences, je suis amené à accompagner et former les juniors tout en concevant des solutions techniques sur mesures. Ce que j'aime avant tout c'est l'émulation d'équipe et le sentiment éprouvé lorsqu'un projet est mené à son terme avec la satisfaction du client."
    },
    {
      "key": "nicolas_greffard",
      "name": "Nicolas Greffard",
      "feature": false,
      "company": "Valeuriad",
      "companyLogo": "/images/partners/valeuriad.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh5.googleusercontent.com/-f0Q2OD1Ql1o/AAAAAAAAAAI/AAAAAAAAABM/w7DRPUk5iGc/photo.jpg",
      "socials": {},
      "bio": "Natif de Nantes où il obtient un DUT informatique, Nicolas Greffard part en Ecosse pour suivre un Master “Learning From Data” à l’université d’Edimbourg. Il reviendra finalement à Nantes pour y effectuer un doctorat dans le domaine de la visualisation d’information au sein de l’équipe Data User Knowledge du Laboratoire Informatique de Nantes Atlantique. Après deux ans passés en tant qu’ingénieur de recherche dans cette même équipe, il rejoint la société Expandium en 2015 comme data scientist puis, en 2018 la société Valeuriad avec la double casquette data scientist / responsable innovation. "
    },
    {
      "key": "nicolas_lepage",
      "name": "Nicolas Lepage",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh4.googleusercontent.com/-96ltg2kr4oc/AAAAAAAAAAI/AAAAAAAAAG4/bk0-E9b9kuU/photo.jpg",
      "socials": {
        "twitter": "njblepage",
        "github": "nlepage"
      },
      "bio": "I'm a passionate developer, currently employed at Zenika IT.\n\nI like to get involved in long-term projects, where I can improve people's daily lives with custom software fitting their needs."
    },
    {
      "key": "nicolas_morel",
      "name": "Nicolas Morel",
      "feature": false,
      "company": "Klaxoon",
      "companyLogo": "/images/partners/klaxoon.png",
      "city": "Rennes, France",
      "photoUrl": "https://raw.githubusercontent.com/nmorel/nmorel/80c3f032c4aeb1e7e890f90ed5cbece085e9e6b9/profile_square.jpg",
      "socials": {
        "twitter": "nmor3l",
        "github": "nmorel"
      },
      "bio": "Développeur web depuis 13 ans, j'ai travaillé principalement côté front (👋 IE6). Je suis actuellement Staff Software Engineer chez Klaxoon.\n"
    },
    {
      "key": "olivier_dangreaux",
      "name": "Olivier Dangréaux",
      "feature": false,
      "company": "ASI",
      "companyLogo": "/images/partners/asi.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GjjUoWNJiTI9Qdl9zwHYFwkx4uCbsuesPezKImO3oA",
      "socials": {
        "twitter": "odangreaux",
        "github": "odangreaux"
      },
      "bio": "J'évolue depuis plus de 20 ans dans le monde du développement et des architectures logicielles.\nFort de mon expérience, j’ai à cœur de répondre de manière pragmatique aux besoins techniques des projets et clients.\nAu travers de mon rôle d’architecte, j’amène une hauteur de vue et du conseil sur les problématiques techniques et je suis aussi en mesure d’apporter une expertise avancée dans des domaines tels que les architectures microservices, les technologies backend et frontend, le devops et le cloud. J’accompagne également les équipes sur leur montée en compétence technique et sur l’industrialisation des processus de production logicielle."
    },
    {
      "key": "olivier_huber",
      "name": "Olivier Huber",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Paris, France",
      "photoUrl": "https://lh3.googleusercontent.com/-gTUxVoYDe-0/AAAAAAAAAAI/AAAAAAAACjQ/7Wlr5vCU33g/photo.jpg",
      "socials": {
        "twitter": "olivierhuber",
        "github": "olivierhuber"
      },
      "bio": "Olivier Huber est un passionné de création logicielle. \nPour lui, notre métier est l'un des rares à nous donner la capacité de matérialiser une idée rapidement et à faible coût. \nIl intervient principalement pendant 24 ans en développement / conseil / formation pour des clients, écoles, associations. \nInitié il y a plus de 17 ans à l'agilité par la pratique de l'eXtrême Programming, il devient Agiliste convaincu et Scrum Master par la suite. \nIl donne des conférences (Devoxx, Mix-IT, BreizhCamp, …) sur divers sujets techniques ou non … \nIl rejoint Zenika en septembre 2008 pour évoluer parmi des collègues qui ont la même ferveur et afin de partager au maximum ses connaissances. \nIl y occupe actuellement divers rôles comme Directeur Technique et Formateur de Formateur.\n"
    },
    {
      "key": "olivier_leplus",
      "name": "Olivier Leplus",
      "feature": false,
      "company": "Amazon Web Services",
      "companyLogo": "/images/partners/aws.png",
      "city": "Paris, France",
      "photoUrl": "https://raw.githubusercontent.com/tagazok/tagazok.github.io/master/assets/images/avatar%20olivier.png",
      "socials": {
        "twitter": "olivierleplus",
        "github": "tagazok"
      },
      "bio": "Developer Advocate at AWS and Google Developer Expert in Web Technologies. I love to share knowledge (and love) among developers and people in general."
    },
    {
      "key": "olivier_mertens",
      "name": "Olivier Mertens",
      "feature": false,
      "company": "Microsoft",
      "companyLogo": "/images/partners/microsoft.png",
      "city": "Paris, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GjXkX4EHRf2driLz2VtvU-FYIfP_RMUVwIbcg4NQg=s96-c",
      "socials": {
        "twitter": "xam1311",
        "github": "olivMertens"
      },
      "bio": "Developer Relations @Microsoft\n13 years in electronic radar domain, 10 years in software development and sofware archictecture, created and lead the french sofware engineer community for an international consulting company for 4600 developpers @capgemini\n"
    },
    {
      "key": "olivier_perez",
      "name": "Olivier Perez",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Lyon, France",
      "photoUrl": "https://s.gravatar.com/avatar/a2f5dc08b4c8c463457c4ba89a574258?s=80&size=200",
      "socials": {
        "twitter": "olivierperez",
        "github": "olivierperez"
      },
      "bio": "Développeur piloté par la passion, j'ai arrêté de compter les langages que j'ai rencontré depuis mes 10 ans. À 33 ans, je suis aujourd'hui développeur Android chez Zenika, mes journées m'amènent à faire beaucoup de Kotlin mais mes soirées m'offrent la possiblité de faire joujou avec plein d'autres technos."
    },
    {
      "key": "olivier_poncet",
      "name": "Olivier Poncet",
      "feature": false,
      "company": "HAWKSWELL",
      "companyLogo": "/images/partners/hawkswell.png",
      "city": "Massy, France",
      "photoUrl": "https://avatars2.githubusercontent.com/u/29702924?v=4",
      "socials": {
        "twitter": "ponceto91",
        "github": "@ponceto"
      },
      "bio": "Geek, ex-nerd repenti, je code, je teste, je bricole, je soude et parfois fait sauter les plombs. CTO et Software Craftsman, je suis libriste dans l'âme et suis très impliqué dans le mouvement des logiciels libres."
    },
    {
      "key": "olivier_thierry",
      "name": "Olivier Thierry",
      "feature": false,
      "company": "ASI",
      "companyLogo": "/images/partners/asi.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh6.googleusercontent.com/-nCwPIFQPUqI/AAAAAAAAAAI/AAAAAAAAAAA/ACHi3rdEYq9ZHz9xv59b4o9VGbYn-MBaVg/mo/photo.jpg",
      "socials": {
        "twitter": "OThierryBzh",
        "github": "chawax"
      },
      "bio": "Je suis expert technique chez ASI et compte derrière moi près de  25 ans de développement. Après avoir commencé en Visual Basic, fait un peu de PHP et beaucoup de Java, je me suis tourné vers l'écosystème Javascript depuis une dizaine d'années. J'interviens sur des projets d'applications mobiles (Ionic, React Native), d'applications et sites web (React JS, Gatsby, Next.js) et de plateformes API (Node.js, NestJS). J'ai une appétence particulière pour l'écosystème React.  En tant qu'expert technique chez ASI, mon rôle est d'imaginer les solutions techniques pour résoudre les problèmes de nos clients, d'accompagner les développeurs pendant la réalisation des projets et d'assurer la qualité de nos réalisations. Je contribue également à l'animation de notre communauté technique. Ce qui me motive chaque jour : travailler en équipe et voir chacun d'entre nous évoluer et progresser,  techniquement mais aussi humainement !"
    },
    {
      "key": "philippe_charriere",
      "name": "Philippe Charrière",
      "feature": false,
      "company": "GitLab",
      "companyLogo": "/images/partners/gitlab.png",
      "city": "Lyon, France",
      "photoUrl": "https://lh6.googleusercontent.com/-PKwAMaR8DwQ/AAAAAAAAAAI/AAAAAAAAJNQ/H9mANtBiKmg/photo.jpg",
      "socials": {
        "twitter": "k33g_org",
        "github": "@k33g"
      },
      "bio": "J'ai plusieurs vies professionnelles (en même temps)\n- Senior Technical account manager pour GitLab 🦊\n- \"Boss\" chez Bot.Garden (en fait j'ai monté ma boîte pour tenter de \"transformer\" quelques side projects) 🤖🌼\n\nEt le reste du temps, si je ne suis pas à la pêche ou avec ma famille, je code en JavaScript, Golo, Kotlin et Scala"
    },
    {
      "key": "pierre_yves_aillet",
      "name": "Pierre-Yves Aillet",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/-vRueeeZ11qc/AAAAAAAAAAI/AAAAAAAAAA0/8WHvuJZv-kQ/photo.jpg",
      "socials": {
        "twitter": "pyaillet",
        "github": "pyaillet"
      },
      "bio": "Passionné d'informatique, Pierre-Yves travaille depuis 15 ans sur des technologies variées allant de PHP à Java en passant par Javascript. Son IHM de prédilection est la ligne de commande. Il est consultant chez Zenika Nantes et intervient sur des missions d’audit, d’expertise technique ou d’appui pour la mise en place d’outillages de développement."
    },
    {
      "key": "raphael_goetter",
      "name": "Raphael Goetter",
      "feature": true,
      "company": "Alsacreations",
      "companyLogo": "/images/partners/alsacreations.png",
      "city": "Strasbourg, France",
      "photoUrl": "https://avatars1.githubusercontent.com/u/491029?s=400&u=43cc6df4ef14309bd8a8c04b3207c0945840beae&v=4",
      "socials": {
        "twitter": "goetter",
        "github": "raphaelgoetter"
      },
      "bio": "Intégrateur du Dimanche, dompteur de CSS et tripoteur de HTML, créateur de la communauté et de l'agence web Alsacreations.\nÉvangéliste international de la Knack d'or et du picon-bière, Ambassadeur du Lorem Ipsum alsacien, et accessoirement auteur de divers livres sur CSS."
    },
    {
      "key": "ronan_robe",
      "name": "Ronan ROBE",
      "feature": false,
      "company": "Digital4Better",
      "companyLogo": "/images/partners/digital4better.png",
      "city": "Nantes, France",
      "photoUrl": "https://digital4better.com/media/ronan_nb200.jpeg",
      "socials": {
        "twitter": "RonanR01"
      },
      "bio": "Cofondateur de Digital4Better,  profil couteau suisse, expert en delivery de projets digitaux depuis 15ans.\nMembre du collectif Nantes Numérique Reponsable"
    },
    {
      "key": "sabrina_vigil",
      "name": "Sabrina Vigil",
      "feature": false,
      "company": "Decathlon",
      "companyLogo": "/images/partners/decathlon.png",
      "city": "Lille, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gi6NEdMdHxg9a95DWbZSKokMxxAp4lL6sk-guaNBw=s96-c",
      "socials": {
        "twitter": "sabrinaligiv"
      },
      "bio": "Je suis design lead sur le design system de Decathlon. Je suis passionnée par mon métier, par la conception de produit digitaux centré sur l’humain et le design d'interfaces. Je suis convaincue qu'une bonne expérience se dessine en équipe pluri-disciplinaire et je cherche sans relâche de meilleures façons de travailler ensemble. "
    },
    {
      "key": "simon_leclercq",
      "name": "Simon Leclercq",
      "feature": false,
      "company": "Decathlon United",
      "companyLogo": "/images/partners/decathlon_united.png",
      "city": "Lille, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GiiGQJjOzg3xx1EumYB8A6chatLmdk1uZEALJVF_Q=s96-c",
      "socials": {
        "twitter": "simon_leclercq",
        "github": "N0t-Simon"
      },
      "bio": "Sr. Designer @Decathlon | Decathlon Design System Core Team"
    },
    {
      "key": "sophie_luzin",
      "name": "Sophie Luzin",
      "feature": false,
      "company": "cbp",
      "companyLogo": "/images/partners/cbp.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gi_QofFJEVYs-OoMatRPyTvd5sSKOqT3Te78-WKyQ=s96-c",
      "socials": {},
      "bio": "Product Owner du département de la relation assurée. Toujours prête à donner de l'énergie dans l’amélioration du parcours utilisateur et la recherche de solutions innovantes.\n\n\n"
    },
    {
      "key": "sophie_n_goma",
      "name": "Sophie N'Goma",
      "feature": false,
      "company": "Beapp",
      "photoUrl": "https://media-exp1.licdn.com/dms/image/C4E03AQGivP56ckdssw/profile-displayphoto-shrink_800_800/0/1608065750530?e=1668643200&v=beta&t=1COYoFGA8i6G5uVML0yDlmcBvNCcTLR6dnNvcyxrCQ8",
      "city": "Nantes, France",
      "socials": {
        "linkedin": "sophie-n-goma-35824147"
      },
      "bio": "Après 20 ans en ecommerce et gestion de projets numériques, je me consacre désormais à déployer la démarche Numérique Responsable pour un numérique plus soutenable, plus éthique et plus humain. Animatrice pro de la Fresque du Numérique."
    },
    {
      "key": "stephane_cohan",
      "name": "Stéphane Cohan",
      "feature": false,
      "company": "Zenika",
      "companyLogo": "/images/partners/zenika.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh6.googleusercontent.com/-fUnQNoRRLLY/AAAAAAAAAAI/AAAAAAAAAAc/1C3kD_cyyiA/photo.jpg",
      "socials": {
        "twitter": "SCxPro",
        "github": "stephanecohan"
      }
    },
    {
      "key": "stephanie_baltus_bergamo",
      "name": "Stephanie Baltus-Bergamo",
      "feature": false,
      "company": "Kanop",
      "companyLogo": "/images/partners/leboncoin__joining_kanop_io_very_soon_.png",
      "city": "Paris, France",
      "photoUrl": "https://media-exp1.licdn.com/dms/image/C4D03AQGsA7CcMOWCuQ/profile-displayphoto-shrink_800_800/0/1516556347673?e=1668038400&v=beta&t=VBoJZmbvNOOtI-HhZW3t2D4g1BukKQ0vH64jBGrZh24",
      "socials": {
        "twitter": "steph_baltus",
        "github": "sbaltus"
      },
      "bio": "Dans la **data depuis plus de 10 ans**, j'ai commencé par de la **business intelligence** pour ensuite doucement migrer vers du **data engineering**,et un peu de développement backend.  \n\nJ'ai commencé ma carrière par 5 ans de consulting, et depuis 2013 je gravite autour des start-up scale-up.   J'ai notamment travaillé chez **Algolia, JobTeaser et leboncoin**.  \n\nDepuis fin 2020, je suis de retour chez **leboncoin** en tant que Lead Data Engineer, où je suis en charge de :\n- designer et developper des services data internes ou publiques\n- animer la communauté des data engineers \n- diffuser les bonnes pratiques et faire grandir les plus juniors \n\n\nJe m'intéresse beaucoup à tout ce qui est **software craftmanship** et essaie de diffuser cette approche autour de moi, notamment dans notre communauté de data engineers. \n\nEn dehors de la tech, je fais du triathlon, de la rando, de la moto et j'adore les Lego ! "
    },
    {
      "key": "stephanie_vachon",
      "name": "Stéphanie vachon",
      "feature": false,
      "company": "Nantes Numérique Responsable ",
      "companyLogo": "/images/partners/nantes_numerique_responsable_.png",
      "city": "Nantes, France",
      "photoUrl": "https://media-exp1.licdn.com/dms/image/C5603AQFo8YPoPAGBAA/profile-displayphoto-shrink_800_800/0/1562576689570?e=1668038400&v=beta&t=fhjM2XcnllO86wXh8QOFPEZhycmvzj8qcosTac249Wo",
      "socials": {
        "twitter": "vachon_steph"
      },
      "bio": "Formatrice à l'école Webstart en développement web depuis 2017\nIntégratrice et développeuse web depuis 2007\nExperte WordPress \nCo-fondatrice et co-présidente de Nantes Numérique Responsable"
    },
    {
      "key": "stephanie_walter",
      "name": "Stéphanie Walter",
      "feature": true,
      "company": "Maltem",
      "city": "Luxembourg",
      "photoUrl": "https://lh5.googleusercontent.com/-JNaq_Vb_eZ8/AAAAAAAAAAI/AAAAAAAA174/12IWIS1DUu8/photo.jpg",
      "socials": {
        "twitter": "walterstephanie",
        "linkedin": "stephaniewalterpro"
      },
      "bio": "Stéphanie Walter is a UX Researcher, Product Designer and Mobile Expert. She teaches, speaks and writes about design, accessibility and user experience. She enjoys good tea, bike rides, pixels & CSS and her D&D alignment is chaotic neutral. She's better at keeping her teammates alive in video games than her succulents, but, she tries.\n\nYou can find her on twitter https://twitter.com/WalterStephanie LinkedIn https://www.linkedin.com/in/stephaniewalterpro/ and her website https://stephaniewalter.design\n"
    },
    {
      "key": "stephanie_wong",
      "name": "Stephanie Wong",
      "company": "Google",
      "city": "San Franscisco, USA",
      "feature": true,
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GjpaCrsShiSjW1i53K0Sq2zHNtd9Whw-D_EYuSZkw=s96-c",
      "socials": {
        "twitter": "stephr_wong",
        "github": "swongra",
        "linkedin": "stephrwong"
      },
      "bio": "3x Webby Award-winning speaker, writer, producer, engineer, and developer content guru. I'm a leader at Google with a mission to blend storytelling and technology to create remarkable online developer content. I bring a unique combination of technical expertise, world-class public-speaking skills, sales and marketing expertise, and ability to lead organizational change. At Google, I've created over 400 videos, blogs, courses, tutorials, and podcasts that have helped developers learn fundamentals, solve their toughest challenges, and pass certifications all around the world.\n\nI'm the writer and creator of Google Cloud Youtube series like Eyes on Enterprise, Networking end-to-end, and Season of Scale. You might recognize me as the host of the weekly GCP Podcast and the Next onAir broadcast. Born and raised in San Francisco, I'm active in my community, fiercely supporting women in tech and mentoring students. \n\nStay up to date with my latest content:\nWebsite: stephrwong.com\nTwitter: @stephr_wong\nVideos: https://bit.ly/2Vkckh5\nArticles: https://bit.ly/gcp_blogs"
    },
    {
      "key": "sylvain_coudert",
      "name": "Sylvain Coudert",
      "feature": false,
      "company": "Freelance",
      "city": "Auvergne, France",
      "photoUrl": "https://lh3.googleusercontent.com/-ZtVSNeAJBDA/AAAAAAAAAAI/AAAAAAAAAAA/AKxrwcZp3iWQkGBz1RSRQToqhYmNnVaGdQ/mo/photo.jpg",
      "socials": {
        "twitter": "sylv_coud"
      },
      "bio": "Dev .NET depuis 2008, Freelance depuis 2018, Crafter devant l'éternel et debugger de l'infini!\nJ'aime apprendre, transmettre et découvrir.\nChanteur rockeur intermittent et papa à temps plein, j'aime également prendre le temps de regarder le vent agiter les feuilles d'un arbre."
    },
    {
      "key": "thibaud_le_gall",
      "name": "Thibaud Le Gall",
      "feature": false,
      "company": "SFEIR",
      "companyLogo": "/images/partners/sfeir.png",
      "city": "Paris, France",
      "photoUrl": "https://media-exp1.licdn.com/dms/image/C4D03AQEipeNFfcOmJg/profile-displayphoto-shrink_800_800/0/1594283183040?e=1668038400&v=beta&t=RaxB5w8pcD6ZU4mWOyFIYlYDwiKxLe7XhKuKmKsQWxg",
      "socials": {},
      "bio": "Hi, my name is Thibaud. I work in data and I have kink about making science-fiction and turn it to reality. For that purpose, I have a vast range of interests in advanced machine learning techniques, data engineering, devops and software engineering. Let's share our visions and talk of our common interests when we meet  ;)"
    },
    {
      "key": "tiffany_souterre",
      "name": "Tiffany Souterre",
      "feature": false,
      "company": "Amazon Web Services",
      "companyLogo": "/images/partners/aws.png",
      "city": "Paris, France",
      "photoUrl": "https://lh3.googleusercontent.com/-0XDx36TcjxU/AAAAAAAAAAI/AAAAAAABQkA/-hqGP4ktCDY/photo.jpg",
      "socials": {
        "twitter": "tiffanysouterre",
        "github": "amagash"
      },
      "bio": "I love science and I love data! After finishing a PhD in genetic engineering, I continued my quest for discovering new patterns through data science and machine learning. I worked for 3 years as ML/Data Engineer and I discovered the world of Developer relations at Microsoft. I now work as a Developer Advocate in AI/ML at AWS and I love sharing my passion with other developers."
    },
    {
      "key": "tony_jarriault",
      "name": "Tony Jarriault",
      "feature": false,
      "company": "Capgemini Sogeti",
      "companyLogo": "/images/partners/capgemini_sogeti_ats.png",
      "city": "Toulouse, France",
      "photoUrl": "https://avatars3.githubusercontent.com/u/7701382?v=4",
      "socials": {
        "twitter": "JarriaultTony",
        "github": "TJarriault"
      },
      "bio": "J'ai été responsable technique pour le build et le run de plate forme infogerée. J'ai participé au coaching des équipes sur le volet technique.\n  \nSur les sujets clouds publique, j'interviens sur des projets nationnaux ou à plus grand échelle, que ce soit pour des applications B2C que B2B.\n"
    },
    {
      "key": "tugdual_grall",
      "name": "Tugdual Grall",
      "feature": false,
      "company": "Redis Labs",
      "companyLogo": "/images/partners/redis_labs.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AAuE7mD3Lb5ovBNEnOvyIRJBtlwyYbMGSEBtHwfV7FYgqg",
      "socials": {
        "twitter": "tgrall",
        "github": "tgrall"
      },
      "bio": "Tugdual Grall, est Technical Account Manager chez Redis Lavs ou il accompagne les clients dans le déploiement de Redis, et participate a l'adoption de Redis et du NoSQL dans les communautés de développeurs.\n\nAvant de travailler chez Redis Labs, \"Tug\", était Directeur du Product Management chez Red Hat, Technical Evangelist chez MapR, MongoDB et Couchbase. Tug a également travaillé comme CTO chez eXo Platform, et comme Product Manager et Développeur sur la platform JavaEE d'Oracle.\n\nTugdual est également co-fondateur du Nantes JUG (Java Users Group) qui réunit tous les mois depuis 2008 les développeurs et architectes de la région nantaise."
    },
    {
      "key": "yannick_jacqueline",
      "name": "Yannick JACQUELINE",
      "feature": false,
      "company": "Ippon Technologies",
      "companyLogo": "/images/partners/ippon_technologies.png",
      "city": "Nantes, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14GiYpP53OCIKz-SfxsXJTyUJrWi7R9ajgcEzRTK5Yg",
      "socials": {}
    },
    {
      "key": "yulianna_khorolich",
      "name": "Yulianna Khorolich",
      "feature": false,
      "company": "SFEIR",
      "companyLogo": "/images/partners/sfeir.png",
      "city": "Paris, France",
      "photoUrl": "https://lh3.googleusercontent.com/a-/AOh14Gjw98lFAAoBcc-UjBkhccQ4lYypmgb_XG91mhTHuQ=s96-c",
      "socials": {},
      "bio": "Hi everyone! My name is Yulianna, and I am a Solutions Architect [Data & ML] at SFEIR. Even though I've always had a soft spot for data, I got the chance to participate in all phases of the software development lifecycle in my career path. At the moment, I enable data-driven decision-making by creating simple solutions that are easily maintainable, cost-effective, well-documented and documented, and most importantly, documented."
    }
  ]
}